[
  {
    "id": 1,
    "reference": "4:135",
    "ar": "۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُونُوا۟ قَوَّٰمِينَ بِٱلْقِسْطِ شُهَدَآءَ لِلَّهِ وَلَوْ عَلَىٰٓ أَنفُسِكُمْ أَوِ ٱلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًۭا فَٱللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا۟ ٱلْهَوَىٰٓ أَن تَعْدِلُوا۟ ۚ وَإِن تَلْوُۥٓا۟ أَوْ تُعْرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًۭا",
    "en": "Believers! Be upholders of justice, and bearers of witness to truth for the sake of Allah, even though it may either be against yourselves or against your parents and kinsmen, or the rich or the poor: for Allah is more concerned with their well-being than you are. Do not, then, follow your own desires lest you keep away from justice. If you twist or turn away from (the truth), know that Allah is well aware of all that you do.",
    "ur": "اے لوگو جو ایمان لائے ہو، انصاف کے علمبردار اور خدا واسطے کے گواہ بنو اگرچہ تمہارے انصاف اور تمہاری گواہی کی زد خود تمہاری اپنی ذات پر یا تمہارے والدین اور رشتہ داروں پر ہی کیوں نہ پڑتی ہو فریق معاملہ خواہ مالدار ہو یا غریب، اللہ تم سے زیادہ اُن کا خیر خواہ ہے لہٰذا اپنی خواہش نفس کی پیروی میں عدل سے باز نہ رہو اور اگر تم نے لگی لپٹی بات کہی یا سچائی سے پہلو بچایا تو جان رکھو کہ جو کچھ تم کرتے ہو اللہ کو اس کی خبر ہے"
  },
  {
    "id": 2,
    "reference": "4:148",
    "ar": "۞ لَّا يُحِبُّ ٱللَّهُ ٱلْجَهْرَ بِٱلسُّوٓءِ مِنَ ٱلْقَوْلِ إِلَّا مَن ظُلِمَ ۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا",
    "en": "Allah does not like speaking evil publicly unless one has been wronged. Allah is All-Hearing, All-Knowing.",
    "ur": "اللہ اس کو پسند نہیں کرتا کہ آدمی بد گوئی پر زبان کھولے، الا یہ کہ کسی پر ظلم کیا گیا ہو، اور اللہ سب کچھ سننے اور جاننے والا ہے"
  },
  {
    "id": 3,
    "reference": "5:8",
    "ar": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُونُوا۟ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَـَٔانُ قَوْمٍ عَلَىٰٓ أَلَّا تَعْدِلُوا۟ ۚ ٱعْدِلُوا۟ هُوَ أَقْرَبُ لِلتَّقْوَىٰ ۖ وَٱتَّقُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
    "en": "Believers! Be upright bearers of witness for Allah, and do not let the enmity of any people move you to deviate from justice. Act justly, that is nearer to God-fearing. And fear Allah. Surely Allah is well aware of what you do.",
    "ur": "اے لوگو جو ایمان لائے ہو! اللہ کی خاطر راستی پر قائم رہنے والے اور انصاف کی گواہی دینے والے بنو کسی گروہ کی دشمنی تم کو اتنا مشتعل نہ کر دے کہ انصاف سے پھر جاؤ عدل کرو، یہ خدا ترسی سے زیادہ مناسبت رکھتا ہے اللہ سے ڈر کر کام کرتے رہو، جو کچھ تم کرتے ہو اللہ اُس سے پوری طرح باخبر ہے"
  },
  {
    "id": 4,
    "reference": "5:42",
    "ar": "سَمَّٰعُونَ لِلْكَذِبِ أَكَّٰلُونَ لِلسُّحْتِ ۚ فَإِن جَآءُوكَ فَٱحْكُم بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ۖ وَإِن تُعْرِضْ عَنْهُمْ فَلَن يَضُرُّوكَ شَيْـًۭٔا ۖ وَإِنْ حَكَمْتَ فَٱحْكُم بَيْنَهُم بِٱلْقِسْطِ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ",
    "en": "They are listeners of falsehood and greedy devourers of unlawful earnings. If they come to you you may either judge between them or turn away from them. And were you to turn away from them they shall not be able to harm you; and were you to judge between them judge with justice. Surely Allah loves the just.",
    "ur": "یہ جھوٹ سننے والے اور حرام کے مال کھانے والے ہیں، لہٰذا اگر یہ تمہارے پاس (اپنے مقدمات لے کر) آئیں تو تمہیں اختیار دیا جاتا ہے کہ چاہو ان کا فیصلہ کرو ورنہ انکار کر دو انکار کر دو تو یہ تمہارا کچھ بگاڑ نہیں سکتے، اور فیصلہ کرو تو پھر ٹھیک ٹھیک انصاف کے ساتھ کرو کہ اللہ انصاف کرنے والوں کو پسند کرتا ہے"
  },
  {
    "id": 5,
    "reference": "11:85",
    "ar": "وَيَٰقَوْمِ أَوْفُوا۟ ٱلْمِكْيَالَ وَٱلْمِيزَانَ بِٱلْقِسْطِ ۖ وَلَا تَبْخَسُوا۟ ٱلنَّاسَ أَشْيَآءَهُمْ وَلَا تَعْثَوْا۟ فِى ٱلْأَرْضِ مُفْسِدِينَ",
    "en": "My people! Give full measure and weight with justice, do not diminish the goods of others, and do not go about creating corruption in the land.",
    "ur": "اور اے برادران قوم، ٹھیک ٹھیک انصاف کے ساتھ پورا ناپو اور تولو اور لوگوں کو ان کی چیزوں میں گھاٹا نہ دیا کرو اور زمین میں فساد نہ پھیلاتے پھرو"
  },
  {
    "id": 6,
    "reference": "16:76",
    "ar": "وَضَرَبَ ٱللَّهُ مَثَلًۭا رَّجُلَيْنِ أَحَدُهُمَآ أَبْكَمُ لَا يَقْدِرُ عَلَىٰ شَىْءٍۢ وَهُوَ كَلٌّ عَلَىٰ مَوْلَىٰهُ أَيْنَمَا يُوَجِّههُّ لَا يَأْتِ بِخَيْرٍ ۖ هَلْ يَسْتَوِى هُوَ وَمَن يَأْمُرُ بِٱلْعَدْلِ ۙ وَهُوَ عَلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
    "en": "Allah sets forth another parable: There are two men, one of whom is dumb and has no power over anything; he is a burden to his master, and wheresoever his master directs him, he fails to bring forth any good. Can such a person be the equal of one who enjoins justice and himself follows the Right Way?",
    "ur": "اللہ ایک اور مثال دیتا ہے دو آدمی ہیں ایک گونگا بہرا ہے، کوئی کام نہیں کر سکتا، اپنے آقا پر بوجھ بنا ہوا ہے، جدھر بھی وہ اسے بھیجے کوئی بھلا کام اُس سے بن نہ آئے دوسرا شخص ایسا ہے کہ انصاف کا حکم دیتا ہے اور خود راہ راست پر قائم ہے بتاؤ کیا یہ دونوں یکساں ہیں؟"
  },
  {
    "id": 7,
    "reference": "4:58",
    "ar": "۞ إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تُؤَدُّوا۟ ٱلْأَمَٰنَٰتِ إِلَىٰٓ أَهْلِهَا وَإِذَا حَكَمْتُم بَيْنَ ٱلنَّاسِ أَن تَحْكُمُوا۟ بِٱلْعَدْلِ ۚ إِنَّ ٱللَّهَ نِعِمَّا يَعِظُكُم بِهِۦٓ ۗ إِنَّ ٱللَّهَ كَانَ سَمِيعًۢا بَصِيرًۭا",
    "en": "Allah commands you to deliver trusts to those worthy of them; and when you judge between people, to judge with justice. Excellent is the admonition Allah gives you. Allah is All-Hearing, All-Seeing.",
    "ur": "مسلمانو! اللہ تمہیں حکم دیتا ہے کہ امانتیں اہل امانت کے سپرد کرو، اور جب لوگوں کے درمیان فیصلہ کرو تو عدل کے ساتھ کرو، اللہ تم کو نہایت عمدہ نصیحت کرتا ہے اور یقیناً اللہ سب کچھ سنتا اور دیکھتا ہے"
  },
  {
    "id": 8,
    "reference": "16:90",
    "ar": "۞ إِنَّ ٱللَّهَ يَأْمُرُ بِٱلْعَدْلِ وَٱلْإِحْسَٰنِ وَإِيتَآئِ ذِى ٱلْقُرْبَىٰ وَيَنْهَىٰ عَنِ ٱلْفَحْشَآءِ وَٱلْمُنكَرِ وَٱلْبَغْىِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ",
    "en": "Surely Allah enjoins justice, kindness and the doing of good to kith and kin, and forbids all that is shameful, evil and oppressive. He exhorts you so that you may be mindful.",
    "ur": "اللہ عدل اور احسان اور صلہ رحمی کا حکم دیتا ہے اور بدی و بے حیائی اور ظلم و زیادتی سے منع کرتا ہے وہ تمہیں نصیحت کرتا ہے تاکہ تم سبق لو"
  },
  {
    "id": 9,
    "reference": "42:42",
    "ar": "إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَظْلِمُونَ ٱلنَّاسَ وَيَبْغُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ ۚ أُو۟لَٰٓئِكَ لَهُمْ عَذَابٌ أَلِيمٌۭ",
    "en": "Blame attaches only to those who subject people to wrong and commit excesses on earth. A painful chastisement awaits them.",
    "ur": "ملامت کے مستحق تو وہ ہیں جو دوسروں پر ظلم کرتے ہیں اور زمین میں ناحق زیادتیاں کرتے ہیں ایسے لوگوں کے لیے دردناک عذاب ہے"
  },
  {
    "id": 10,
    "reference": "49:9",
    "ar": "وَإِن طَآئِفَتَانِ مِنَ ٱلْمُؤْمِنِينَ ٱقْتَتَلُوا۟ فَأَصْلِحُوا۟ بَيْنَهُمَا ۖ فَإِنۢ بَغَتْ إِحْدَىٰهُمَا عَلَى ٱلْأُخْرَىٰ فَقَٰتِلُوا۟ ٱلَّتِى تَبْغِى حَتَّىٰ تَفِىٓءَ إِلَىٰٓ أَمْرِ ٱللَّهِ ۚ فَإِن فَآءَتْ فَأَصْلِحُوا۟ بَيْنَهُمَا بِٱلْعَدْلِ وَأَقْسِطُوٓا۟ ۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ",
    "en": "If two parties of the believers happen to fight, make peace between them. But then, if one of them transgresses against the other, fight the one that transgresses until it reverts to Allah's command. And if it does revert, make peace between them with justice, and be equitable for Allah loves the equitable.",
    "ur": "اور اگر اہل ایمان میں سے دو گروہ آپس میں لڑ جائیں تو ان کے درمیان صلح کراؤ پھر اگر ان میں سے ایک گروہ دوسرے گروہ سے زیادتی کرے تو زیادتی کرنے والے سے لڑو یہاں تک کہ وہ اللہ کے حکم کی طرف پلٹ آئے پھر اگر وہ پلٹ آئے تو ان کے درمیان عدل کے ساتھ صلح کرا دو اور انصاف کرو کہ اللہ انصاف کرنے والوں کو پسند کرتا ہے"
  },
  {
    "id": 11,
    "reference": "60:8",
    "ar": "لَّا يَنْهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمْ يُقَٰتِلُوكُمْ فِى ٱلدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَٰرِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوٓا۟ إِلَيْهِمْ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ",
    "en": "Allah does not forbid that you be kind and just to those who did not fight against you on account of religion, nor drove you out of your homes. Surely Allah loves those who are equitable.",
    "ur": "اللہ تمیں اس بات سے نہیں روکتا کہ تم ان لوگوں کے ساتھ نیکی اور انصاف کا برتاؤ کرو جنہوں نے دین کے معاملہ میں تم سے جنگ نہیں کی ہے اور تمہیں تمہارے گھروں سے نہیں نکالا ہے اللہ انصاف کرنے والوں کو پسند کرتا ہے"
  }
]