[
  {
    "id": 1,
    "reference": "2:238",
    "ar": "حَٰفِظُوا۟ عَلَى ٱلصَّلَوَٰتِ وَٱلصَّلَوٰةِ ٱلْوُسْطَىٰ وَقُومُوا۟ لِلَّهِ قَٰنِتِينَ",
    "en": "Take great care of your Prayers, especially of a Prayer that has excellent qualities of Salat and stand before Allah like devoted servants.",
    "ur": "اپنی نمازوں کی نگہداشت رکھو، خصوصاً ایسی نماز کی جو محاسن صلوٰۃ کی جا مع ہو اللہ کے آگے اس طرح کھڑے ہو، جیسے فر ماں بردار غلام کھڑ ے ہوتے ہیں"
  },
  {
    "id": 2,
    "reference": "4:103",
    "ar": "فَإِذَا قَضَيْتُمُ ٱلصَّلَوٰةَ فَٱذْكُرُوا۟ ٱللَّهَ قِيَٰمًۭا وَقُعُودًۭا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا ٱطْمَأْنَنتُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ ۚ إِنَّ ٱلصَّلَوٰةَ كَانَتْ عَلَى ٱلْمُؤْمِنِينَ كِتَٰبًۭا مَّوْقُوتًۭا",
    "en": "When you have finished the Prayer, remember Allah -standing, and sitting, and reclining. And when you become secure, perform the regular Prayer. The Prayer is enjoined upon the believers at stated times.",
    "ur": "پھر جب نماز سے فارغ ہو جاؤ تو کھڑے اور بیٹھے اور لیٹے، ہر حال میں اللہ کو یاد کرتے رہو اور جب اطمینان نصیب ہو جائے تو پوری نماز پڑھو نما ز در حقیقت ایسا فرض ہے جو پابندی وقت کے ساتھ اہل ایمان پر لازم کیا گیا ہے"
  },
  {
    "id": 3,
    "reference": "7:205",
    "ar": "وَٱذْكُر رَّبَّكَ فِى نَفْسِكَ تَضَرُّعًۭا وَخِيفَةًۭ وَدُونَ ٱلْجَهْرِ مِنَ ٱلْقَوْلِ بِٱلْغُدُوِّ وَٱلْءَاصَالِ وَلَا تَكُن مِّنَ ٱلْغَٰفِلِينَ",
    "en": "And remember [O Prophet] your Lord in your mind, with humility and fear, and without raising your voice; remember Him in the morning and evening, and do not become of those who are negligent.",
    "ur": "اے نبیؐ، اپنے رب کو صبح و شام یاد کیا کرو دل ہی دل میں زاری اور خوف کے ساتھ اور زبان سے بھی ہلکی آواز کے ساتھ تم ان لوگوں میں سے نہ ہو جاؤ جو غفلت میں پڑے ہوئے ہیں"
  },
  {
    "id": 4,
    "reference": "11:114",
    "ar": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَىِ ٱلنَّهَارِ وَزُلَفًۭا مِّنَ ٱلَّيْلِ ۚ إِنَّ ٱلْحَسَنَٰتِ يُذْهِبْنَ ٱلسَّيِّـَٔاتِ ۚ ذَٰلِكَ ذِكْرَىٰ لِلذَّٰكِرِينَ",
    "en": "And establish the Prayer at the two ends of the day and in the first hours of the night. Indeed the good deeds drive away the evil deeds. This is a Reminder to those who are mindful of Allah.",
    "ur": "اور دیکھو، نماز قائم کرو دن کے دونوں سروں پر اور کچھ رات گزرنے پر درحقیقت نیکیاں برائیوں کو دور کر دیتی ہیں، یہ ایک یاد دہانی ہے ان لوگوں کے لیے جو خدا کو یاد رکھنے والے ہیں"
  },
  {
    "id": 5,
    "reference": "17:78",
    "ar": "أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمْسِ إِلَىٰ غَسَقِ ٱلَّيْلِ وَقُرْءَانَ ٱلْفَجْرِ ۖ إِنَّ قُرْءَانَ ٱلْفَجْرِ كَانَ مَشْهُودًۭا",
    "en": "Establish Prayer from the declining of the sun to the darkness of the night; and hold fast to the recitation of the Qur'an at dawn, for the recitation of the Qur'an at dawn is witnessed.",
    "ur": "نماز قائم کرو زوال آفتاب سے لے کر اندھیرے تک اور فجر کے قرآن کا بھی التزام کرو کیونکہ قرآن فجر مشہود ہوتا ہے"
  },
  {
    "id": 6,
    "reference": "17:79",
    "ar": "وَمِنَ ٱلَّيْلِ فَتَهَجَّدْ بِهِۦ نَافِلَةًۭ لَّكَ عَسَىٰٓ أَن يَبْعَثَكَ رَبُّكَ مَقَامًۭا مَّحْمُودًۭا",
    "en": "And rise from sleep during the night as well- this is an additional Prayer for you. Possibly your Lord will raise you to an honoured position.",
    "ur": "اور رات کو تہجد پڑھو، یہ تمہارے لیے نفل ہے، بعید نہیں کہ تمہارا رب تمہیں مقام محمود پر فائز کر دے"
  },
  {
    "id": 7,
    "reference": "24:36",
    "ar": "فِى بُيُوتٍ أَذِنَ ٱللَّهُ أَن تُرْفَعَ وَيُذْكَرَ فِيهَا ٱسْمُهُۥ يُسَبِّحُ لَهُۥ فِيهَا بِٱلْغُدُوِّ وَٱلْءَاصَالِ",
    "en": "(Those who obtain guidance to His light are found) in the houses which He has enjoined to raise up and to mention His name therein. In them such people glorify Him morning and evening",
    "ur": "(اُس کے نور کی طرف ہدایت پانے والے) اُن گھروں میں پائے جاتے ہیں جنہیں بلند کرنے کا، اور جن میں اپنے نام کی یاد کا اللہ نے اذن دیا ہے"
  },
  {
    "id": 8,
    "reference": "24:58",
    "ar": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لِيَسْتَـْٔذِنكُمُ ٱلَّذِينَ مَلَكَتْ أَيْمَٰنُكُمْ وَٱلَّذِينَ لَمْ يَبْلُغُوا۟ ٱلْحُلُمَ مِنكُمْ ثَلَٰثَ مَرَّٰتٍۢ ۚ مِّن قَبْلِ صَلَوٰةِ ٱلْفَجْرِ وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ ٱلظَّهِيرَةِ وَمِنۢ بَعْدِ صَلَوٰةِ ٱلْعِشَآءِ ۚ ثَلَٰثُ عَوْرَٰتٍۢ لَّكُمْ ۚ لَيْسَ عَلَيْكُمْ وَلَا عَلَيْهِمْ جُنَاحٌۢ بَعْدَهُنَّ ۚ طَوَّٰفُونَ عَلَيْكُم بَعْضُكُمْ عَلَىٰ بَعْضٍۢ ۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْءَايَٰتِ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌۭ",
    "en": "O Believers, your slaves and those of your children, who have not yet become sex conscious, must ask your permission before coming in to see you on three occasions: before the Fajr Prayer and at noon when you put off your clothes and after the `Isha' Prayer. These are your three times of privacy. There is no sin for you or for them if they come without permission at other times than these, for you have to visit: ne another over and over again. In this way Allah makes His Comm andments clear to you for He is All-Knowing, All-Wise.",
    "ur": "اے لوگو جو ایمان لائے ہو، لازم ہے کہ تمہارے مملوک اور تمہارے وہ بچے جو ابھی عقل کی حد کو نہیں پہنچے ہیں، تین اوقات میں اجازت لے کر تمہارے پاس آیا کریں: صبح کی نماز سے پہلے، اور دوپہر کو جبکہ تم کپڑے اتار کر رکھ دیتے ہو، اور عشاء کی نماز کے بعد یہ تین وقت تمہارے لیے پردے کے وقت ہیں اِن کے بعد وہ بلا اجازت آئیں تو نہ تم پر کوئی گناہ ہے نہ اُن پر، تمہیں ایک دوسرے کے پاس بار بار آنا ہی ہوتا ہے اس طرح اللہ تمہارے لیے اپنے ارشادات کی توضیح کرتا ہے، اور وہ علیم و حکیم ہے"
  },
  {
    "id": 9,
    "reference": "50:39",
    "ar": "فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ ٱلْغُرُوبِ",
    "en": "Hence bear with patience whatever they say, and celebrate your Lord's glory before the rising of the sun and before its setting;",
    "ur": "پس اے نبیؐ، جو باتیں یہ لوگ بناتے ہیں ان پر صبر کرو، اور اپنے رب کی حمد کے ساتھ اس کی تسبیح کرتے رہو، طلوع آفتاب اور غروب آفتاب سے پہلے"
  },
  {
    "id": 10,
    "reference": "50:40",
    "ar": "وَمِنَ ٱلَّيْلِ فَسَبِّحْهُ وَأَدْبَٰرَ ٱلسُّجُودِ",
    "en": "and in the night, too, celebrate His glory, in the wake of prostration.",
    "ur": "اور رات کے وقت پھر اُس کی تسبیح کرو اور سجدہ ریزیوں سے فارغ ہونے کے بعد بھی"
  },
  {
    "id": 11,
    "reference": "73:2",
    "ar": "قُمِ ٱلَّيْلَ إِلَّا قَلِيلًۭا",
    "en": "Stand up in Prayer by night, all but a small part of it;",
    "ur": "رات کو نماز میں کھڑے رہا کرو مگر کم"
  }
]