[
  {
    "id": 1,
    "reference": "2:24",
    "ar": "فَإِن لَّمْ تَفْعَلُوا۟ وَلَن تَفْعَلُوا۟ فَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِى وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَٰفِرِينَ",
    "en": "But if you do not do this, and you can never do this, then fear the Fire which has been prepared for the disbelievers and which shall have men and stones for fuel.",
    "ur": "تو یہ کام کر کے دکھاؤ، لیکن اگر تم نے ایسا نہ کیا اور یقیناً کبھی نہیں کرسکتے، تو ڈرو اس آگ سے جس کا ایندھن بنیں گے انسان اور پتھر، جو مہیا کی گئی ہے منکرین حق کے لیے"
  },
  {
    "id": 2,
    "reference": "2:162",
    "ar": "خَٰلِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
    "en": "Their punishment shall not be lightened, nor shall they be reprieved.",
    "ur": "اسی لعنت زدگی کی حالت میں وہ ہمیشہ رہیں گے، نہ اُن کی سز امیں تخفیف ہوگی اور نہ انہیں پھر کوئی دوسری مہلت دی جائے گی"
  },
  {
    "id": 3,
    "reference": "3:88",
    "ar": "خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
    "en": "Thus shall they abide. Neither shall their chastisement be granted nor shall they be granted any respite.",
    "ur": "اِسی حالت میں وہ ہمیشہ رہیں گے، نہ ان کی سزا میں تخفیف ہوگی اور نہ انہیں مہلت دی جائے گی"
  },
  {
    "id": 4,
    "reference": "4:56",
    "ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ بِـَٔايَٰتِنَا سَوْفَ نُصْلِيهِمْ نَارًۭا كُلَّمَا نَضِجَتْ جُلُودُهُم بَدَّلْنَٰهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا۟ ٱلْعَذَابَ ۗ إِنَّ ٱللَّهَ كَانَ عَزِيزًا حَكِيمًۭا",
    "en": "Surely We shall cast those who reject Our signs into the Fire; and as often as their skins are burnt out, We shall give them other skins in exchange that they may fully taste the chastisement. Surely Allah is All-Mighty, All-Wise.",
    "ur": "جن لوگوں نے ہماری آیات کو ماننے سے انکار کر دیا ہے انہیں بالیقین ہم آگ میں جھونکیں گے اور جب ان کے بدن کی کھال گل جائے گی تو اس کی جگہ دوسری کھال پیدا کر دیں گے تاکہ وہ خوب عذاب کا مزہ چکھیں، اللہ بڑی قدرت رکھتا ہے اور اپنے فیصلوں کو عمل میں لانے کی حکمت خوب جانتا ہے"
  },
  {
    "id": 5,
    "reference": "6:70",
    "ar": "وَذَرِ ٱلَّذِينَ ٱتَّخَذُوا۟ دِينَهُمْ لَعِبًۭا وَلَهْوًۭا وَغَرَّتْهُمُ ٱلْحَيَوٰةُ ٱلدُّنْيَا ۚ وَذَكِّرْ بِهِۦٓ أَن تُبْسَلَ نَفْسٌۢ بِمَا كَسَبَتْ لَيْسَ لَهَا مِن دُونِ ٱللَّهِ وَلِىٌّۭ وَلَا شَفِيعٌۭ وَإِن تَعْدِلْ كُلَّ عَدْلٍۢ لَّا يُؤْخَذْ مِنْهَآ ۗ أُو۟لَٰٓئِكَ ٱلَّذِينَ أُبْسِلُوا۟ بِمَا كَسَبُوا۟ ۖ لَهُمْ شَرَابٌۭ مِّنْ حَمِيمٍۢ وَعَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْفُرُونَ",
    "en": "Leave alone those who have made a sport and a pastime of their religion and whom the life of the world has beguiled. But continue to admonish them (with the Qur'an) lest a man should be caught for what he has himself earned for there shall neither be any protector nor intercessor apart from Allah; and though he may offer any conceivable ransom it shall not be accepted from him, for such people have been caught for the deeds that they have themselves earned. Boiling water to drink and a painful chastisement to suffer for their unbelief is what awaits them.",
    "ur": "چھوڑو اُن لوگوں کو جنہوں نے اپنے دین کو کھیل اور تماشا بنا رکھا ہے اور جنہیں دنیا کی زندگی فریب میں مبتلا کیے ہوئے ہے ہاں مگر یہ قرآن سنا کر نصیحت اور تنبیہ کرتے رہو کہ کہیں کوئی شخص اپنے کیے کرتوتوں کے وبال میں گرفتار نہ ہو جائے، اور گرفتار بھی اِس حال میں ہو کہ اللہ سے بچانے والا کوئی حامی و مدد گار اور کوئی سفارشی اس کے لیے نہ ہو، اور گر وہ ہر ممکن چیز فدیہ میں دے کر چھوٹنا چاہے تو وہ بھی اس سے قبول نہ کی جائے، کیونکہ ایسے لوگ تو خود اپنی کمائی کے نتیجہ میں پکڑے جائیں گے، ان کو تو اپنے انکار حق کے معاوضہ میں کھولتا ہوا پانی پینے کو اور درد ناک عذاب بھگتنے کو ملے گا"
  },
  {
    "id": 6,
    "reference": "7:41",
    "ar": "لَهُم مِّن جَهَنَّمَ مِهَادٌۭ وَمِن فَوْقِهِمْ غَوَاشٍۢ ۚ وَكَذَٰلِكَ نَجْزِى ٱلظَّٰلِمِينَ",
    "en": "Hell shall be their bed, and also above them their covering. Thus do We reward the wrong-doers.",
    "ur": "ان کے لیے تو جہنم کا بچھونا ہوگا اور جہنم ہی کا اوڑھنا یہ ہے وہ جزا جو ہم ظالموں کو دیا کرتے ہیں"
  },
  {
    "id": 7,
    "reference": "7:50",
    "ar": "وَنَادَىٰٓ أَصْحَٰبُ ٱلنَّارِ أَصْحَٰبَ ٱلْجَنَّةِ أَنْ أَفِيضُوا۟ عَلَيْنَا مِنَ ٱلْمَآءِ أَوْ مِمَّا رَزَقَكُمُ ٱللَّهُ ۚ قَالُوٓا۟ إِنَّ ٱللَّهَ حَرَّمَهُمَا عَلَى ٱلْكَٰفِرِينَ",
    "en": "And the people of the Fire will cry out to the people of Paradise: 'Pour out some water on us or throw at us something of what Allah has bestowed upon you.' They will reply: 'Allah has forbidden them to the deniers of the truth,",
    "ur": "اور دوزخ کے لوگ جنت والوں کو پکاریں گے کہ کچھ تھوڑا سا پانی ہم پر ڈال دو یا جو رزق اللہ نے تمہیں دیا ہے اُسی میں سے کچھ پھینک دو وہ جواب دیں گے کہ \"اللہ نے یہ دونوں چیزیں اُن منکرین حق پر حرام کر دی ہیں"
  },
  {
    "id": 8,
    "reference": "9:35",
    "ar": "يَوْمَ يُحْمَىٰ عَلَيْهَا فِى نَارِ جَهَنَّمَ فَتُكْوَىٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ ۖ هَٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ فَذُوقُوا۟ مَا كُنتُمْ تَكْنِزُونَ",
    "en": "on a Day when they shall be heated up in the Fire of Hell, and their foreheads and their sides and their backs shall be branded with it, (and they shall be told): \"This is the treasure which you hoarded for yourselves. Taste, then, the punishment for what you have hoarded.\"",
    "ur": "ایک دن آئے گا کہ اسی سونے چاندی پر جہنم کی آگ دہکائی جائے گی اور پھر اسی سے ان لوگوں کی پیشانیوں اور پہلوؤں اور پیٹھوں کو داغا جائے گا یہ ہے وہ خزانہ جو تم نے اپنے لیے جمع کیا تھا، لو اب اپنی سمیٹی ہوئی دولت کا مزہ چکھو"
  },
  {
    "id": 9,
    "reference": "10:27",
    "ar": "وَٱلَّذِينَ كَسَبُوا۟ ٱلسَّيِّـَٔاتِ جَزَآءُ سَيِّئَةٍۭ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٌۭ ۖ مَّا لَهُم مِّنَ ٱللَّهِ مِنْ عَاصِمٍۢ ۖ كَأَنَّمَآ أُغْشِيَتْ وُجُوهُهُمْ قِطَعًۭا مِّنَ ٱلَّيْلِ مُظْلِمًا ۚ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "en": "Those who do evil deeds, the recompense of an evil deed is its like, and humiliation shall spread over them and there will be none to protect them from Allah. Darkness will cover their faces as though they were veiled with the dark blackness of night. These are the people of the Fire and in it they shall abide.",
    "ur": "اور جن لوگوں نے بُرائیاں کمائیں ان کی بُرائی جیسی ہے ویسا ہی وہ بدلہ پائیں گے، ذلّت ان پر مسلّط ہو گی، کوئی اللہ سے ان کو بچانے والا نہ ہو گا، ان کے چہروں پر ایسی تاریکی چھائی ہوئی ہو گی جیسے رات کے سیاہ پردے ان پر پڑے ہوئے ہوں، وہ دوزخ کے مستحق ہیں جہاں وہ ہمیشہ رہیں گے"
  },
  {
    "id": 10,
    "reference": "13:5",
    "ar": "۞ وَإِن تَعْجَبْ فَعَجَبٌۭ قَوْلُهُمْ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِى خَلْقٍۢ جَدِيدٍ ۗ أُو۟لَٰٓئِكَ ٱلَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ ۖ وَأُو۟لَٰٓئِكَ ٱلْأَغْلَٰلُ فِىٓ أَعْنَاقِهِمْ ۖ وَأُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "en": "And were you to wonder, then wondrous indeed is the saying of those who say: \"What! After we have been reduced to dust, shall we be created afresh?\" They are the ones who disbelieved in their Lord; they are the ones who shall have shackles around their necks. They shall be the inmates of the Fire, wherein they will abide for ever.",
    "ur": "اب اگر تمہیں تعجب کرنا ہے تو تعجب کے قابل لوگوں کا یہ قول ہے کہ \"جب ہم مر کر مٹی ہو جائیں گے تو کیا ہم نئے سرے سے پیدا کیے جائیں گے؟\" یہ وہ لوگ ہیں جنہوں نے اپنے رب سے کفر کیا ہے یہ وہ لوگ ہیں جن کی گردنوں میں طوق پڑے ہوئے ہیں یہ جہنمی ہیں اور جہنم میں ہمیشہ رہیں گے"
  },
  {
    "id": 11,
    "reference": "14:16",
    "ar": "مِّن وَرَآئِهِۦ جَهَنَّمُ وَيُسْقَىٰ مِن مَّآءٍۢ صَدِيدٍۢ",
    "en": "Hell is before him and he shall be made to drink of the oozing pus,",
    "ur": "پھر اس کے بعد آگے اس کے لیے جہنم ہے وہاں اُسے کچ لہو کا سا پانی پینے کو دیا جائے گا"
  },
  {
    "id": 12,
    "reference": "14:29",
    "ar": "جَهَنَّمَ يَصْلَوْنَهَا ۖ وَبِئْسَ ٱلْقَرَارُ",
    "en": "Hell, wherein they shall roast? How wretched a place to settle in!",
    "ur": "یعنی جہنم، جس میں وہ جھلسے جائیں گے اور وہ بد ترین جائے قرار ہے"
  },
  {
    "id": 13,
    "reference": "14:50",
    "ar": "سَرَابِيلُهُم مِّن قَطِرَانٍۢ وَتَغْشَىٰ وُجُوهَهُمُ ٱلنَّارُ",
    "en": "their garments shall be black as if made out of pitch, and flames of the Fire shall cover their faces",
    "ur": "تارکول کے لباس پہنے ہوئے ہوں گے اور آگ کے شعلے اُن کے چہروں پر چھائے جا رہے ہوں گے"
  },
  {
    "id": 14,
    "reference": "17:97",
    "ar": "وَمَن يَهْدِ ٱللَّهُ فَهُوَ ٱلْمُهْتَدِ ۖ وَمَن يُضْلِلْ فَلَن تَجِدَ لَهُمْ أَوْلِيَآءَ مِن دُونِهِۦ ۖ وَنَحْشُرُهُمْ يَوْمَ ٱلْقِيَٰمَةِ عَلَىٰ وُجُوهِهِمْ عُمْيًۭا وَبُكْمًۭا وَصُمًّۭا ۖ مَّأْوَىٰهُمْ جَهَنَّمُ ۖ كُلَّمَا خَبَتْ زِدْنَٰهُمْ سَعِيرًۭا",
    "en": "Whomsoever Allah guides is rightly guided; and whomsoever Allah lets go astray, you shall find none - apart from Him - who could protect him. We shall muster them all on the Day of Resurrection, on their faces - blind and dumb and deaf. Hell shall be their refuge. Every time its Fire subsides, We will intensify for them its flame.",
    "ur": "جس کو اللہ ہدایت دے وہی ہدایت پانے والا ہے، اور جسے وہ گمراہی میں ڈال دے تو اسکے سوا ایسے لوگوں کے لیے تو کوئی حامی و ناصر نہیں پا سکتا ان لوگوں کو ہم قیامت کے روز اوندھے منہ کھینچ لائیں گے، اندھے، گونگے اور بہرے اُن کا ٹھکانا جہنم ہے جب کبھی اس کی آگ دھیمی ہونے لگے گی ہم اسے اور بھڑکا دیں گے"
  },
  {
    "id": 15,
    "reference": "18:29",
    "ar": "وَقُلِ ٱلْحَقُّ مِن رَّبِّكُمْ ۖ فَمَن شَآءَ فَلْيُؤْمِن وَمَن شَآءَ فَلْيَكْفُرْ ۚ إِنَّآ أَعْتَدْنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا ۚ وَإِن يَسْتَغِيثُوا۟ يُغَاثُوا۟ بِمَآءٍۢ كَٱلْمُهْلِ يَشْوِى ٱلْوُجُوهَ ۚ بِئْسَ ٱلشَّرَابُ وَسَآءَتْ مُرْتَفَقًا",
    "en": "And proclaim: \"This is the Truth from your Lord. Now let him who will, believe; and let him who will, disbelieve. We have prepared a Fire for the wrong-doers whose billowing folds encompass them. If they ask for water, they will be served with a drink like dregs of oil that will scald their faces. How dreadful a drink, and how evil an abode!",
    "ur": "صاف کہہ دو کہ یہ حق ہے تمہارے رب کی طرف سے، اب جس کا جی چاہے مان لے اور جس کا جی چاہے انکار کر دے ہم نے (انکار کرنے والے) ظالموں کے لیے ایک آگ تیار کر رکھی ہے جس کی لپٹیں انہیں گھیرے میں لے چکی ہیں وہاں اگر وہ پانی مانگیں گے توایسے پانی سے ان کی تواضع کی جائے گی جو تیل کی تلچھٹ جیسا ہوگا اور ان کا منہ بھون ڈالے گا، بدترین پینے کی چیز اور بہت بری آرامگاہ!"
  },
  {
    "id": 16,
    "reference": "19:68",
    "ar": "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّۭا",
    "en": "By your Lord, We will surely muster them and the devils together. Then We will surely bring them all, on their knees, around Hell,",
    "ur": "تیرے رب کی قسم، ہم ضرور ان سب کو اور ان کے ساتھ شیاطین کو بھی گھیر لائیں گے، پھر جہنم کے گرد لا کر انہیں گھٹنوں کے بل گرا دیں گے"
  },
  {
    "id": 17,
    "reference": "19:86",
    "ar": "وَنَسُوقُ ٱلْمُجْرِمِينَ إِلَىٰ جَهَنَّمَ وِرْدًۭا",
    "en": "and We shall drive the guilty ones to Hell as a thirsty herd.",
    "ur": "اور مجرموں کو پیاسے جانوروں کی طرح جہنم کی طرف ہانک لے جائیں گے"
  },
  {
    "id": 18,
    "reference": "20:74",
    "ar": "إِنَّهُۥ مَن يَأْتِ رَبَّهُۥ مُجْرِمًۭا فَإِنَّ لَهُۥ جَهَنَّمَ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ",
    "en": "The truth is that Hell awaits him who comes to his Lord laden with sin; he shall neither die in it nor live.",
    "ur": "حقیقت یہ ہے کہ جو مجرم بن کر اپنے رب کے حضور حاضر ہوگا اُس کے لیے جہنم ہے جس میں وہ نہ جیے گا نہ مرے گا"
  },
  {
    "id": 19,
    "reference": "21:100",
    "ar": "لَهُمْ فِيهَا زَفِيرٌۭ وَهُمْ فِيهَا لَا يَسْمَعُونَ",
    "en": "There they shall groan with anguish and the din and noise in Hell will not let them hear anything.",
    "ur": "وہاں وہ پھنکارے ماریں گے اور حال یہ ہو گا کہ اس میں کان پڑی آواز نہ سنائی دے گی"
  },
  {
    "id": 20,
    "reference": "22:19",
    "ar": "۞ هَٰذَانِ خَصْمَانِ ٱخْتَصَمُوا۟ فِى رَبِّهِمْ ۖ فَٱلَّذِينَ كَفَرُوا۟ قُطِّعَتْ لَهُمْ ثِيَابٌۭ مِّن نَّارٍۢ يُصَبُّ مِن فَوْقِ رُءُوسِهِمُ ٱلْحَمِيمُ",
    "en": "These two groups (the believers and unbelievers) are in dispute about their Lord. As for those that disbelieve, garments of fire have been cut out for them; boiling water shall be poured down over their heads,",
    "ur": "یہ دو فریق ہیں جن کے درمیان اپنے رب کے معاملے کا جھگڑا ہے اِن میں سے وہ لوگ جنہوں نے کفر کیا ہے اُن کے لیے آگ کے لباس کاٹے جا چکے ہیں، اُن کے سروں پر کھَولتا ہوا پانی ڈالا جائے گا"
  },
  {
    "id": 21,
    "reference": "22:20",
    "ar": "يُصْهَرُ بِهِۦ مَا فِى بُطُونِهِمْ وَٱلْجُلُودُ",
    "en": "causing (not only) their skins but all that is in their bellies as well to melt away.",
    "ur": "جس سے اُن کی کھالیں ہی نہیں پیٹ کے اندر کے حصے تک گل جائیں گے"
  },
  {
    "id": 22,
    "reference": "22:21",
    "ar": "وَلَهُم مَّقَٰمِعُ مِنْ حَدِيدٍۢ",
    "en": "There shall be maces of iron to lash them.",
    "ur": "اور اُن کی خبر لینے کے لیے لوہے کے گُرز ہوں گے"
  },
  {
    "id": 23,
    "reference": "22:22",
    "ar": "كُلَّمَآ أَرَادُوٓا۟ أَن يَخْرُجُوا۟ مِنْهَا مِنْ غَمٍّ أُعِيدُوا۟ فِيهَا وَذُوقُوا۟ عَذَابَ ٱلْحَرِيقِ",
    "en": "Whenever they try, in their anguish, to escape from Hell, they will be driven back into it, (and shall be told): \"Now taste the torment of burning.\"",
    "ur": "جب کبھی وہ گھبرا کر جہنّم سے نکلنے کی کوشش کریں گے پھر اُسی میں دھکیل دیے جائیں گے کہ چکھو اب جلنے کی سزا کا مزا"
  },
  {
    "id": 24,
    "reference": "23:104",
    "ar": "تَلْفَحُ وُجُوهَهُمُ ٱلنَّارُ وَهُمْ فِيهَا كَٰلِحُونَ",
    "en": "The Fire shall scorch their faces, exposing their jaws.",
    "ur": "آگ ان کے چہروں کی کھال چاٹ جائے گی اور اُن کے جبڑے باہر نکل آئیں گے"
  },
  {
    "id": 25,
    "reference": "25:12",
    "ar": "إِذَا رَأَتْهُم مِّن مَّكَانٍۭ بَعِيدٍۢ سَمِعُوا۟ لَهَا تَغَيُّظًۭا وَزَفِيرًۭا",
    "en": "When it will see them from afar, they will hear the sounds of its raging and roaring.",
    "ur": "وہ جب دور سے اِن کو دیکھے گی تو یہ اُس کے غضب اور جوش کی آوازیں سن لیں گے"
  },
  {
    "id": 26,
    "reference": "25:13",
    "ar": "وَإِذَآ أُلْقُوا۟ مِنْهَا مَكَانًۭا ضَيِّقًۭا مُّقَرَّنِينَ دَعَوْا۟ هُنَالِكَ ثُبُورًۭا",
    "en": "And when they are chained together and flung into a narrow space therein, they will begin to call for death.",
    "ur": "اور جب یہ دست و پا بستہ اُس میں ایک تنگ جگہ ٹھونسے جائیں گے تو اپنی موت کو پکارنے لگیں گے"
  },
  {
    "id": 27,
    "reference": "26:91",
    "ar": "وَبُرِّزَتِ ٱلْجَحِيمُ لِلْغَاوِينَ",
    "en": "and the Fire will be uncovered for those who strayed,",
    "ur": "اور دوزخ بہکے ہوئے لوگوں کے سامنے کھول دی جائے گی"
  },
  {
    "id": 28,
    "reference": "26:94",
    "ar": "فَكُبْكِبُوا۟ فِيهَا هُمْ وَٱلْغَاوُۥنَ",
    "en": "Then the idols and those who strayed will be hurled into the Fire headlong, one upon another,",
    "ur": "پھر وہ معبود اور یہ بہکے ہوئے لوگ"
  },
  {
    "id": 29,
    "reference": "26:101",
    "ar": "وَلَا صَدِيقٍ حَمِيمٍۢ",
    "en": "nor do we have a truly sincere friend.",
    "ur": "اور نہ کوئی جگری دوست"
  },
  {
    "id": 30,
    "reference": "35:36",
    "ar": "وَٱلَّذِينَ كَفَرُوا۟ لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضَىٰ عَلَيْهِمْ فَيَمُوتُوا۟ وَلَا يُخَفَّفُ عَنْهُم مِّنْ عَذَابِهَا ۚ كَذَٰلِكَ نَجْزِى كُلَّ كَفُورٍۢ",
    "en": "As for those who disbelieved, the Fire of Hell awaits them. There they shall not be finished off and die; nor will the torment (of Hell) be lightened for them. Thus do We requite every thankless being.",
    "ur": "اور جن لوگوں نے کفر کیا ہے اُن کے لیے جہنم کی آگ ہے نہ اُن کا قصہ پاک کر دیا جائے گا کہ مر جائیں اور نہ اُن کے لیے جہنم کے عذاب میں کوئی کمی کی جائے گی اِس طرح ہم بدلہ دیتے ہیں ہر اُس شخص کو جو کفر کرنے والا ہو"
  },
  {
    "id": 31,
    "reference": "37:62",
    "ar": "أَذَٰلِكَ خَيْرٌۭ نُّزُلًا أَمْ شَجَرَةُ ٱلزَّقُّومِ",
    "en": "Is this a better hospitality or the tree of al-Zaqqum?",
    "ur": "بولو، یہ ضیافت اچھی ہے یا زقوم کا درخت؟"
  },
  {
    "id": 32,
    "reference": "37:63",
    "ar": "إِنَّا جَعَلْنَٰهَا فِتْنَةًۭ لِّلظَّٰلِمِينَ",
    "en": "We have made this tree a trial for the wrong-doers.",
    "ur": "ہم نے اُس درخت کو ظالموں کے لیے فتنہ بنا دیا ہے"
  },
  {
    "id": 33,
    "reference": "37:64",
    "ar": "إِنَّهَا شَجَرَةٌۭ تَخْرُجُ فِىٓ أَصْلِ ٱلْجَحِيمِ",
    "en": "It is a tree that grows in the nethermost part of Hell.",
    "ur": "وہ ایک درخت ہے جو جہنم کی تہ سے نکلتا ہے"
  },
  {
    "id": 34,
    "reference": "37:65",
    "ar": "طَلْعُهَا كَأَنَّهُۥ رُءُوسُ ٱلشَّيَٰطِينِ",
    "en": "Its spathes are like the heads of satans.",
    "ur": "اُس کے شگوفے ایسے ہیں جیسے شیطانوں کے سر"
  },
  {
    "id": 35,
    "reference": "37:66",
    "ar": "فَإِنَّهُمْ لَءَاكِلُونَ مِنْهَا فَمَالِـُٔونَ مِنْهَا ٱلْبُطُونَ",
    "en": "(The people of Hell) will surely eat of it, filling their bellies with it.",
    "ur": "جہنم کے لوگ اُسے کھائیں گے اور اسی سے پیٹ بھریں گے"
  },
  {
    "id": 36,
    "reference": "37:67",
    "ar": "ثُمَّ إِنَّ لَهُمْ عَلَيْهَا لَشَوْبًۭا مِّنْ حَمِيمٍۢ",
    "en": "Then on top of it they will have a brew of boiling water.",
    "ur": "پھر اس پر پینے کے لیے کھولتا ہوا پانی ملے گا"
  },
  {
    "id": 37,
    "reference": "37:68",
    "ar": "ثُمَّ إِنَّ مَرْجِعَهُمْ لَإِلَى ٱلْجَحِيمِ",
    "en": "Then their return will be to the same blazing Hell.",
    "ur": "اور اس کے بعد ان کی واپسی اُسی آتش دوزخ کی طرف ہو گی"
  },
  {
    "id": 38,
    "reference": "38:56",
    "ar": "جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ ٱلْمِهَادُ",
    "en": "Hell, where they will be roasted. An evil place to dwell!",
    "ur": "جہنم جس میں وہ جھلسے جائیں گے، بہت ہی بری قیام گاہ"
  },
  {
    "id": 39,
    "reference": "38:57",
    "ar": "هَٰذَا فَلْيَذُوقُوهُ حَمِيمٌۭ وَغَسَّاقٌۭ",
    "en": "All this (is for them); so let them taste boiling water and pus,",
    "ur": "یہ ہے اُن کے لیے، پس وہ مزا چکھیں کھولتے ہوئے پانی اور پیپ لہو"
  },
  {
    "id": 40,
    "reference": "38:58",
    "ar": "وَءَاخَرُ مِن شَكْلِهِۦٓ أَزْوَٰجٌ",
    "en": "and other sufferings of the kind.",
    "ur": "اور اسی قسم کی دوسری تلخیوں کا"
  },
  {
    "id": 41,
    "reference": "38:59",
    "ar": "هَٰذَا فَوْجٌۭ مُّقْتَحِمٌۭ مَّعَكُمْ ۖ لَا مَرْحَبًۢا بِهِمْ ۚ إِنَّهُمْ صَالُوا۟ ٱلنَّارِ",
    "en": "(Observing their followers advancing to Hell they will say, among themselves: “This is a troop rushing in to you. There is no welcome for them. They are destined to roast in the Fire.”",
    "ur": "(وہ جہنم کی طرف اپنے پیروؤں کو آتے دیکھ کر آپس میں کہیں گے) \"یہ ایک لشکر تمہارے پاس گھسا چلا آ رہا ہے، کوئی خوش آمدید اِن کے لیے نہیں ہے، یہ آگ میں جھلسنے والے ہیں\""
  },
  {
    "id": 42,
    "reference": "39:72",
    "ar": "قِيلَ ٱدْخُلُوٓا۟ أَبْوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى ٱلْمُتَكَبِّرِينَ",
    "en": "It will be said: “Enter the gates of Hell. Herein shall you abide.” How evil is the abode of the vainglorious!",
    "ur": "کہا جائے گا، داخل ہو جاؤ جہنم کے دروازوں میں، یہاں اب تمہیں ہمیشہ رہنا ہے، بڑا ہی برا ٹھکانا ہے یہ متکبروں کے لیے"
  },
  {
    "id": 43,
    "reference": "40:47",
    "ar": "وَإِذْ يَتَحَآجُّونَ فِى ٱلنَّارِ فَيَقُولُ ٱلضُّعَفَٰٓؤُا۟ لِلَّذِينَ ٱسْتَكْبَرُوٓا۟ إِنَّا كُنَّا لَكُمْ تَبَعًۭا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا نَصِيبًۭا مِّنَ ٱلنَّارِ",
    "en": "Just imagine when they will remonstrate with one another in Hell. The weak ones will say to those who waxed proud: “We were your followers. Will you, then, lighten for us a part of our suffering of the Fire?”",
    "ur": "پھر ذرا خیال کرو اُس وقت کا جب یہ لوگ دوزخ میں ایک دوسرے سے جھگڑ رہے ہوں گے دنیا میں جو لوگ کمزور تھے وہ بڑے بننے والوں سے کہیں گے کہ \"ہم تمہارے تابع تھے، اب کیا یہاں تم نار جہنم کی تکلیف کے کچھ حصے سے ہم کو بچا لو گے؟\""
  },
  {
    "id": 44,
    "reference": "40:49",
    "ar": "وَقَالَ ٱلَّذِينَ فِى ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدْعُوا۟ رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًۭا مِّنَ ٱلْعَذَابِ",
    "en": "Those suffering in the Fire will say to the keepers of Hell: “Call upon your Lord to lighten the chastisement for us just for a day.”",
    "ur": "پھر یہ دوزخ میں پڑے ہوئے لوگ جہنم کے اہل کاروں سے کہیں گے \"اپنے رب سے دعا کرو کہ ہمارے عذاب میں بس ایک دن کی تخفیف کر دے\""
  },
  {
    "id": 45,
    "reference": "40:71",
    "ar": "إِذِ ٱلْأَغْلَٰلُ فِىٓ أَعْنَٰقِهِمْ وَٱلسَّلَٰسِلُ يُسْحَبُونَ",
    "en": "when fetters and chains shall be on their necks, and they shall be dragged into",
    "ur": "جب طوق ان کی گردنوں میں ہوں گے، اور زنجیریں، جن سے پکڑ کر"
  },
  {
    "id": 46,
    "reference": "40:72",
    "ar": "فِى ٱلْحَمِيمِ ثُمَّ فِى ٱلنَّارِ يُسْجَرُونَ",
    "en": "boiling water, and cast into the Fire.",
    "ur": "وہ کھولتے ہوئے پانی کی طرف کھینچے جائیں گے اور پھر دوزخ کی آگ میں جھونک دیے جائیں گے"
  },
  {
    "id": 47,
    "reference": "41:20",
    "ar": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَٰرُهُمْ وَجُلُودُهُم بِمَا كَانُوا۟ يَعْمَلُونَ",
    "en": "and when all have arrived, their ears, their eyes, and their skins shall bear witness against them, stating all that they had done in the life of the world.",
    "ur": "پھر جب سب وہاں پہنچ جائیں گے تو ان کے کان اور ان کی آنکھیں اور ان کے جسم کی کھالیں ان پر گواہی دیں گی کہ وہ دنیا میں کیا کچھ کرتے رہے ہیں"
  },
  {
    "id": 48,
    "reference": "41:24",
    "ar": "فَإِن يَصْبِرُوا۟ فَٱلنَّارُ مَثْوًۭى لَّهُمْ ۖ وَإِن يَسْتَعْتِبُوا۟ فَمَا هُم مِّنَ ٱلْمُعْتَبِينَ",
    "en": "In this state, whether they bear with patience (or not), Fire alone shall be their abode. And if they seek to make amends, they will not be allowed to do so.",
    "ur": "اس حالت میں وہ صبر کریں (یا نہ کریں) آگ ہی ان کا ٹھکانا ہو گی، اور اگر رجوع کا موقع چاہیں گے تو کوئی موقع انہیں نہ دیا جائے گا"
  },
  {
    "id": 49,
    "reference": "43:75",
    "ar": "لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُبْلِسُونَ",
    "en": "Never will their torment be lightened for them. They shall remain in utter despair.",
    "ur": "کبھی اُن کے عذاب میں کمی نہ ہو گی، اور وہ اس میں مایوس پڑے ہوں گے"
  },
  {
    "id": 50,
    "reference": "44:43",
    "ar": "إِنَّ شَجَرَتَ ٱلزَّقُّومِ",
    "en": "The tree of al-Zaqqum",
    "ur": "زقوم کا درخت"
  },
  {
    "id": 51,
    "reference": "44:44",
    "ar": "طَعَامُ ٱلْأَثِيمِ",
    "en": "shall be the food of the sinful.",
    "ur": "گناہ گار کا کھاجا ہوگا"
  },
  {
    "id": 52,
    "reference": "44:45",
    "ar": "كَٱلْمُهْلِ يَغْلِى فِى ٱلْبُطُونِ",
    "en": "Like dregs of oil, it will boil in their bellies",
    "ur": "تیل کی تلچھٹ جیسا، پیٹ میں اِس طرح جوش کھائے گا"
  },
  {
    "id": 53,
    "reference": "44:46",
    "ar": "كَغَلْىِ ٱلْحَمِيمِ",
    "en": "like boiling water.",
    "ur": "جیسے کھولتا ہوا پانی جوش کھاتا ہے"
  },
  {
    "id": 54,
    "reference": "44:47",
    "ar": "خُذُوهُ فَٱعْتِلُوهُ إِلَىٰ سَوَآءِ ٱلْجَحِيمِ",
    "en": "“Seize him and drag him to the middle of the Blazing Fire,",
    "ur": "\" پکڑو اِسے اور رگیدتے ہوئے لے جاؤ اِس کو جہنم کے بیچوں بیچ"
  },
  {
    "id": 55,
    "reference": "44:48",
    "ar": "ثُمَّ صُبُّوا۟ فَوْقَ رَأْسِهِۦ مِنْ عَذَابِ ٱلْحَمِيمِ",
    "en": "then pour boiling water over his head as chastisement.",
    "ur": "اور انڈیل دو اِس کے سر پر کھولتے پانی کا عذاب"
  },
  {
    "id": 56,
    "reference": "47:15",
    "ar": "مَّثَلُ ٱلْجَنَّةِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ ۖ فِيهَآ أَنْهَٰرٌۭ مِّن مَّآءٍ غَيْرِ ءَاسِنٍۢ وَأَنْهَٰرٌۭ مِّن لَّبَنٍۢ لَّمْ يَتَغَيَّرْ طَعْمُهُۥ وَأَنْهَٰرٌۭ مِّنْ خَمْرٍۢ لَّذَّةٍۢ لِّلشَّٰرِبِينَ وَأَنْهَٰرٌۭ مِّنْ عَسَلٍۢ مُّصَفًّۭى ۖ وَلَهُمْ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَمَغْفِرَةٌۭ مِّن رَّبِّهِمْ ۖ كَمَنْ هُوَ خَٰلِدٌۭ فِى ٱلنَّارِ وَسُقُوا۟ مَآءً حَمِيمًۭا فَقَطَّعَ أَمْعَآءَهُمْ",
    "en": "Here is the parable of Paradise which the God-fearing have been promised: in it shall be rivers of incorruptible water, rivers of milk unchanging in taste, and rivers of wine, a delight to those that drink; and rivers of pure honey. In it they will have every kind of fruit as well as forgiveness from their Lord. Can such be like those who will abide in the Fire and will be given a boiling water to drink that will tear their bowels apart?",
    "ur": "پرہیز گاروں کے لیے جس جنت کا وعدہ کیا گیا ہے اس کی شان تو یہ ہے کہ اس میں نہریں بہہ رہی ہوں گی نتھرے ہوئے پانی کی، نہریں بہہ رہی ہوں گی ایسے دودھ کی جس کے مزے میں ذرا فرق نہ آیا ہو گا، نہریں بہہ رہی ہوں گی ایسی شراب کی جو پینے والوں کے لیے لذیذ ہوگی، نہریں بہہ رہی ہوں گی صاف شفاف شہد کی اُس میں اُن کے لیے ہر طرح کے پھل ہوں گے اور اُن کے رب کی طرف سے بخشش (کیا وہ شخص جس کے حصہ میں یہ جنت آنے والی ہے) اُن لوگوں کی طرح ہو سکتا ہے جو جہنم میں ہمیشہ رہیں گے اور جنہیں ایسا گرم پانی پلایا جائے گا جو ان کی آنتیں تک کاٹ دے گا؟"
  },
  {
    "id": 57,
    "reference": "54:48",
    "ar": "يَوْمَ يُسْحَبُونَ فِى ٱلنَّارِ عَلَىٰ وُجُوهِهِمْ ذُوقُوا۟ مَسَّ سَقَرَ",
    "en": "There shall come a Day when they will be dragged on their faces into the Fire and will be told: “Now taste the flame of Hell.”",
    "ur": "جس روز یہ منہ کے بل آگ میں گھسیٹے جائیں گے اُس روز اِن سے کہا جائے گا کہ اب چکھو جہنم کی لپٹ کا مزا"
  },
  {
    "id": 58,
    "reference": "55:44",
    "ar": "يَطُوفُونَ بَيْنَهَا وَبَيْنَ حَمِيمٍ ءَانٍۢ",
    "en": "They will keep circling around between Hell and boiling water.",
    "ur": "اُسی جہنم اور کھولتے ہوئے پانی کے درمیان وہ گردش کرتے رہیں گے"
  },
  {
    "id": 59,
    "reference": "56:93",
    "ar": "فَنُزُلٌۭ مِّنْ حَمِيمٍۢ",
    "en": "then he will be served boiling water,",
    "ur": "تو اس کی تواضع کے لیے کھولتا ہوا پانی ہے"
  },
  {
    "id": 60,
    "reference": "56:94",
    "ar": "وَتَصْلِيَةُ جَحِيمٍ",
    "en": "and will be scorched by the Fire.",
    "ur": "اور جہنم میں جھونکا جانا"
  },
  {
    "id": 61,
    "reference": "69:30",
    "ar": "خُذُوهُ فَغُلُّوهُ",
    "en": "(A command will be issued): “Seize him and shackle him,",
    "ur": "(حکم ہو گا) پکڑو اِسے اور اِس کی گردن میں طوق ڈال دو"
  },
  {
    "id": 62,
    "reference": "69:31",
    "ar": "ثُمَّ ٱلْجَحِيمَ صَلُّوهُ",
    "en": "then cast him in the Fire,",
    "ur": "پھر اِسے جہنم میں جھونک دو"
  },
  {
    "id": 63,
    "reference": "69:32",
    "ar": "ثُمَّ فِى سِلْسِلَةٍۢ ذَرْعُهَا سَبْعُونَ ذِرَاعًۭا فَٱسْلُكُوهُ",
    "en": "then fasten him with a chain, seventy cubits long.",
    "ur": "پھر اِس کو ستر ہاتھ لمبی زنجیر میں جکڑ دو"
  },
  {
    "id": 64,
    "reference": "69:36",
    "ar": "وَلَا طَعَامٌ إِلَّا مِنْ غِسْلِينٍۢ",
    "en": "and has no food except the filth from the washing of wounds,",
    "ur": "اور نہ زخموں کے دھوون کے سوا اِس کے لیے کوئی کھانا"
  },
  {
    "id": 65,
    "reference": "70:16",
    "ar": "نَزَّاعَةًۭ لِّلشَّوَىٰ",
    "en": "that will strip off the scalp.",
    "ur": "جو گوشت پوست کو چاٹ جائے گی"
  },
  {
    "id": 66,
    "reference": "77:30",
    "ar": "ٱنطَلِقُوٓا۟ إِلَىٰ ظِلٍّۢ ذِى ثَلَٰثِ شُعَبٍۢ",
    "en": "proceed towards the three-pronged shadow,",
    "ur": "چلو اُس سائے کی طرف جو تین شاخوں والا ہے"
  },
  {
    "id": 67,
    "reference": "77:31",
    "ar": "لَّا ظَلِيلٍۢ وَلَا يُغْنِى مِنَ ٱللَّهَبِ",
    "en": "which neither provides (cooling) shade nor protection against the flames;",
    "ur": "نہ ٹھنڈک پہنچانے والا اور نہ آگ کی لپٹ سے بچانے والا"
  },
  {
    "id": 68,
    "reference": "77:32",
    "ar": "إِنَّهَا تَرْمِى بِشَرَرٍۢ كَٱلْقَصْرِ",
    "en": "it indeed throws up sparks like castles,",
    "ur": "وہ آگ محل جیسی بڑی بڑی چنگاریاں پھینکے گی"
  },
  {
    "id": 69,
    "reference": "78:21",
    "ar": "إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًۭا",
    "en": "Surely the Hell is an ambush,",
    "ur": "درحقیقت جہنم ایک گھات ہے"
  },
  {
    "id": 70,
    "reference": "78:22",
    "ar": "لِّلطَّٰغِينَ مَـَٔابًۭا",
    "en": "a resort for the rebellious;",
    "ur": "سرکشوں کا ٹھکانا"
  },
  {
    "id": 71,
    "reference": "78:23",
    "ar": "لَّٰبِثِينَ فِيهَآ أَحْقَابًۭا",
    "en": "therein they shall abide for ages,",
    "ur": "جس میں وہ مدتوں پڑے رہیں گے"
  },
  {
    "id": 72,
    "reference": "78:24",
    "ar": "لَّا يَذُوقُونَ فِيهَا بَرْدًۭا وَلَا شَرَابًا",
    "en": "they shall taste in it no coolness, nor any pleasant drink",
    "ur": "اُس کے اندر کسی ٹھنڈک اور پینے کے قابل کسی چیز کا مزہ وہ نہ چکھیں گے"
  },
  {
    "id": 73,
    "reference": "78:25",
    "ar": "إِلَّا حَمِيمًۭا وَغَسَّاقًۭا",
    "en": "save boiling water and wash of the wounds;",
    "ur": "کچھ ملے گا تو بس گرم پانی اور زخموں کا دھوون"
  },
  {
    "id": 74,
    "reference": "84:12",
    "ar": "وَيَصْلَىٰ سَعِيرًا",
    "en": "and will enter the Blazing Fire.",
    "ur": "اور بھڑکتی ہوئی آگ میں جا پڑے گا"
  },
  {
    "id": 75,
    "reference": "87:12",
    "ar": "ٱلَّذِى يَصْلَى ٱلنَّارَ ٱلْكُبْرَىٰ",
    "en": "He will be cast into the Great Fire.",
    "ur": "جو بڑی آگ میں جائے گا"
  },
  {
    "id": 76,
    "reference": "87:13",
    "ar": "ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ",
    "en": "Then he will neither die in it, nor live.",
    "ur": "پھر نہ اس میں مرے گا نہ جیے گا"
  },
  {
    "id": 77,
    "reference": "88:4",
    "ar": "تَصْلَىٰ نَارًا حَامِيَةًۭ",
    "en": "they shall burn in a Scorching Fire;",
    "ur": "تھکے جاتے ہونگے، شدید آگ میں جھلس رہے ہونگے"
  },
  {
    "id": 78,
    "reference": "88:5",
    "ar": "تُسْقَىٰ مِنْ عَيْنٍ ءَانِيَةٍۢ",
    "en": "their drink shall be from a boiling spring.",
    "ur": "کھولتے ہوئے چشمے کا پانی انہیں پینے کو دیا جائے گا"
  },
  {
    "id": 79,
    "reference": "88:6",
    "ar": "لَّيْسَ لَهُمْ طَعَامٌ إِلَّا مِن ضَرِيعٍۢ",
    "en": "They shall have no food except bitter dry thorns",
    "ur": "خار دار سوکھی گھاس کے سوا کوئی کھانا اُن کے لیے نہ ہوگا"
  },
  {
    "id": 80,
    "reference": "88:7",
    "ar": "لَّا يُسْمِنُ وَلَا يُغْنِى مِن جُوعٍۢ",
    "en": "that will neither nourish nor satisfy their hunger.",
    "ur": "جو نہ موٹا کرے نہ بھوک مٹائے"
  },
  {
    "id": 81,
    "reference": "92:14",
    "ar": "فَأَنذَرْتُكُمْ نَارًۭا تَلَظَّىٰ",
    "en": "I have now warned you of a Blazing Fire,",
    "ur": "پس میں نے تم کو خبردار کر دیا ہے بھڑکتی ہوئی آگ سے"
  }
]