[
  {
    "id": 1,
    "reference": "2:25",
    "ar": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍۢ رِّزْقًۭا ۙ قَالُوا۟ هَٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَٰبِهًۭا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌۭ مُّطَهَّرَةٌۭ ۖ وَهُمْ فِيهَا خَٰلِدُونَ",
    "en": "And give good news (O Muhammad), to those who believe in this Book and do good deeds (in accordance with its teachings). For them there will be gardens underneath which canals flow. Their fruits will so resemble the fruits on the Earth that every time they will be provided with fruits, they will say, \"Such fruits were provided to us before on the Earth. \" And there will be pure spouses for them and therein they will live for ever.",
    "ur": "اور اے پیغمبرؐ، جو لوگ اس کتاب پر ایمان لے آئیں اور (اس کے مطابق) اپنے عمل درست کر لیں، انہیں خوش خبری دے دو کہ اُن کے لیے ایسے باغ ہیں، جن کے نیچے نہریں بہتی ہوں گی ان باغوں کے پھل صورت میں دنیا کے پھلوں سے ملتے جلتے ہونگے جب کوئی پھل انہیں کھانے کو دیا جائے گا، تو وہ کہیں گے کہ ایسے ہی پھل اس سے پہلے دنیا میں ہم کو دیے جاتے تھے ان کے لیے وہاں پاکیزہ بیویاں ہونگی، اور وہ وہاں ہمیشہ رہیں گے"
  },
  {
    "id": 2,
    "reference": "3:15",
    "ar": "۞ قُلْ أَؤُنَبِّئُكُم بِخَيْرٍۢ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ ٱتَّقَوْا۟ عِندَ رَبِّهِمْ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا وَأَزْوَٰجٌۭ مُّطَهَّرَةٌۭ وَرِضْوَٰنٌۭ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
    "en": "Say: 'Shall I tell you of things better than these? For the God-fearing there are, with their Lord, gardens beneath which rivers flow; there they will abide for ever, will have spouses of stainless purity as companions, and will enjoy the good pleasure of Allah.' Allah thoroughly observes His servants.",
    "ur": "کہو: میں تمہیں بتاؤں کہ ان سے زیادہ اچھی چیز کیا ہے؟ جو لوگ تقویٰ کی روش اختیار کریں، اُن کے لیے ان کے رب کے پا س باغ ہیں، جن کے نیچے نہریں بہتی ہوں گی، وہاں انہیں ہمیشگی کی زندگی حاصل ہوگی، پاکیزہ بیویاں ان کی رفیق ہوں گی اور اللہ کی رضا سے وہ سرفراز ہوں گے اللہ اپنے بندوں کے رویے پر گہری نظر رکھتا ہے"
  },
  {
    "id": 3,
    "reference": "3:133",
    "ar": "۞ وَسَارِعُوٓا۟ إِلَىٰ مَغْفِرَةٍۢ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا ٱلسَّمَٰوَٰتُ وَٱلْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ",
    "en": "And hasten to the for-giveness of your Lord and to a Paradise as vast as the heavens and the earth, prepared for the God-fearing.",
    "ur": "دوڑ کر چلو اُ س راہ پر جو تمہارے رب کی بخشش اور اُس جنت کی طرف جاتی ہے جس کی وسعت زمین اور آسمانوں جیسی ہے، اور وہ اُن خدا ترس لوگوں کے لیے مہیا کی گئی"
  },
  {
    "id": 4,
    "reference": "3:136",
    "ar": "أُو۟لَٰٓئِكَ جَزَآؤُهُم مَّغْفِرَةٌۭ مِّن رَّبِّهِمْ وَجَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا ۚ وَنِعْمَ أَجْرُ ٱلْعَٰمِلِينَ",
    "en": "They shall be recompensed by forgiveness from their Lord and by gardens beneath which rivers flow; there they shall abide. How good is the reward of those who labour!",
    "ur": "ایسے لوگوں کی جزا ان کے رب کے پاس یہ ہے کہ وہ ان کو معاف کر دے گا اور ایسے باغوں میں انہیں داخل کرے گا جن کے نیچے نہریں بہتی ہونگی اور وہاں وہ ہمیشہ رہیں گے کیسا اچھا بدلہ ہے نیک عمل کرنے والوں کے لیے"
  },
  {
    "id": 5,
    "reference": "3:195",
    "ar": "فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّى لَآ أُضِيعُ عَمَلَ عَٰمِلٍۢ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّنۢ بَعْضٍۢ ۖ فَٱلَّذِينَ هَاجَرُوا۟ وَأُخْرِجُوا۟ مِن دِيَٰرِهِمْ وَأُوذُوا۟ فِى سَبِيلِى وَقَٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ثَوَابًۭا مِّنْ عِندِ ٱللَّهِ ۗ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلثَّوَابِ",
    "en": "Their Lord answered the Prayer thus: \"I will not suffer the work of any of you, whether male or female, to go to waste; each of you is from the other. Those who emigrated and were driven out from their homesteads and were persecuted in My cause, and who fought and were slain, indeed I shall wipe out their evil deeds from them and shall certainly admit them to the gardens beneath which rivers flow.\" This is their reward with their Lord; and with Allah lies the best reward.",
    "ur": "جواب میں ان کے رب نے فرمایا، \"میں تم میں سے کسی کا عمل ضائع کرنے والا نہیں ہوں خواہ مرد ہو یا عورت، تم سب ایک دوسرے کے ہم جنس ہو لہٰذا جن لوگوں نے میری خاطر اپنے وطن چھوڑے اور جو میر ی راہ میں اپنے گھروں سے نکالے گئے اور ستائے گئے اور میرے لیے لڑے اور مارے گئے اُن کے سب قصور میں معاف کر دوں گا اور انہیں ایسے باغوں میں داخل کروں گا جن کے نیچے نہریں بہتی ہوں گی یہ اُن کی جزا ہے اللہ کے ہاں اور بہترین جزا اللہ ہی کے پاس ہے\""
  },
  {
    "id": 6,
    "reference": "3:198",
    "ar": "لَٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا نُزُلًۭا مِّنْ عِندِ ٱللَّهِ ۗ وَمَا عِندَ ٱللَّهِ خَيْرٌۭ لِّلْأَبْرَارِ",
    "en": "But those who fear their Lord: theirs shall be the gardens beneath which rivers flow and in which they will live forever: a hospitality from Allah Himself, And Allah's reward is best for the truly pious.",
    "ur": "برعکس اس کے جو لوگ اپنے رب سے ڈرتے ہوئے زندگی بسر کرتے ہیں ان کے لیے ایسے باغ ہیں جن کے نیچے نہریں بہتی ہیں، ان باغوں میں وہ ہمیشہ رہیں گے، اللہ کی طرف سے یہ سامان ضیافت ہے ان کے لیے، اور جو کچھ اللہ کے پاس ہے نیک لوگوں کے لیے وہی سب سے بہتر ہے"
  },
  {
    "id": 7,
    "reference": "4:57",
    "ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ سَنُدْخِلُهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًۭا ۖ لَّهُمْ فِيهَآ أَزْوَٰجٌۭ مُّطَهَّرَةٌۭ ۖ وَنُدْخِلُهُمْ ظِلًّۭا ظَلِيلًا",
    "en": "And those who believe and do good deeds, We shall cause them to enter the Gardens beneath which rivers flow. There they shall abide for ever. There they shall have spouses purified and there We shall cause them to enter a shelter with plenteous shade.",
    "ur": "اور جن لوگوں نے ہماری آیات کو مان لیا اور نیک عمل کیے اُن کو ہم ایسے باغوں میں داخل کریں گے جن کے نیچے نہریں بہتی ہوں گی، جہاں وہ ہمیشہ ہمیشہ رہیں گے اور اُن کو پاکیزہ بیویاں ملیں گی اور انہیں ہم گھنی چھاؤں میں رکھیں گے"
  },
  {
    "id": 8,
    "reference": "4:122",
    "ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ سَنُدْخِلُهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًۭا ۖ وَعْدَ ٱللَّهِ حَقًّۭا ۚ وَمَنْ أَصْدَقُ مِنَ ٱللَّهِ قِيلًۭا",
    "en": "But those who believe and do good, We shall cause them to enter the Gardens beneath which rivers flow. Here they will abide for ever. This is Allah's promise in truth and whose word is truer than Allah's?",
    "ur": "رہے وہ لوگ جو ایمان لے آئیں اور نیک عمل کریں، توا نہیں ہم ایسے باغوں میں داخل کریں گے جن کے نیچے نہریں بہتی ہوں گی اور وہ وہاں ہمیشہ ہمیشہ رہیں گے یہ اللہ کا سچا وعدہ ہے اور اللہ سے بڑھ کر کون اپنی بات میں سچا ہوگا"
  },
  {
    "id": 9,
    "reference": "4:124",
    "ar": "وَمَن يَعْمَلْ مِنَ ٱلصَّٰلِحَٰتِ مِن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌۭ فَأُو۟لَٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ وَلَا يُظْلَمُونَ نَقِيرًۭا",
    "en": "Whoever does good and believes -whether he is male or female - such shall enter the Garden, and they shall not be wronged in the slightest.",
    "ur": "اور جو نیک عمل کرے گا، خواہ مرد ہو یا عورت، بشر طیکہ ہو وہ مومن، تو ایسے ہی لوگ جنت میں داخل ہوں گے اور اُن کی ذرہ برابر حق تلفی نہ ہونے پائے گی"
  },
  {
    "id": 10,
    "reference": "5:119",
    "ar": "قَالَ ٱللَّهُ هَٰذَا يَوْمُ يَنفَعُ ٱلصَّٰدِقِينَ صِدْقُهُمْ ۚ لَهُمْ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًۭا ۚ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "Thereupon Allah will say: 'This day truthfulness shall profit the truthful. For them are Gardens beneath which rivers flow. There they will abide for ever. Allah is well- pleased with them, and they well-pleased with Allah. That indeed is the mighty triumph.'",
    "ur": "تب اللہ فرمائے گا \"یہ وہ دن ہے جس میں سچوں کو اُن کی سچائی نفع دیتی ہے، ان کے لیے ایسے باغ ہیں جن کے نیچے نہریں بہہ رہی ہیں، یہاں وہ ہمیشہ رہیں گے، اللہ ان سے راضی ہوا اور وہ اللہ سے، یہی بڑی کامیابی ہے\""
  },
  {
    "id": 11,
    "reference": "6:127",
    "ar": "۞ لَهُمْ دَارُ ٱلسَّلَٰمِ عِندَ رَبِّهِمْ ۖ وَهُوَ وَلِيُّهُم بِمَا كَانُوا۟ يَعْمَلُونَ",
    "en": "Theirs shall be an abode of peace with their Lord - their Protector - in recompense for all they have done.",
    "ur": "اُن کیلیے اُن کے رب کے پاس سلامتی کا گھر ہے اور وہ ان کا سر پرست ہے اُس صحیح طرز عمل کی وجہ سے جو انہوں نے اختیار کیا"
  },
  {
    "id": 12,
    "reference": "7:43",
    "ar": "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّۢ تَجْرِى مِن تَحْتِهِمُ ٱلْأَنْهَٰرُ ۖ وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى هَدَىٰنَا لِهَٰذَا وَمَا كُنَّا لِنَهْتَدِىَ لَوْلَآ أَنْ هَدَىٰنَا ٱللَّهُ ۖ لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا بِٱلْحَقِّ ۖ وَنُودُوٓا۟ أَن تِلْكُمُ ٱلْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
    "en": "We shall strip away all rancour from their hearts, and rivers shall flow beneath them, and they shall say: 'All praise be to Allah Who has guided us on to this. Had it not been for Allah Who granted us guidance, we would not be on the Right Path. Surely the Messengers of our Lord did indeed come down with truth.' Then a voice will cry out to them: 'This is the Paradise which you are made to inherit as a reward for your deeds.'",
    "ur": "ان کے دلوں میں ایک دوسرے کے خلاف جو کچھ کدورت ہوگی اسے ہم نکال دیں گے اُن کے نیچے نہریں بہتی ہونگی، اور وہ کہیں گے کہ \"تعریف خدا ہی کے لیے ہے جس نے ہمیں یہ راستہ دکھایا، ہم خود راہ نہ پا سکتے تھے اگر خدا ہماری رہنمائی نہ کرتا، ہمارے رب کے بھیجے ہوئے رسول واقعی حق ہی لے کر آئے تھے\" اُس وقت ندا آئے گی کہ \"یہ جنت جس کے تم وارث بنائے گئے ہو تمہیں اُن اعمال کے بدلے میں ملی ہے جو تم کرتے رہے تھے\""
  },
  {
    "id": 13,
    "reference": "7:44",
    "ar": "وَنَادَىٰٓ أَصْحَٰبُ ٱلْجَنَّةِ أَصْحَٰبَ ٱلنَّارِ أَن قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّۭا فَهَلْ وَجَدتُّم مَّا وَعَدَ رَبُّكُمْ حَقًّۭا ۖ قَالُوا۟ نَعَمْ ۚ فَأَذَّنَ مُؤَذِّنٌۢ بَيْنَهُمْ أَن لَّعْنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ",
    "en": "And the people of Paradise shall cry to the people of Hell: 'Surely we have found our Lord's promise to us to be true. have you also found true what your Lord has promised you?' 'Yes', they shall answer; and a herald shall cry out among them: 'Allah's curse be upon the wrong-doers';",
    "ur": "پھر یہ جنت کے لوگ دوزخ والوں سے پکار کر کہیں گے، \"ہم نے اُن سارے وعدوں کو ٹھیک پا لیا جو ہمارے رب نے ہم سے کیے تھے، کیا تم نے بھی ان وعدوں کو ٹھیک پایا جو تمہارے رب نے کیے تھے؟\" وہ جواب دیں گے \"ہاں\" تب ایک پکارنے والا ان کے درمیان پکارے گا کہ \"خدا کی لعنت اُن ظالموں پر"
  },
  {
    "id": 14,
    "reference": "7:46",
    "ar": "وَبَيْنَهُمَا حِجَابٌۭ ۚ وَعَلَى ٱلْأَعْرَافِ رِجَالٌۭ يَعْرِفُونَ كُلًّۢا بِسِيمَىٰهُمْ ۚ وَنَادَوْا۟ أَصْحَٰبَ ٱلْجَنَّةِ أَن سَلَٰمٌ عَلَيْكُمْ ۚ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ",
    "en": "And between the two there will be a barrier, and on the Heights will be men who will recognize each person by his mark and will cry, out to the people of Paradise: 'Peace be to you.'These will be the ones who had not yet joined them in Paradise, though they long to do so.",
    "ur": "ان دونوں گروہوں کے درمیان ایک اوٹ حائل ہوگی جس کی بلندیوں (اعراف) پر کچھ اور لوگ ہوں گے یہ ہر ایک کو اس کے قیافہ سے پہچانیں گے اور جنت والوں سے پکار کر کہیں گے کہ \"سلامتی ہو تم پر\" یہ لوگ جنت میں داخل تو نہیں ہوئے مگر اس کے امیدوار ہونگے"
  },
  {
    "id": 15,
    "reference": "7:49",
    "ar": "أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقْسَمْتُمْ لَا يَنَالُهُمُ ٱللَّهُ بِرَحْمَةٍ ۚ ٱدْخُلُوا۟ ٱلْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَآ أَنتُمْ تَحْزَنُونَ",
    "en": "Are these not the ones of whom you swore that Allah shall grant them nothing of His mercy?' To such it will be said: 'Enter Paradise. You have no cause to fear, nor shall you grieve.'",
    "ur": "اور کیا یہ اہل جنت وہی لوگ نہیں ہیں جن کے متعلق تم قسمیں کھا کھا کر کہتے تھے کہ اِن کو تو خدا پنی رحمت میں سے کچھ بھی نہ دے گا؟ آج انہی سے کہا گیا کہ داخل ہو جاؤ جنت میں، تمہارے لیے نہ خوف ہے نہ رنج\""
  },
  {
    "id": 16,
    "reference": "9:72",
    "ar": "وَعَدَ ٱللَّهُ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا وَمَسَٰكِنَ طَيِّبَةًۭ فِى جَنَّٰتِ عَدْنٍۢ ۚ وَرِضْوَٰنٌۭ مِّنَ ٱللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "Allah has promised the believing men and believing women Gardens beneath which rivers flow. They shall abide in it. There are delightful dwelling places for them in the Gardens of Eternity. They shall, above all, enjoy the good pleasure of Allah. That is the great achievement.",
    "ur": "ان مومن مردوں اور عورتوں سے اللہ کا وعدہ ہے کہ انہیں ایسے باغ دے گا جن کے نیچے نہریں بہتی ہوں گی اور وہ ان میں ہمیشہ رہیں گے ان سدا بہار باغوں میں ان کے لیے پاکیزہ قیام گاہیں ہوں گی، اور سب سے بڑھ کر یہ کہ اللہ کی خوشنودی انہیں حاصل ہوگی یہی بڑی کامیابی ہے"
  },
  {
    "id": 17,
    "reference": "9:89",
    "ar": "أَعَدَّ ٱللَّهُ لَهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "Allah has prepared for them Gardens beneath which rivers flow. There shall they abide. That is the supreme triumph.",
    "ur": "اللہ نے ان کے لیے ایسے باغ تیار رکھے ہیں جن کے نیچے نہریں بہ رہی ہیں، ان میں وہ ہمیشہ رہیں گے یہ ہے عظیم الشان کامیابی"
  },
  {
    "id": 18,
    "reference": "9:100",
    "ar": "وَٱلسَّٰبِقُونَ ٱلْأَوَّلُونَ مِنَ ٱلْمُهَٰجِرِينَ وَٱلْأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحْسَٰنٍۢ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ وَأَعَدَّ لَهُمْ جَنَّٰتٍۢ تَجْرِى تَحْتَهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًۭا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "And of those who led the way - the first of the Emigrants (Muhajirun) and the Helpers (Ansar), and those who followed them in the best possible manner - Allah is well-pleased with them and they are well-pleased with Allah. He has prepared for them Gardens beneath which rivers flow; therein they will abide forever. That is the supreme triumph.",
    "ur": "وہ مہاجر و انصار جنہوں نے سب سے پہلے دعوت ایمان پر لبیک کہنے میں سبقت کی، نیز وہ جو بعد میں راستبازی کے ساتھ پیچھے آئے، اللہ ان سے راضی ہوا اور وہ اللہ سے راضی ہوئے، اللہ نے ان کے لیے ایسے باغ مہیا کر رکھے ہیں جن کے نیچے نہریں بہتی ہوں گی اور وہ ان میں ہمیشہ رہیں گے، یہی عظیم الشان کامیابی ہے"
  },
  {
    "id": 19,
    "reference": "9:111",
    "ar": "۞ إِنَّ ٱللَّهَ ٱشْتَرَىٰ مِنَ ٱلْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوَٰلَهُم بِأَنَّ لَهُمُ ٱلْجَنَّةَ ۚ يُقَٰتِلُونَ فِى سَبِيلِ ٱللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّۭا فِى ٱلتَّوْرَىٰةِ وَٱلْإِنجِيلِ وَٱلْقُرْءَانِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِۦ مِنَ ٱللَّهِ ۚ فَٱسْتَبْشِرُوا۟ بِبَيْعِكُمُ ٱلَّذِى بَايَعْتُم بِهِۦ ۚ وَذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "Surely Allah has purchased of the believers their lives and their belongings and in return has promised that they shall have Paradise. They fight in the Way of Allah, and slay and are slain. Such is the promise He has made incumbent upon Himself in the Torah, and the Gospel, and the Qur'an. Who is more faithful to his promise than Allah? Rejoice, then, in the bargain you have made with Him. That indeed is the mighty triumph.",
    "ur": "حقیقت یہ ہے کہ اللہ نے مومنوں سے ان کے نفس اور ان کے مال جنت کے بدلے خرید لیے ہیں وہ اللہ کی راہ میں لڑتے اور مارتے اور مرتے ہیں ان سے (جنت کا وعدہ) اللہ کے ذمے ایک پختہ وعدہ ہے توراۃ اور انجیل اور قرآن میں اور کون ہے جو اللہ سے بڑھ کر اپنے عہد کا پورا کرنے والا ہو؟ پس خوشیاں مناؤ اپنے اس سودے پر جو تم نے خدا سے چکا لیا ہے، یہی سب سے بڑی کامیابی ہے"
  },
  {
    "id": 20,
    "reference": "10:9",
    "ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ يَهْدِيهِمْ رَبُّهُم بِإِيمَٰنِهِمْ ۖ تَجْرِى مِن تَحْتِهِمُ ٱلْأَنْهَٰرُ فِى جَنَّٰتِ ٱلنَّعِيمِ",
    "en": "Surely those who believe (in the truths revealed in the Book) and do righteous deeds their Lord will guide them aright because of their faith. Rivers shall flow beneath them in the Gardens of Bliss.",
    "ur": "اور یہ بھی حقیقت ہے کہ جو لوگ ایمان لائے (یعنی جنہوں نے اُن صداقتوں کو قبول کر لیا جو اس کتاب میں پیش کی گئی ہیں) اور نیک اعمال کرتے رہے انہیں اُن کا رب اُن کے ایمان کی وجہ سے سیدھی راہ چلائے گا، نعمت بھری جنتوں میں ان کے نیچے نہریں بہیں گی"
  },
  {
    "id": 21,
    "reference": "10:10",
    "ar": "دَعْوَىٰهُمْ فِيهَا سُبْحَٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلَٰمٌۭ ۚ وَءَاخِرُ دَعْوَىٰهُمْ أَنِ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "en": "Their cry in it will be: 'Glory be to You, Our Lord!', and their greeting: 'Peace!'; and their cry will always end with: 'All praise be to Allah, the Lord of the universe.",
    "ur": "وہاں ان کی صدا یہ ہوگی کہ “پاک ہے تو اے خدا، \" اُن کی دعا یہ ہوگی کہ “سلامتی ہو \" اور ان کی ہر بات کا خاتمہ اس پر ہوگا کہ “ساری تعریف اللہ رب العالمین ہی کے لیے ہے \""
  },
  {
    "id": 22,
    "reference": "11:108",
    "ar": "۞ وَأَمَّا ٱلَّذِينَ سُعِدُوا۟ فَفِى ٱلْجَنَّةِ خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلْأَرْضُ إِلَّا مَا شَآءَ رَبُّكَ ۖ عَطَآءً غَيْرَ مَجْذُوذٍۢ",
    "en": "And as for those who are blessed, they shall abide in the Garden as long as the heavens and the earth endure, unless your Lord may will otherwise. They shall enjoy an unceasing gift.",
    "ur": "رہے وہ لوگ جو نیک بخت نکلیں گے، تو وہ جنت میں جائیں گے اور وہاں ہمیشہ رہیں گے جب تک زمین و آسمان قائم ہیں، الا یہ کہ تیرا رب کچھ اور چاہے ایسی بخشش ان کو ملے گی جس کا سلسلہ کبھی منقطع نہ ہوگا"
  },
  {
    "id": 23,
    "reference": "13:23",
    "ar": "جَنَّٰتُ عَدْنٍۢ يَدْخُلُونَهَا وَمَن صَلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّٰتِهِمْ ۖ وَٱلْمَلَٰٓئِكَةُ يَدْخُلُونَ عَلَيْهِم مِّن كُلِّ بَابٍۢ",
    "en": "- the Ever-lasting Gardens which they shall enter and so shall the righteous from among their fathers, and their spouses, and their offspring. And angels shall enter unto them from every gate, and say:",
    "ur": "یعنی ایسے باغ جو اُن کی ابدی قیام گاہ ہوں گے وہ خود بھی ان میں داخل ہوں گے اور ان کے آباؤ اجداد اور اُن کی بیویوں اور اُن کی اولاد میں سے جو جو صالح ہیں وہ بھی اُن کے ساتھ وہاں جائیں گے ملائکہ ہر طرف سے اُن کے استقبال کے لیے آئیں گے"
  },
  {
    "id": 24,
    "reference": "13:24",
    "ar": "سَلَٰمٌ عَلَيْكُم بِمَا صَبَرْتُمْ ۚ فَنِعْمَ عُقْبَى ٱلدَّارِ",
    "en": "\"Peace be upon you. You merit this reward for your steadfastness.\" How excellent is the ultimate abode!",
    "ur": "اور اُن سے کہیں گے کہ \"تم پر سلامتی ہے، تم نے دنیا میں جس طرح صبر سے کام لیا اُس کی بدولت آج تم اِس کے مستحق ہوئے ہو\" پس کیا ہی خوب ہے یہ آخرت کا گھر!"
  },
  {
    "id": 25,
    "reference": "13:35",
    "ar": "۞ مَّثَلُ ٱلْجَنَّةِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ ۖ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ أُكُلُهَا دَآئِمٌۭ وَظِلُّهَا ۚ تِلْكَ عُقْبَى ٱلَّذِينَ ٱتَّقَوا۟ ۖ وَّعُقْبَى ٱلْكَٰفِرِينَ ٱلنَّارُ",
    "en": "And such will be the Paradise promised to the God-fearing: rivers will flow beneath it, its fruits will be eternal, and so will be its blissful shade. That is the ultimate destiny of the God-fearing while Fire is the destiny of the unbelievers.",
    "ur": "خدا ترس انسانوں کے لیے جس جنت کا وعدہ کیا گیا ہے اس کی شان یہ ہے کہ اس کے نیچے نہریں بہہ رہی ہیں، اس کے پھل دائمی ہیں اور اس کا سایہ لازوال یہ انجام ہے متقی لوگوں کا اور منکرین حق کا انجام یہ ہے کہ ان کے لیے دوزخ کی آگ ہے"
  },
  {
    "id": 26,
    "reference": "14:23",
    "ar": "وَأُدْخِلَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَٰمٌ",
    "en": "As for those who had believed and did good in the world, they shall be admitted to the Gardens beneath which rivers flow. There, with the leave of Allah, they shall abide forever, and will be greeted with: \"Peace\".",
    "ur": "بخلاف اس کے جو لوگ دنیا میں ایمان لائے ہیں اور جنہوں نے نیک عمل کیے ہیں وہ ایسے باغوں میں داخل کیے جائیں گے جن کے نیچے نہریں بہتی ہوں گی وہاں وہ اپنے رب کے اذن سے ہمیشہ رہیں گے، اور وہاں ان کا استقبال سلامتی کی مبارک باد سے ہوگا"
  },
  {
    "id": 27,
    "reference": "15:45",
    "ar": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍۢ وَعُيُونٍ",
    "en": "As for the God-fearing, they shall be amid gardens and springs.",
    "ur": "بخلاف اِس کے متقی لوگ باغوں اور چشموں میں ہوں گے"
  },
  {
    "id": 28,
    "reference": "15:46",
    "ar": "ٱدْخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ",
    "en": "They will be told: \"Enter it in peace and security.\"",
    "ur": "اور اُن سے کہا جائے گا کہ داخل ہو جاؤ ان میں سلامتی کے ساتھ بے خوف و خطر"
  },
  {
    "id": 29,
    "reference": "15:47",
    "ar": "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ إِخْوَٰنًا عَلَىٰ سُرُرٍۢ مُّتَقَٰبِلِينَ",
    "en": "And We shall purge their breasts of all traces of rancour; and they shall be seated on couches facing one another as brothers.",
    "ur": "اُن کے دلوں میں جو تھوڑی بہت کھوٹ کپٹ ہوگی اسے ہم نکال دیں گے، وہ آپس میں بھائی بھائی بن کر آمنے سامنے تختوں پر بیٹھیں گے"
  },
  {
    "id": 30,
    "reference": "15:48",
    "ar": "لَا يَمَسُّهُمْ فِيهَا نَصَبٌۭ وَمَا هُم مِّنْهَا بِمُخْرَجِينَ",
    "en": "They shall face no fatigue in it, nor shall they ever be driven out of it.",
    "ur": "اُنہیں نہ وہاں کسی مشقت سے پالا پڑے گا اور نہ وہ وہاں سے نکالے جائیں گے"
  },
  {
    "id": 31,
    "reference": "16:30",
    "ar": "۞ وَقِيلَ لِلَّذِينَ ٱتَّقَوْا۟ مَاذَآ أَنزَلَ رَبُّكُمْ ۚ قَالُوا۟ خَيْرًۭا ۗ لِّلَّذِينَ أَحْسَنُوا۟ فِى هَٰذِهِ ٱلدُّنْيَا حَسَنَةٌۭ ۚ وَلَدَارُ ٱلْءَاخِرَةِ خَيْرٌۭ ۚ وَلَنِعْمَ دَارُ ٱلْمُتَّقِينَ",
    "en": "And when the God-fearing are asked: \"What has your Lord revealed?\" they answer: \"Something excellent!\" Good fortune in this world awaits those who do good; and certainly the abode of the Hereafter is even better for them. How excellent is the abode of the God-fearing:",
    "ur": "دوسری طرف جب خدا ترس لوگوں سے پوچھا جاتا ہے کہ یہ کیا چیز ہے جو تمہارے رب کی طرف سے نازل ہوئی ہے، تو وہ جواب دیتے ہیں کہ \"بہترین چیز اتری ہے\" اِس طرح کے نیکوکار لوگوں کے لیے اِس دنیا میں بھی بھلائی ہے اور آخرت کا گھر تو ضرور ہی ان کے حق میں بہتر ہے بڑا اچھا گھر ہے متقیوں کا"
  },
  {
    "id": 32,
    "reference": "16:31",
    "ar": "جَنَّٰتُ عَدْنٍۢ يَدْخُلُونَهَا تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ لَهُمْ فِيهَا مَا يَشَآءُونَ ۚ كَذَٰلِكَ يَجْزِى ٱللَّهُ ٱلْمُتَّقِينَ",
    "en": "everlasting gardens that they shall enter; the gardens beneath which rivers shall flow, and where they shall have whatever they desire! Thus does Allah reward the God-fearing,",
    "ur": "دائمی قیام کی جنتیں، جن میں وہ داخل ہوں گے، نیچے نہریں بہہ رہی ہونگی، اور سب کچھ وہاں عین اُن کی خواہش کے مطابق ہوگا یہ جزا دیتا ہے اللہ متقیوں کو"
  },
  {
    "id": 33,
    "reference": "18:31",
    "ar": "أُو۟لَٰٓئِكَ لَهُمْ جَنَّٰتُ عَدْنٍۢ تَجْرِى مِن تَحْتِهِمُ ٱلْأَنْهَٰرُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍۢ وَيَلْبَسُونَ ثِيَابًا خُضْرًۭا مِّن سُندُسٍۢ وَإِسْتَبْرَقٍۢ مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلْأَرَآئِكِ ۚ نِعْمَ ٱلثَّوَابُ وَحَسُنَتْ مُرْتَفَقًۭا",
    "en": "They shall dwell in the Gardens of Eternity, beneath which streams flow. There they will be adorned with bracelets of gold, will be arrayed in green garments of silk and rich brocade, and will recline on raised couches. How excellent is their reward, and how nice their resting-place!\"",
    "ur": "ان کے لیے سدا بہار جنتیں ہیں جن کے نیچے نہریں بہہ رہی ہوں گی، وہاں وہ سونے کے کنگنوں سے آراستہ کیے جائیں گے، باریک ریشم اور اطلس و دیبا کے سبز کپڑے پہنیں گے، اور اونچی مسندوں پر تکیے لگا کر بیٹھیں گے بہترین اجر اور اعلیٰ درجے کی جائے قیام!"
  },
  {
    "id": 34,
    "reference": "18:107",
    "ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ كَانَتْ لَهُمْ جَنَّٰتُ ٱلْفِرْدَوْسِ نُزُلًا",
    "en": "As for those who believe and do good works, the Gardens of Paradise shall be there to welcome them;",
    "ur": "البتّہ وہ لوگ جو ایمان لائے اور جنہوں نے نیک عمل کیے، ان کی میزبانی کے لیے فردوس کے باغ ہوں گے"
  },
  {
    "id": 35,
    "reference": "18:108",
    "ar": "خَٰلِدِينَ فِيهَا لَا يَبْغُونَ عَنْهَا حِوَلًۭا",
    "en": "there they will abide for ever, with no desire to be removed from there.\"",
    "ur": "جن میں وہ ہمیشہ رہیں گے اور کبھی اُس جگہ سے نکل کر کہیں جانے کو اُن کا جی نہ چاہے گا"
  },
  {
    "id": 36,
    "reference": "19:60",
    "ar": "إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًۭا فَأُو۟لَٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ وَلَا يُظْلَمُونَ شَيْـًۭٔا",
    "en": "except those who repent and believe and act righteously. Such shall enter Paradise and shall not be wronged at all.",
    "ur": "البتہ جو توبہ کر لیں اور ایمان لے آئیں اور نیک عملی اختیار کر لیں وہ جنّت میں داخل ہوں گے اور ان کی ذرّہ برابر حق تلفی نہ ہو گی"
  },
  {
    "id": 37,
    "reference": "19:61",
    "ar": "جَنَّٰتِ عَدْنٍ ٱلَّتِى وَعَدَ ٱلرَّحْمَٰنُ عِبَادَهُۥ بِٱلْغَيْبِ ۚ إِنَّهُۥ كَانَ وَعْدُهُۥ مَأْتِيًّۭا",
    "en": "Theirs shall be everlasting Gardens which the Most Compassionate Lord has promised His servants in a realm which is beyond the ken of perception. Surely His promise shall he fulfilled.",
    "ur": "ان کے لیے ہمیشہ رہنے والی جنتیں ہیں جن کا رحمان نے اپنے بندوں سے در پردہ وعدہ کر رکھا ہے اور یقیناً یہ وعدہ پُورا ہو کر رہنا ہے"
  },
  {
    "id": 38,
    "reference": "19:62",
    "ar": "لَّا يَسْمَعُونَ فِيهَا لَغْوًا إِلَّا سَلَٰمًۭا ۖ وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةًۭ وَعَشِيًّۭا",
    "en": "They shall not hear in it anything vain; they shall hear only what is good; and they shall have their provision in it, morning and evening.",
    "ur": "وہاں وہ کوئی بے ہودہ بات نہ سُنیں گے، جو کچھ بھی سُنیں گے ٹھیک ہی سنیں گے اور ان کا رزق انہیں پیہم صبح و شام ملتا رہے گا"
  },
  {
    "id": 39,
    "reference": "21:102",
    "ar": "لَا يَسْمَعُونَ حَسِيسَهَا ۖ وَهُمْ فِى مَا ٱشْتَهَتْ أَنفُسُهُمْ خَٰلِدُونَ",
    "en": "They shall not hear even a whisper of it, and they shall live for ever in the delights which they had desired.",
    "ur": "اس کی سرسراہٹ تک نہ سُنیں گے اور وہ ہمیشہ ہمیشہ اپنی من بھاتی چیزوں کے درمیان رہیں گے"
  },
  {
    "id": 40,
    "reference": "22:23",
    "ar": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍۢ وَلُؤْلُؤًۭا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌۭ",
    "en": "(On the other hand), Allah will cause those who believed and acted righteously to enter the Gardens beneath which rivers flow. They shall be decked in them with bracelets of gold and pearls and their raiment shall be of silk.",
    "ur": "(دوسری طرف) جو لوگ ایمان لائے اور جنہوں نے نیک عمل کیے اُن کو اللہ ایسی جنتوں میں داخل کرے گا جن کے نیچے نہریں بہہ رہی ہوں گی وہاں وہ سونے کے کنگنوں اور موتیوں سے آراستہ کیے جائیں گے اور ان کے لباس ریشم کے ہوں گے"
  },
  {
    "id": 41,
    "reference": "25:15",
    "ar": "قُلْ أَذَٰلِكَ خَيْرٌ أَمْ جَنَّةُ ٱلْخُلْدِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ ۚ كَانَتْ لَهُمْ جَزَآءًۭ وَمَصِيرًۭا",
    "en": "Ask them \"Is this (Fire) better or the everlasting Garden which has been promised to the God-fearing righteous people?\" which will be the recompense of their good deeds and the final destination of their journey",
    "ur": "اِن سے پوچھو، یہ انجام اچھا ہے یا وہ اَبدی جنت جس کا وعدہ خداترس پرہیزگاروں سے کیا گیا ہے؟ جو اُن کے اعمال کی جزا اور اُن کے سفر کی آخری منزل ہو گی"
  },
  {
    "id": 42,
    "reference": "25:16",
    "ar": "لَّهُمْ فِيهَا مَا يَشَآءُونَ خَٰلِدِينَ ۚ كَانَ عَلَىٰ رَبِّكَ وَعْدًۭا مَّسْـُٔولًۭا",
    "en": "wherein they will get everything they desire and wherein they will dwell for ever. This is a promise which your Lord has taken upon Himself to fulfil.",
    "ur": "جس میں اُن کی ہر خواہش پوری ہو گی، جس میں وہ ہمیشہ ہمیشہ رہیں گے، جس کا عطا کرنا تمہارے پروردگار کے ذمے ایک واجب الادا وعدہ ہے"
  },
  {
    "id": 43,
    "reference": "25:24",
    "ar": "أَصْحَٰبُ ٱلْجَنَّةِ يَوْمَئِذٍ خَيْرٌۭ مُّسْتَقَرًّۭا وَأَحْسَنُ مَقِيلًۭا",
    "en": "(On the contrary) only those who have deserved the Garden, will have a good abode on that Day and a cool place for midday rest.",
    "ur": "بس وہی لوگ جو جنت کے مستحق ہیں اُس دن اچھی جگہ ٹھیریں گے اور دوپہرگزارنے کو عمدہ مقام پائیں گے"
  },
  {
    "id": 44,
    "reference": "29:58",
    "ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَنُبَوِّئَنَّهُم مِّنَ ٱلْجَنَّةِ غُرَفًۭا تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا ۚ نِعْمَ أَجْرُ ٱلْعَٰمِلِينَ",
    "en": "We shall house those who believed and acted righteously in the lofty mansions of Paradise beneath which rivers flow. There they shall remain for ever. How excellent a reward it is for those who acted (in obedience to Allah),",
    "ur": "جو لوگ ایمان لائے ہیں اور جنہوں نے نیک عمل کیے ہیں ان کو ہم جنت کی بلند و بالا عمارتوں میں رکھیں گے جن کے نیچے نہریں بہتی ہوں گی، وہاں وہ ہمیشہ رہیں گے، کیا ہی عمدہ اجر ہے عمل کرنے والوں کے لیے"
  },
  {
    "id": 45,
    "reference": "32:17",
    "ar": "فَلَا تَعْلَمُ نَفْسٌۭ مَّآ أُخْفِىَ لَهُم مِّن قُرَّةِ أَعْيُنٍۢ جَزَآءًۢ بِمَا كَانُوا۟ يَعْمَلُونَ",
    "en": "No one knows what delights of the eyes are kept hidden for them as a reward for their deeds.",
    "ur": "پھر جیسا کچھ آنکھوں کی ٹھنڈک کا سامان ان کے اعمال کی جزا میں ان کے لیے چھپا رکھا گیا ہے اس کی کسی متنفس کو خبر نہیں ہے"
  },
  {
    "id": 46,
    "reference": "32:19",
    "ar": "أَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَلَهُمْ جَنَّٰتُ ٱلْمَأْوَىٰ نُزُلًۢا بِمَا كَانُوا۟ يَعْمَلُونَ",
    "en": "As for those who believe and act righteously, theirs shall be Gardens to dwell in, a hospitality to reward them for their deeds.",
    "ur": "جو لوگ ایمان لائے ہیں اور جنہوں نے نیک عمل کیے ہیں اُن کے لیے تو جنتوں کی قیام گاہیں ہیں، ضیافت کے طور پر اُن کے اعمال کے بدلے میں"
  },
  {
    "id": 47,
    "reference": "35:33",
    "ar": "جَنَّٰتُ عَدْنٍۢ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍۢ وَلُؤْلُؤًۭا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌۭ",
    "en": "They shall enter the everlasting Gardens, shall be adorned with bracelets of gold and with pearls, and their apparel therein shall be silk.",
    "ur": "ہمیشہ رہنے والی جنتیں ہیں جن میں یہ لوگ داخل ہوں گے وہاں انہیں سونے کے کنگنوں اور موتیوں سے آراستہ کیا جائے گا، وہاں ان کا لباس ریشم ہوگا"
  },
  {
    "id": 48,
    "reference": "35:34",
    "ar": "وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِىٓ أَذْهَبَ عَنَّا ٱلْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌۭ شَكُورٌ",
    "en": "They will say: “All praise be to Allah Who has taken away all sorrow from us. Surely our Lord is Most Forgiving, Most Appreciative;",
    "ur": "اور وہ کہیں گے کہ شکر ہے اُس خدا کا جس نے ہم سے غم دور کر دیا، یقیناً ہمارا رب معاف کرنے والا اور قدر فرمانے والا ہے"
  },
  {
    "id": 49,
    "reference": "35:35",
    "ar": "ٱلَّذِىٓ أَحَلَّنَا دَارَ ٱلْمُقَامَةِ مِن فَضْلِهِۦ لَا يَمَسُّنَا فِيهَا نَصَبٌۭ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌۭ",
    "en": "(the Lord) Who, out of His Bounty, has made us dwell in an abode wherein no toil, nor fatigue affects us.",
    "ur": "جس نے ہمیں اپنے فضل سے ابدی قیام کی جگہ ٹھیرا دیا، اب یہاں نہ ہمیں کوئی مشقت پیش آتی ہے اور نہ تکان لاحق ہوتی ہے"
  },
  {
    "id": 50,
    "reference": "36:55",
    "ar": "إِنَّ أَصْحَٰبَ ٱلْجَنَّةِ ٱلْيَوْمَ فِى شُغُلٍۢ فَٰكِهُونَ",
    "en": "Indeed, the people of Paradise will be busy enjoying themselves:",
    "ur": "آج جنتی لوگ مزے کرنے میں مشغول ہیں"
  },
  {
    "id": 51,
    "reference": "36:56",
    "ar": "هُمْ وَأَزْوَٰجُهُمْ فِى ظِلَٰلٍ عَلَى ٱلْأَرَآئِكِ مُتَّكِـُٔونَ",
    "en": "they and their spouses shall be reclining on their couches in shady groves;",
    "ur": "وہ اور ان کی بیویاں گھنے سایوں میں ہیں مسندوں پر تکیے لگائے ہوئے"
  },
  {
    "id": 52,
    "reference": "36:57",
    "ar": "لَهُمْ فِيهَا فَٰكِهَةٌۭ وَلَهُم مَّا يَدَّعُونَ",
    "en": "therein there will be all kinds of fruits to eat, and they shall have all that they desire.",
    "ur": "ہر قسم کی لذیذ چیزیں کھانے پینے کو ان کے لیے وہاں موجود ہیں، جو کچھ وہ طلب کریں اُن کے لیے حاضر ہے"
  },
  {
    "id": 53,
    "reference": "36:58",
    "ar": "سَلَٰمٌۭ قَوْلًۭا مِّن رَّبٍّۢ رَّحِيمٍۢ",
    "en": "“Peace” shall be the word conveyed to them from their Merciful Lord.",
    "ur": "رب رحیم کی طرف سے ان کو سلام کہا گیا ہے"
  },
  {
    "id": 54,
    "reference": "37:41",
    "ar": "أُو۟لَٰٓئِكَ لَهُمْ رِزْقٌۭ مَّعْلُومٌۭ",
    "en": "For them awaits a known provision,",
    "ur": "ان کے لیے جانا بوجھا رزق ہے"
  },
  {
    "id": 55,
    "reference": "37:42",
    "ar": "فَوَٰكِهُ ۖ وَهُم مُّكْرَمُونَ",
    "en": "a variety of delicious fruits; and they shall be honoured",
    "ur": "ہر طرح کی لذیذ چیزیں،"
  },
  {
    "id": 56,
    "reference": "37:43",
    "ar": "فِى جَنَّٰتِ ٱلنَّعِيمِ",
    "en": "in the Gardens of Bliss.",
    "ur": "اور نعمت بھری جنتیں"
  },
  {
    "id": 57,
    "reference": "37:44",
    "ar": "عَلَىٰ سُرُرٍۢ مُّتَقَٰبِلِينَ",
    "en": "They will be seated upon couches set face to face;",
    "ur": "جن میں وہ عزت کے ساتھ رکھے جائیں گے تختوں پر آمنے سامنے بیٹھیں گے"
  },
  {
    "id": 58,
    "reference": "37:45",
    "ar": "يُطَافُ عَلَيْهِم بِكَأْسٍۢ مِّن مَّعِينٍۭ",
    "en": "a cup filled with wine from its springs, will be passed around to them;",
    "ur": "شراب کے چشموں سے ساغر بھر بھر کر ان کے درمیان پھرائے جائیں گے"
  },
  {
    "id": 59,
    "reference": "37:46",
    "ar": "بَيْضَآءَ لَذَّةٍۢ لِّلشَّٰرِبِينَ",
    "en": "white, sparkling (wine), a delight to the drinkers.",
    "ur": "چمکتی ہوئی شراب، جو پینے والوں کے لیے لذّت ہو گی"
  },
  {
    "id": 60,
    "reference": "37:47",
    "ar": "لَا فِيهَا غَوْلٌۭ وَلَا هُمْ عَنْهَا يُنزَفُونَ",
    "en": "There will neither be any harm in it for their body nor will it intoxicate their mind.",
    "ur": "نہ ان کے جسم کو اس سے کوئی ضرر ہوگا اور نہ ان کی عقل اس سے خراب ہو گی"
  },
  {
    "id": 61,
    "reference": "37:48",
    "ar": "وَعِندَهُمْ قَٰصِرَٰتُ ٱلطَّرْفِ عِينٌۭ",
    "en": "Theirs shall be wide-eyed maidens with bashful, restrained glances,",
    "ur": "اور ان کے پاس نگاہیں بچانے والی، خوبصورت آنکھوں والی عورتیں ہوں گی"
  },
  {
    "id": 62,
    "reference": "37:49",
    "ar": "كَأَنَّهُنَّ بَيْضٌۭ مَّكْنُونٌۭ",
    "en": "so delicate as the hidden peel under an egg's shell.",
    "ur": "ایسی نازک جیسے انڈے کے چھلکے کے نیچے چھپی ہوئی جھلی"
  },
  {
    "id": 63,
    "reference": "37:50",
    "ar": "فَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍۢ يَتَسَآءَلُونَ",
    "en": "Then some of them will turn to others, and will ask each other.",
    "ur": "پھر وہ ایک دوسرے کی طرف متوجہ ہو کر حالات پوچھیں گے"
  },
  {
    "id": 64,
    "reference": "37:51",
    "ar": "قَالَ قَآئِلٌۭ مِّنْهُمْ إِنِّى كَانَ لِى قَرِينٌۭ",
    "en": "One of them will say: “I had a companion in the world",
    "ur": "ان میں سے ایک کہے گا، \"دنیا میں میرا ایک ہم نشین تھا"
  },
  {
    "id": 65,
    "reference": "37:52",
    "ar": "يَقُولُ أَءِنَّكَ لَمِنَ ٱلْمُصَدِّقِينَ",
    "en": "who used to say: -- Are you also one of those who confirm the Truth (of life after death)?",
    "ur": "جو مجھ سے کہا کرتا تھا، کیا تم بھی تصدیق کرنے والوں میں سے ہو؟"
  },
  {
    "id": 66,
    "reference": "37:53",
    "ar": "أَءِذَا مِتْنَا وَكُنَّا تُرَابًۭا وَعِظَٰمًا أَءِنَّا لَمَدِينُونَ",
    "en": "After we are dead and have become all dust and bones shall we still be requited?'",
    "ur": "کیا واقعی جب ہم مر چکے ہوں گے اور مٹی ہو جائیں گے اور ہڈیوں کا پنجر بن کر رہ جائیں گے تو ہمیں جزا و سزا دی جائے گی؟"
  },
  {
    "id": 67,
    "reference": "37:54",
    "ar": "قَالَ هَلْ أَنتُم مُّطَّلِعُونَ",
    "en": "He will say: -- Do you wish to know where he is now?'",
    "ur": "اب کیا آپ لوگ دیکھنا چاہتے ہیں کہ وہ صاحب اب کہاں ہیں؟\""
  },
  {
    "id": 68,
    "reference": "37:55",
    "ar": "فَٱطَّلَعَ فَرَءَاهُ فِى سَوَآءِ ٱلْجَحِيمِ",
    "en": "Then he will look downwards, and will see him in the depths of Hell.",
    "ur": "یہ کہہ کر جونہی وہ جھکے گا تو جہنم کی گہرائی میں اس کو دیکھ لے گا"
  },
  {
    "id": 69,
    "reference": "37:56",
    "ar": "قَالَ تَٱللَّهِ إِن كِدتَّ لَتُرْدِينِ",
    "en": "He will say to him: -- By Allah, you almost ruined me.",
    "ur": "اور اس سے خطاب کر کے کہے گا \"خدا کی قسم، تُو تو مجھے تباہ ہی کر دینے والا تھا"
  },
  {
    "id": 70,
    "reference": "37:57",
    "ar": "وَلَوْلَا نِعْمَةُ رَبِّى لَكُنتُ مِنَ ٱلْمُحْضَرِينَ",
    "en": "But for Allah's favour, I should be one of those who have been mustered here.",
    "ur": "میرے رب کا فضل شامل حال نہ ہوتا تو آج میں بھی اُن لوگوں میں سے ہوتا جو پکڑے ہوئے آئے ہیں"
  },
  {
    "id": 71,
    "reference": "37:58",
    "ar": "أَفَمَا نَحْنُ بِمَيِّتِينَ",
    "en": "So, are we not going to die,",
    "ur": "اچھا تو کیا اب ہم مرنے والے نہیں ہیں؟"
  },
  {
    "id": 72,
    "reference": "37:59",
    "ar": "إِلَّا مَوْتَتَنَا ٱلْأُولَىٰ وَمَا نَحْنُ بِمُعَذَّبِينَ",
    "en": "except for our first death? And shall we suffer no chastisement?'”",
    "ur": "موت جو ہمیں آنی تھی وہ بس پہلے آ چکی؟ اب ہمیں کوئی عذاب نہیں ہونا؟\""
  },
  {
    "id": 73,
    "reference": "37:60",
    "ar": "إِنَّ هَٰذَا لَهُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "Surely this is the supreme triumph.",
    "ur": "یقیناً یہی عظیم الشان کامیابی ہے"
  },
  {
    "id": 74,
    "reference": "38:49",
    "ar": "هَٰذَا ذِكْرٌۭ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَـَٔابٍۢ",
    "en": "This was a remembrance. An excellent retreat awaits the God-fearing",
    "ur": "یہ ایک ذکر تھا (اب سنو کہ) متقی لوگوں کے لیے یقیناً بہترین ٹھکانا ہے"
  },
  {
    "id": 75,
    "reference": "38:50",
    "ar": "جَنَّٰتِ عَدْنٍۢ مُّفَتَّحَةًۭ لَّهُمُ ٱلْأَبْوَٰبُ",
    "en": "-- everlasting Gardens with gates wide open for them",
    "ur": "ہمیشہ رہنے والی جنتیں جن کے دروازے اُن کے لیے کھلے ہوں گے"
  },
  {
    "id": 76,
    "reference": "38:51",
    "ar": "مُتَّكِـِٔينَ فِيهَا يَدْعُونَ فِيهَا بِفَٰكِهَةٍۢ كَثِيرَةٍۢ وَشَرَابٍۢ",
    "en": "wherein they shall recline, wherein they shall ask for abundant fruit and drinks,",
    "ur": "ان میں وہ تکیے لگائے بیٹھے ہوں گے، خوب خوب فواکہ اور مشروبات طلب کر رہے ہوں گے"
  },
  {
    "id": 77,
    "reference": "38:52",
    "ar": "۞ وَعِندَهُمْ قَٰصِرَٰتُ ٱلطَّرْفِ أَتْرَابٌ",
    "en": "and wherein there shall be with them well-matched, bashful mates.",
    "ur": "اور ان کے پاس شرمیلی ہم سن بیویاں ہوں گی"
  },
  {
    "id": 78,
    "reference": "38:53",
    "ar": "هَٰذَا مَا تُوعَدُونَ لِيَوْمِ ٱلْحِسَابِ",
    "en": "All this is what you are promised for the Day of Judgement.",
    "ur": "یہ وہ چیزیں ہیں جنہیں حساب کے دن عطا کرنے کا تم سے وعدہ کیا جا رہا ہے"
  },
  {
    "id": 79,
    "reference": "38:54",
    "ar": "إِنَّ هَٰذَا لَرِزْقُنَا مَا لَهُۥ مِن نَّفَادٍ",
    "en": "This is Our provision for you, never to end.",
    "ur": "یہ ہمارا رزق ہے جو کبھی ختم ہونے والا نہیں"
  },
  {
    "id": 80,
    "reference": "39:34",
    "ar": "لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَآءُ ٱلْمُحْسِنِينَ",
    "en": "They shall have from their Lord all that they wish for. That is the reward of those that do good,",
    "ur": "انہیں اپنے رب کے ہاں وہ سب کچھ ملے گا جس کی وہ خواہش کریں گے یہ ہے نیکی کرنے والوں کی جزا"
  },
  {
    "id": 81,
    "reference": "39:73",
    "ar": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ إِلَى ٱلْجَنَّةِ زُمَرًا ۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتْ أَبْوَٰبُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَٰمٌ عَلَيْكُمْ طِبْتُمْ فَٱدْخُلُوهَا خَٰلِدِينَ",
    "en": "And those who eschewed disobeying their Lord shall be driven in companies to Paradise so that when they arrive there its gates will have already been thrown open and its keepers shall say to them: “Peace be upon you; you have done well. So enter. Herein you shall abide.”",
    "ur": "اور جو لوگ اپنے رب کی نافرمانی سے پرہیز کرتے تھے انہیں گروہ در گروہ جنت کی طرف لے جایا جائے گا یہاں تک کہ جب وہ وہاں پہنچیں گے، اور اس کے دروازے پہلے ہی کھولے جا چکے ہوں گے، تو اُس کے منتظمین ان سے کہیں گے کہ \"سلام ہو تم پر، بہت اچھے رہے، داخل ہو جاؤ اس میں ہمیشہ کے لیے\""
  },
  {
    "id": 82,
    "reference": "39:74",
    "ar": "وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى صَدَقَنَا وَعْدَهُۥ وَأَوْرَثَنَا ٱلْأَرْضَ نَتَبَوَّأُ مِنَ ٱلْجَنَّةِ حَيْثُ نَشَآءُ ۖ فَنِعْمَ أَجْرُ ٱلْعَٰمِلِينَ",
    "en": "They will say: “All thanks and praise be to Allah Who has made His promise to us come true, and Who gave us the earth to inherit. We may now dwell in Paradise wherever we please.” How excellent is the reward of those who laboured!",
    "ur": "اور وہ کہیں گے \"شکر ہے اُس خدا کا جس نے ہمارے ساتھ اپنا وعدہ سچ کر دکھایا اور ہم کو زمین کا وارث بنا دیا، اب ہم جنت میں جہاں چاہیں اپنی جگہ بنا سکتے ہیں\" پس بہترین اجر ہے عمل کرنے والوں کے لیے"
  },
  {
    "id": 83,
    "reference": "40:40",
    "ar": "مَنْ عَمِلَ سَيِّئَةًۭ فَلَا يُجْزَىٰٓ إِلَّا مِثْلَهَا ۖ وَمَنْ عَمِلَ صَٰلِحًۭا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌۭ فَأُو۟لَٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍۢ",
    "en": "Whosoever does an evil deed will be requited only with the like of it; and whosoever acts righteously and has attained to faith -- be he a male or a female -- they shall enter Paradise and be provided sustenance beyond all reckoning.",
    "ur": "جو برائی کرے گا اُس کو اتنا ہی بدلہ ملے گا جتنی اُس نے برائی کی ہو گی اور جو نیک عمل کرے گا، خواہ وہ مرد ہو یا عورت، بشرطیکہ ہو وہ مومن، ایسے سب لوگ جنت میں داخل ہوں گے جہاں اُن کو بے حساب رزق دیا جائے گا"
  },
  {
    "id": 84,
    "reference": "41:31",
    "ar": "نَحْنُ أَوْلِيَآؤُكُمْ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَفِى ٱلْءَاخِرَةِ ۖ وَلَكُمْ فِيهَا مَا تَشْتَهِىٓ أَنفُسُكُمْ وَلَكُمْ فِيهَا مَا تَدَّعُونَ",
    "en": "We are your companions in this world and in the Hereafter. There you shall have all that you desire and all what you will ask for.",
    "ur": "ہم اِس دنیا کی زندگی میں بھی تمہارے ساتھی ہیں اور آخرت میں بھی، وہاں جو کچھ تم چاہو گے تمہیں ملے گا اور ہر چیز جس کی تم تمنا کرو گے وہ تمہاری ہوگی"
  },
  {
    "id": 85,
    "reference": "43:70",
    "ar": "ٱدْخُلُوا۟ ٱلْجَنَّةَ أَنتُمْ وَأَزْوَٰجُكُمْ تُحْبَرُونَ",
    "en": "Enter Paradise joyfully, both you and your spouses.”",
    "ur": "داخل ہو جاؤ جنت میں تم اور تمہاری بیویاں، تمہیں خوش کر دیا جائے گا\""
  },
  {
    "id": 86,
    "reference": "43:71",
    "ar": "يُطَافُ عَلَيْهِم بِصِحَافٍۢ مِّن ذَهَبٍۢ وَأَكْوَابٍۢ ۖ وَفِيهَا مَا تَشْتَهِيهِ ٱلْأَنفُسُ وَتَلَذُّ ٱلْأَعْيُنُ ۖ وَأَنتُمْ فِيهَا خَٰلِدُونَ",
    "en": "Platters and cups of gold shall be passed around them, and there shall be all that they might desire and all that their eyes might delight in. (They shall be told): “Herein shall you abide for ever.",
    "ur": "اُن کے آگے سونے کے تھال اور ساغر گردش کرائے جائیں گے اور ہر من بھاتی اور نگاہوں کو لذت دینے والی چیز وہاں موجود ہو گی ان سے کہا جائے گا، \"تم اب یہاں ہمیشہ رہو گے"
  },
  {
    "id": 87,
    "reference": "43:72",
    "ar": "وَتِلْكَ ٱلْجَنَّةُ ٱلَّتِىٓ أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
    "en": "Such is the Paradise that you shall inherit by virtue of your good deeds in the life of the world.",
    "ur": "تم اِس جنت کے وارث اپنے اُن اعمال کی وجہ سے ہوئے ہو جو تم دنیا میں کرتے رہے"
  },
  {
    "id": 88,
    "reference": "43:73",
    "ar": "لَكُمْ فِيهَا فَٰكِهَةٌۭ كَثِيرَةٌۭ مِّنْهَا تَأْكُلُونَ",
    "en": "Herein you will have abundant fruits of which you will eat.”",
    "ur": "تمہارے لیے یہاں بکثرت فواکہ موجود ہیں جنہیں تم کھاؤ گے\""
  },
  {
    "id": 89,
    "reference": "44:51",
    "ar": "إِنَّ ٱلْمُتَّقِينَ فِى مَقَامٍ أَمِينٍۢ",
    "en": "Verily the God-fearing shall be in a secure place",
    "ur": "خدا ترس لوگ امن کی جگہ میں ہوں گے"
  },
  {
    "id": 90,
    "reference": "44:52",
    "ar": "فِى جَنَّٰتٍۢ وَعُيُونٍۢ",
    "en": "amidst gardens and springs.",
    "ur": "باغوں اور چشموں میں"
  },
  {
    "id": 91,
    "reference": "44:53",
    "ar": "يَلْبَسُونَ مِن سُندُسٍۢ وَإِسْتَبْرَقٍۢ مُّتَقَٰبِلِينَ",
    "en": "Attired in silk and brocade, they shall be arrayed face to face.",
    "ur": "حریر و دیبا کے لباس پہنے، آمنے سامنے بیٹھے ہوں گے"
  },
  {
    "id": 92,
    "reference": "44:54",
    "ar": "كَذَٰلِكَ وَزَوَّجْنَٰهُم بِحُورٍ عِينٍۢ",
    "en": "Thus shall it be: and We shall espouse them to fair, wide-eyed maidens.",
    "ur": "یہ ہوگی ان کی شان اور ہم گوری گوری آہو چشم عورتیں ان سے بیاہ دیں گے"
  },
  {
    "id": 93,
    "reference": "44:55",
    "ar": "يَدْعُونَ فِيهَا بِكُلِّ فَٰكِهَةٍ ءَامِنِينَ",
    "en": "While resting in security, they shall call for all kinds of fruit.",
    "ur": "وہاں وہ اطمینان سے ہر طرح کی لذیذ چیزیں طلب کریں گے"
  },
  {
    "id": 94,
    "reference": "44:56",
    "ar": "لَا يَذُوقُونَ فِيهَا ٱلْمَوْتَ إِلَّا ٱلْمَوْتَةَ ٱلْأُولَىٰ ۖ وَوَقَىٰهُمْ عَذَابَ ٱلْجَحِيمِ",
    "en": "They shall not taste death except the death in this world. And Allah will save them from the chastisement of Hell",
    "ur": "وہاں موت کا مزہ وہ کبھی نہ چکھیں گے، بس دنیا میں جو موت آ چکی سو آ چکی اور اللہ اپنے فضل سے،"
  },
  {
    "id": 95,
    "reference": "47:12",
    "ar": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ وَٱلَّذِينَ كَفَرُوا۟ يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ ٱلْأَنْعَٰمُ وَٱلنَّارُ مَثْوًۭى لَّهُمْ",
    "en": "Allah shall admit those who believe and do righteous works to the Gardens beneath which rivers flow. As for the unbelievers, they enjoy the pleasures of this transient life and eat as cattle eat. The Fire shall be their resort.",
    "ur": "ایمان لانے والوں اور نیک عمل کرنے والوں کو اللہ اُن جنتوں میں داخل کرے گا جن کے نیچے نہریں بہتی ہیں، اور کفر کرنے والے بس دنیا کی چند روزہ زندگی کے مزے لوٹ رہے ہیں، جانوروں کی طرح کھا پی رہے ہیں، اور اُن کا آخری ٹھکانا جہنم ہے"
  },
  {
    "id": 96,
    "reference": "47:15",
    "ar": "مَّثَلُ ٱلْجَنَّةِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ ۖ فِيهَآ أَنْهَٰرٌۭ مِّن مَّآءٍ غَيْرِ ءَاسِنٍۢ وَأَنْهَٰرٌۭ مِّن لَّبَنٍۢ لَّمْ يَتَغَيَّرْ طَعْمُهُۥ وَأَنْهَٰرٌۭ مِّنْ خَمْرٍۢ لَّذَّةٍۢ لِّلشَّٰرِبِينَ وَأَنْهَٰرٌۭ مِّنْ عَسَلٍۢ مُّصَفًّۭى ۖ وَلَهُمْ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَمَغْفِرَةٌۭ مِّن رَّبِّهِمْ ۖ كَمَنْ هُوَ خَٰلِدٌۭ فِى ٱلنَّارِ وَسُقُوا۟ مَآءً حَمِيمًۭا فَقَطَّعَ أَمْعَآءَهُمْ",
    "en": "Here is the parable of Paradise which the God-fearing have been promised: in it shall be rivers of incorruptible water, rivers of milk unchanging in taste, and rivers of wine, a delight to those that drink; and rivers of pure honey. In it they will have every kind of fruit as well as forgiveness from their Lord. Can such be like those who will abide in the Fire and will be given a boiling water to drink that will tear their bowels apart?",
    "ur": "پرہیز گاروں کے لیے جس جنت کا وعدہ کیا گیا ہے اس کی شان تو یہ ہے کہ اس میں نہریں بہہ رہی ہوں گی نتھرے ہوئے پانی کی، نہریں بہہ رہی ہوں گی ایسے دودھ کی جس کے مزے میں ذرا فرق نہ آیا ہو گا، نہریں بہہ رہی ہوں گی ایسی شراب کی جو پینے والوں کے لیے لذیذ ہوگی، نہریں بہہ رہی ہوں گی صاف شفاف شہد کی اُس میں اُن کے لیے ہر طرح کے پھل ہوں گے اور اُن کے رب کی طرف سے بخشش (کیا وہ شخص جس کے حصہ میں یہ جنت آنے والی ہے) اُن لوگوں کی طرح ہو سکتا ہے جو جہنم میں ہمیشہ رہیں گے اور جنہیں ایسا گرم پانی پلایا جائے گا جو ان کی آنتیں تک کاٹ دے گا؟"
  },
  {
    "id": 97,
    "reference": "50:34",
    "ar": "ٱدْخُلُوهَا بِسَلَٰمٍۢ ۖ ذَٰلِكَ يَوْمُ ٱلْخُلُودِ",
    "en": "Enter this Paradise in peace.” That will be the Day of Eternity.",
    "ur": "داخل ہو جاؤ جنت میں سلامتی کے ساتھ\" وہ دن حیات ابدی کا دن ہوگا"
  },
  {
    "id": 98,
    "reference": "50:35",
    "ar": "لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌۭ",
    "en": "Therein they shall get whatever they desire; and with Us there is even more.",
    "ur": "وہاں ان کے لیے وہ سب کچھ ہوگا جو وہ چاہیں گے، اور ہمارے پاس اس سے زیادہ بھی بہت کچھ ان کے لیے ہے"
  },
  {
    "id": 99,
    "reference": "52:17",
    "ar": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍۢ وَنَعِيمٍۢ",
    "en": "Surely the God-fearing shall be in Gardens and bliss,",
    "ur": "متقی لوگ وہاں باغوں اور نعمتوں میں ہوں گے"
  },
  {
    "id": 100,
    "reference": "52:18",
    "ar": "فَٰكِهِينَ بِمَآ ءَاتَىٰهُمْ رَبُّهُمْ وَوَقَىٰهُمْ رَبُّهُمْ عَذَابَ ٱلْجَحِيمِ",
    "en": "enjoying what Allah will have endowed them with; and their Lord will have saved them from the torment of the Blazing Fire.",
    "ur": "لطف لے رہے ہوں گے اُن چیزوں سے جو اُن کا رب انہیں دے گا، اور اُن کا رب اُنہیں دوزخ کے عذاب سے بچا لے گا"
  },
  {
    "id": 101,
    "reference": "52:19",
    "ar": "كُلُوا۟ وَٱشْرَبُوا۟ هَنِيٓـًٔۢا بِمَا كُنتُمْ تَعْمَلُونَ",
    "en": "(They will be told): “Eat and drink to your hearts' content as a reward for your deeds.”",
    "ur": "(ان سے کہا جائے گا) کھاؤ اور پیو مزے سے اپنے اُن اعمال کے صلے میں جو تم کرتے رہے ہو"
  },
  {
    "id": 102,
    "reference": "52:20",
    "ar": "مُتَّكِـِٔينَ عَلَىٰ سُرُرٍۢ مَّصْفُوفَةٍۢ ۖ وَزَوَّجْنَٰهُم بِحُورٍ عِينٍۢ",
    "en": "The God-fearing shall be reclining on couches facing each other, and We shall wed them to maidens with large, beautiful eyes.",
    "ur": "وہ آمنے سامنے بچھے ہوئے تختوں پر تکیے لگائے بیٹھے ہوں گے اور ہم خوبصورت آنکھوں والی حوریں اُن سے بیاہ دیں گے"
  },
  {
    "id": 103,
    "reference": "52:21",
    "ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَٱتَّبَعَتْهُمْ ذُرِّيَّتُهُم بِإِيمَٰنٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَآ أَلَتْنَٰهُم مِّنْ عَمَلِهِم مِّن شَىْءٍۢ ۚ كُلُّ ٱمْرِئٍۭ بِمَا كَسَبَ رَهِينٌۭ",
    "en": "We shall unite the believers with those descendants of theirs who followed them in their faith, and shall not deny them any part of the reward for their good deeds. Every person is pledged to what he did.",
    "ur": "جو لوگ ایمان لائے ہیں اور اُن کی اولاد بھی کسی درجہ ایمان میں ان کے نقش قدم پر چلی ہے ان کی اُس اولاد کو بھی ہم (جنت میں) اُن کے ساتھ ملا دیں گے اور اُن کے عمل میں کوئی گھاٹا ان کو نہ دیں گے ہر شخص اپنے کسب کے عوض رہن ہے"
  },
  {
    "id": 104,
    "reference": "52:22",
    "ar": "وَأَمْدَدْنَٰهُم بِفَٰكِهَةٍۢ وَلَحْمٍۢ مِّمَّا يَشْتَهُونَ",
    "en": "We shall provide them in abundance with all kinds of fruit and meat, whatever they may desire.",
    "ur": "ہم اُن کو ہر طرح کے پھل اور گوشت، جس چیز کو بھی ان کا جی چاہے گا، خوب دیے چلے جائیں گے"
  },
  {
    "id": 105,
    "reference": "52:23",
    "ar": "يَتَنَٰزَعُونَ فِيهَا كَأْسًۭا لَّا لَغْوٌۭ فِيهَا وَلَا تَأْثِيمٌۭ",
    "en": "They shall pass on to one another a cup that will incite neither levity nor sin.",
    "ur": "وہاں وہ ایک دوسرے سے جام شراب لپک لپک کر لے رہے ہوں گے جس میں نہ یاوہ گوئی ہوگی نہ بد کرداری"
  },
  {
    "id": 106,
    "reference": "52:24",
    "ar": "۞ وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌۭ لَّهُمْ كَأَنَّهُمْ لُؤْلُؤٌۭ مَّكْنُونٌۭ",
    "en": "Youths as fair as hidden pearls will be set apart to wait upon them; they will be running to and fro to serve them.",
    "ur": "اور اُن کی خدمت میں وہ لڑکے دوڑتے پھر رہے ہوں گے جو انہی کے لیے مخصوص ہوں گے ایسے خوبصورت جیسے چھپا کر رکھے ہوئے موتی"
  },
  {
    "id": 107,
    "reference": "52:25",
    "ar": "وَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍۢ يَتَسَآءَلُونَ",
    "en": "They will turn to one another and ask (regarding the past events).",
    "ur": "یہ لوگ آپس میں ایک دوسرے سے (دنیا میں گزرے ہوئے) حالات پوچھیں گے"
  },
  {
    "id": 108,
    "reference": "54:54",
    "ar": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍۢ وَنَهَرٍۢ",
    "en": "Surely those who shun disobedience will dwell amidst Gardens and running streams",
    "ur": "نافرمانی سے پرہیز کرنے والے یقیناً باغوں اور نہروں میں ہوں گے"
  },
  {
    "id": 109,
    "reference": "54:55",
    "ar": "فِى مَقْعَدِ صِدْقٍ عِندَ مَلِيكٍۢ مُّقْتَدِرٍۭ",
    "en": "where they will be honourably seated in the presence of a King, Mighty in Power.",
    "ur": "سچی عزت کی جگہ، بڑے ذی اقتدار بادشاہ کے قریب"
  },
  {
    "id": 110,
    "reference": "55:46",
    "ar": "وَلِمَنْ خَافَ مَقَامَ رَبِّهِۦ جَنَّتَانِ",
    "en": "For any who fears to stand before his Lord are two Gardens.",
    "ur": "اور ہر اُس شخص کے لیے جو اپنے رب کے حضور پیش ہونے کا خوف رکھتا ہو، دو باغ ہیں"
  },
  {
    "id": 111,
    "reference": "55:48",
    "ar": "ذَوَاتَآ أَفْنَانٍۢ",
    "en": "These Gardens will abound in green, blooming branches.",
    "ur": "ہری بھری ڈالیوں سے بھرپور"
  },
  {
    "id": 112,
    "reference": "55:50",
    "ar": "فِيهِمَا عَيْنَانِ تَجْرِيَانِ",
    "en": "In each of the two Gardens are two flowing springs.",
    "ur": "دونوں باغوں میں دو چشمے رواں"
  },
  {
    "id": 113,
    "reference": "55:52",
    "ar": "فِيهِمَا مِن كُلِّ فَٰكِهَةٍۢ زَوْجَانِ",
    "en": "In both these is a pair of every fruit.",
    "ur": "دونوں باغوں میں ہر پھل کی دو قسمیں"
  },
  {
    "id": 114,
    "reference": "55:54",
    "ar": "مُتَّكِـِٔينَ عَلَىٰ فُرُشٍۭ بَطَآئِنُهَا مِنْ إِسْتَبْرَقٍۢ ۚ وَجَنَى ٱلْجَنَّتَيْنِ دَانٍۢ",
    "en": "They shall recline on couches lined with brocade, and within reach shall hang the fruits of the two Gardens.",
    "ur": "جنتی لوگ ایسے فرشوں پر تکیے لگا کے بیٹھیں گے جن کے استر دبیز ریشم کے ہوں گے، اور باغوں کی ڈالیاں پھلوں سے جھکی پڑ رہی ہوں گی"
  },
  {
    "id": 115,
    "reference": "55:56",
    "ar": "فِيهِنَّ قَٰصِرَٰتُ ٱلطَّرْفِ لَمْ يَطْمِثْهُنَّ إِنسٌۭ قَبْلَهُمْ وَلَا جَآنٌّۭ",
    "en": "In the midst of these shall be maidens with modest, restrained glances; maidens whom no man or jinn has ever touched before.",
    "ur": "اِن نعمتوں کے درمیان شرمیلی نگاہوں والیاں ہوں گی جنہیں اِن جنتیوں سے پہلے کسی انسان یا جن نے چھوا نہ ہوگا"
  },
  {
    "id": 116,
    "reference": "55:58",
    "ar": "كَأَنَّهُنَّ ٱلْيَاقُوتُ وَٱلْمَرْجَانُ",
    "en": "Lovely as rubies and pearls.",
    "ur": "ایسی خوبصورت جیسے ہیرے اور موتی"
  },
  {
    "id": 117,
    "reference": "55:62",
    "ar": "وَمِن دُونِهِمَا جَنَّتَانِ",
    "en": "And besides these two there shall be two other Gardens.",
    "ur": "اور اُن دو باغوں کے علاوہ دو باغ اور ہوں گے"
  },
  {
    "id": 118,
    "reference": "55:64",
    "ar": "مُدْهَآمَّتَانِ",
    "en": "Two Gardens, dark green and fresh.",
    "ur": "گھنے سرسبز و شاداب باغ"
  },
  {
    "id": 119,
    "reference": "55:66",
    "ar": "فِيهِمَا عَيْنَانِ نَضَّاخَتَانِ",
    "en": "In them will be two gushing springs.",
    "ur": "دونوں باغوں میں دو چشمے فواروں کی طرح ابلتے ہوئے"
  },
  {
    "id": 120,
    "reference": "55:68",
    "ar": "فِيهِمَا فَٰكِهَةٌۭ وَنَخْلٌۭ وَرُمَّانٌۭ",
    "en": "Therein will be fruits and dates and pomegranates.",
    "ur": "اُن میں بکثرت پھل اور کھجوریں اور انار"
  },
  {
    "id": 121,
    "reference": "55:70",
    "ar": "فِيهِنَّ خَيْرَٰتٌ حِسَانٌۭ",
    "en": "In the midst of these will be maidens, good and comely.",
    "ur": "اِن نعمتوں کے درمیان خوب سیرت اور خوبصورت بیویاں"
  },
  {
    "id": 122,
    "reference": "55:72",
    "ar": "حُورٌۭ مَّقْصُورَٰتٌۭ فِى ٱلْخِيَامِ",
    "en": "There shall be maidens sheltered in tents.",
    "ur": "خیموں میں ٹھیرائی ہوئی حوریں"
  },
  {
    "id": 123,
    "reference": "55:74",
    "ar": "لَمْ يَطْمِثْهُنَّ إِنسٌۭ قَبْلَهُمْ وَلَا جَآنٌّۭ",
    "en": "No man or jinn ever touched them before.",
    "ur": "اِن جنتیوں سے پہلے کبھی انسان یا جن نے اُن کو نہ چھوا ہوگا"
  },
  {
    "id": 124,
    "reference": "55:76",
    "ar": "مُتَّكِـِٔينَ عَلَىٰ رَفْرَفٍ خُضْرٍۢ وَعَبْقَرِىٍّ حِسَانٍۢ",
    "en": "They shall be reclining on green cushions and splendid carpets.",
    "ur": "وہ جنتی سبز قالینوں اور نفیس و نادر فرشوں پر تکیے لگا کے بیٹھیں گے"
  },
  {
    "id": 125,
    "reference": "56:12",
    "ar": "فِى جَنَّٰتِ ٱلنَّعِيمِ",
    "en": "in the Gardens of Bliss.",
    "ur": "نعمت بھری جنتوں میں رہیں گے"
  },
  {
    "id": 126,
    "reference": "56:15",
    "ar": "عَلَىٰ سُرُرٍۢ مَّوْضُونَةٍۢ",
    "en": "They (will be seated) on gold-encrusted couches,",
    "ur": "مرصع تختوں پر"
  },
  {
    "id": 127,
    "reference": "56:16",
    "ar": "مُّتَّكِـِٔينَ عَلَيْهَا مُتَقَٰبِلِينَ",
    "en": "reclining on them, arrayed face to face;",
    "ur": "تکیے لگا ئے آمنے سامنے بیٹھیں گے"
  },
  {
    "id": 128,
    "reference": "56:17",
    "ar": "يَطُوفُ عَلَيْهِمْ وِلْدَٰنٌۭ مُّخَلَّدُونَ",
    "en": "immortal youths shall go about them",
    "ur": "اُن کی مجلسوں میں ابدی لڑکے شراب چشمہ جاری سے"
  },
  {
    "id": 129,
    "reference": "56:18",
    "ar": "بِأَكْوَابٍۢ وَأَبَارِيقَ وَكَأْسٍۢ مِّن مَّعِينٍۢ",
    "en": "with goblets and ewers and a cup filled with a drink drawn from a running spring,",
    "ur": "لبریز پیالے کنٹر اور ساغر لیے دوڑتے پھرتے ہونگے"
  },
  {
    "id": 130,
    "reference": "56:19",
    "ar": "لَّا يُصَدَّعُونَ عَنْهَا وَلَا يُنزِفُونَ",
    "en": "a drink by which their minds will not be clouded nor will it cause drunkenness;",
    "ur": "جسے پی کر نہ اُن کا سر چکرائے گا نہ ان کی عقل میں فتور آئے گا"
  },
  {
    "id": 131,
    "reference": "56:20",
    "ar": "وَفَٰكِهَةٍۢ مِّمَّا يَتَخَيَّرُونَ",
    "en": "they will also go about them with the fruits of which they may choose,",
    "ur": "اور وہ اُن کے سامنے طرح طرح کے لذیذ پھل پیش کریں گے جسے چاہیں چن لیں"
  },
  {
    "id": 132,
    "reference": "56:21",
    "ar": "وَلَحْمِ طَيْرٍۢ مِّمَّا يَشْتَهُونَ",
    "en": "and with the flesh of any fowl that they may desire to eat;",
    "ur": "اور پرندوں کے گوشت پیش کریں گے کہ جس پرندے کا چاہیں استعمال کریں"
  },
  {
    "id": 133,
    "reference": "56:22",
    "ar": "وَحُورٌ عِينٌۭ",
    "en": "and there shall be wide-eyed maidens,",
    "ur": "اور ان کے لیے خوبصورت آنکھوں والی حوریں ہونگی"
  },
  {
    "id": 134,
    "reference": "56:23",
    "ar": "كَأَمْثَٰلِ ٱللُّؤْلُؤِ ٱلْمَكْنُونِ",
    "en": "beautiful as pearls hidden in their shells.",
    "ur": "ایسی حسین جیسے چھپا کر رکھے ہوئے موتی"
  },
  {
    "id": 135,
    "reference": "56:25",
    "ar": "لَا يَسْمَعُونَ فِيهَا لَغْوًۭا وَلَا تَأْثِيمًا",
    "en": "There they shall hear no idle talk nor any sinful speech.",
    "ur": "وہاں وہ کوئی بیہودہ کلام یا گناہ کی بات نہ سنیں گے"
  },
  {
    "id": 136,
    "reference": "56:26",
    "ar": "إِلَّا قِيلًۭا سَلَٰمًۭا سَلَٰمًۭا",
    "en": "All talk will be sound and upright.",
    "ur": "جو بات بھی ہوگی ٹھیک ٹھیک ہوگی"
  },
  {
    "id": 137,
    "reference": "56:27",
    "ar": "وَأَصْحَٰبُ ٱلْيَمِينِ مَآ أَصْحَٰبُ ٱلْيَمِينِ",
    "en": "As for the People on the Right, how fortunate shall be the people on the Right!",
    "ur": "اور دائیں بازو والے، دائیں بازو والوں کی خوش نصیبی کا کیا کہنا"
  },
  {
    "id": 138,
    "reference": "56:28",
    "ar": "فِى سِدْرٍۢ مَّخْضُودٍۢ",
    "en": "They shall be in the midst of thornless lote trees,",
    "ur": "وہ بے خار بیریوں"
  },
  {
    "id": 139,
    "reference": "56:29",
    "ar": "وَطَلْحٍۢ مَّنضُودٍۢ",
    "en": "and flower-clad acacias,",
    "ur": "اور تہ بر تہ چڑھے ہوئے کیلوں"
  },
  {
    "id": 140,
    "reference": "56:30",
    "ar": "وَظِلٍّۢ مَّمْدُودٍۢ",
    "en": "and extended shade,",
    "ur": "اور دور تک پھیلی ہوئی چھاؤں"
  },
  {
    "id": 141,
    "reference": "56:31",
    "ar": "وَمَآءٍۢ مَّسْكُوبٍۢ",
    "en": "and gushing water,",
    "ur": "اور ہر دم رواں پانی"
  },
  {
    "id": 142,
    "reference": "56:32",
    "ar": "وَفَٰكِهَةٍۢ كَثِيرَةٍۢ",
    "en": "and abundant fruit,",
    "ur": "اور کبھی ختم نہ ہونے والے"
  },
  {
    "id": 143,
    "reference": "56:33",
    "ar": "لَّا مَقْطُوعَةٍۢ وَلَا مَمْنُوعَةٍۢ",
    "en": "never-ending and unforbidden.",
    "ur": "اور بے روک ٹوک ملنے والے بکثرت پھلوں"
  },
  {
    "id": 144,
    "reference": "56:34",
    "ar": "وَفُرُشٍۢ مَّرْفُوعَةٍ",
    "en": "They shall be on upraised couches,",
    "ur": "اور اونچی نشست گاہوں میں ہوں گے"
  },
  {
    "id": 145,
    "reference": "56:35",
    "ar": "إِنَّآ أَنشَأْنَٰهُنَّ إِنشَآءًۭ",
    "en": "and their spouses We shall have brought them into being afresh,",
    "ur": "ان کی بیویوں کو ہم خاص طور پر نئے سرے سے پیدا کریں گے"
  },
  {
    "id": 146,
    "reference": "56:36",
    "ar": "فَجَعَلْنَٰهُنَّ أَبْكَارًا",
    "en": "and shall have made them virgins,",
    "ur": "اور انہیں با کرہ بنا دیں گے"
  },
  {
    "id": 147,
    "reference": "56:37",
    "ar": "عُرُبًا أَتْرَابًۭا",
    "en": "intensely loving and of matching age.",
    "ur": "اپنے شوہروں کی عاشق اور عمر میں ہم سن"
  },
  {
    "id": 148,
    "reference": "57:12",
    "ar": "يَوْمَ تَرَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ يَسْعَىٰ نُورُهُم بَيْنَ أَيْدِيهِمْ وَبِأَيْمَٰنِهِم بُشْرَىٰكُمُ ٱلْيَوْمَ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "en": "On that Day you will see believing men and women that their light will be running before them and on their right hands. (They will be told): “A good tiding to you today.” There shall be Gardens beneath which rivers flow; therein they shall abide. That indeed is the great triumph.",
    "ur": "اُس دن جبکہ تم مومن مردوں اور عورتوں کو دیکھو گے کہ ان کا نور اُن کے آگے آگے اور ان کے دائیں جانب دوڑ رہا ہوگا (ان سے کہا جائے گا کہ) \"آج بشارت ہے تمہارے لیے\" جنتیں ہونگی جن کے نیچے نہریں بہہ رہی ہونگی، جن میں وہ ہمیشہ رہیں گے یہی ہے بڑی کامیابی"
  },
  {
    "id": 149,
    "reference": "57:21",
    "ar": "سَابِقُوٓا۟ إِلَىٰ مَغْفِرَةٍۢ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ ٱلسَّمَآءِ وَٱلْأَرْضِ أُعِدَّتْ لِلَّذِينَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ ۚ ذَٰلِكَ فَضْلُ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "en": "So vie with one another in seeking to attain your Lord's forgiveness and a Garden whose width is as the width of the heaven and the earth, one which has been prepared for those who believe in Allah and His Messengers. That is Allah's bounty which He bestows upon those whom He pleases. Allah is the Lord of abounding bounty.",
    "ur": "دوڑو اور ایک دوسرے سے آگے بڑھنے کی کوشش کرو اپنے رب کی مغفرت اور اُس کی جنت کی طرف جس کی وسعت آسمان و زمین جیسی ہے، جو مہیا کی گئی ہے اُن لوگوں کے لیے جو اللہ اور اُس کے رسولوں پر ایمان لائے ہوں یہ اللہ کا فضل ہے، جسے چاہتا ہے عطا فرماتا ہے، اور اللہ بڑے فضل والا ہے"
  },
  {
    "id": 150,
    "reference": "66:8",
    "ar": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ تُوبُوٓا۟ إِلَى ٱللَّهِ تَوْبَةًۭ نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّـَٔاتِكُمْ وَيُدْخِلَكُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ يَوْمَ لَا يُخْزِى ٱللَّهُ ٱلنَّبِىَّ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَٰنِهِمْ يَقُولُونَ رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "en": "Believers, turn to Allah in sincere repentance; maybe your Lord will expunge your evil deeds and admit you to the Gardens beneath which rivers flow. This will be on the Day when Allah will not disgrace the Prophet and those who have embraced faith and are with him; their light will be running before them and on their right hands, and they will say: “Our Lord, perfect for us our light and forgive us. Surely You have power over everything.”",
    "ur": "اے لوگو جو ایمان لائے ہو، اللہ سے توبہ کرو، خالص توبہ، بعید نہیں کہ اللہ تمہاری برائیاں تم سے دور کر دے اور تمہیں ایسی جنتوں میں داخل فرما دے جن کے نیچے نہریں بہہ رہی ہوں گی یہ وہ دن ہوگا جب اللہ اپنے نبی کو اور اُن لوگوں جو اس کے ساتھ ایمان لائے ہیں رسوا نہ کرے گا اُن کا نور اُن کے آگے آگے اور ان کے دائیں جانب دوڑ رہا ہوگا اور وہ کہہ رہے ہوں گے کہ اے ہمارے رب، ہمارا نور ہمارے لیے مکمل کر دے اور ہم سے درگزر فرما، تو ہر چیز پر قدرت رکھتا ہے"
  },
  {
    "id": 151,
    "reference": "69:21",
    "ar": "فَهُوَ فِى عِيشَةٍۢ رَّاضِيَةٍۢ",
    "en": "Then he shall find himself in a life of bliss;",
    "ur": "پس وہ دل پسند عیش میں ہوگا"
  },
  {
    "id": 152,
    "reference": "69:22",
    "ar": "فِى جَنَّةٍ عَالِيَةٍۢ",
    "en": "in a lofty Garden",
    "ur": "عالی مقام جنت میں"
  },
  {
    "id": 153,
    "reference": "69:23",
    "ar": "قُطُوفُهَا دَانِيَةٌۭ",
    "en": "the clusters of whose fruit will be hanging low to be within reach (of the inmates of Paradise).",
    "ur": "جس کے پھلوں کے گچھے جھکے پڑ رہے ہوں گے"
  },
  {
    "id": 154,
    "reference": "69:24",
    "ar": "كُلُوا۟ وَٱشْرَبُوا۟ هَنِيٓـًٔۢا بِمَآ أَسْلَفْتُمْ فِى ٱلْأَيَّامِ ٱلْخَالِيَةِ",
    "en": "(They will be told): “Eat and drink with good cheer as a reward for the good deeds you did in the days that have passed by.”",
    "ur": "(ایسے لوگوں سے کہا جائے گا) مزے سے کھاؤ اور پیو اپنے اُن اعمال کے بدلے جو تم نے گزرے ہوئے دنوں میں کیے ہیں"
  },
  {
    "id": 155,
    "reference": "76:12",
    "ar": "وَجَزَىٰهُم بِمَا صَبَرُوا۟ جَنَّةًۭ وَحَرِيرًۭا",
    "en": "and will reward them for their steadfastness with Paradise and robes of silk.",
    "ur": "اور اُن کے صبر کے بدلے میں اُنہیں جنت اور ریشمی لباس عطا کریگا"
  },
  {
    "id": 156,
    "reference": "76:13",
    "ar": "مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلْأَرَآئِكِ ۖ لَا يَرَوْنَ فِيهَا شَمْسًۭا وَلَا زَمْهَرِيرًۭا",
    "en": "There they will recline on elevated couches and will be subjected neither to the burning heat of the sun nor to bitter cold.",
    "ur": "وہاں وہ اونچی مسندوں پر تکیے لگائے بیٹھے ہونگے نہ اُنہیں دھوپ کی گرمی ستائے گی نہ جاڑے کی ٹھر"
  },
  {
    "id": 157,
    "reference": "76:14",
    "ar": "وَدَانِيَةً عَلَيْهِمْ ظِلَٰلُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًۭا",
    "en": "The shades of Paradise will bend over them, and its fruits will be brought within their easy reach;",
    "ur": "جنت کی چھاؤں ان پر جھکی ہوئی سایہ کر رہی ہوگی، اور اُس کے پھل ہر وقت ان کے بس میں ہوں گے (کہ جس طرح چاہیں انہیں توڑ لیں)"
  },
  {
    "id": 158,
    "reference": "76:15",
    "ar": "وَيُطَافُ عَلَيْهِم بِـَٔانِيَةٍۢ مِّن فِضَّةٍۢ وَأَكْوَابٍۢ كَانَتْ قَوَارِيرَا۠",
    "en": "and there shall be passed around them vessels of silver and goblets of crystal,",
    "ur": "اُن کے آگے چاندی کے برتن اور شیشے کے پیالے گردش کرائے جا رہے ہونگے"
  },
  {
    "id": 159,
    "reference": "76:16",
    "ar": "قَوَارِيرَا۟ مِن فِضَّةٍۢ قَدَّرُوهَا تَقْدِيرًۭا",
    "en": "goblets bright as crystal but made of silver, filled to exact measure.",
    "ur": "شیشے بھی وہ جو چاندی کی قسم کے ہونگے، اور ان کو (منتظمین جنت نے) ٹھیک اندازے کے مطابق بھرا ہوگا"
  },
  {
    "id": 160,
    "reference": "76:17",
    "ar": "وَيُسْقَوْنَ فِيهَا كَأْسًۭا كَانَ مِزَاجُهَا زَنجَبِيلًا",
    "en": "Therein they shall be served a cup flavoured with ginger,",
    "ur": "ان کو وہاں ایسی شراب کے جام پلائے جائیں گے جس میں سونٹھ کی آمیزش ہوگی"
  },
  {
    "id": 161,
    "reference": "76:18",
    "ar": "عَيْنًۭا فِيهَا تُسَمَّىٰ سَلْسَبِيلًۭا",
    "en": "drawn from a spring (in Paradise) called Salsabil.",
    "ur": "یہ جنت کا ایک چشمہ ہوگا جسے سلسبیل کہا جاتا ہے"
  },
  {
    "id": 162,
    "reference": "76:19",
    "ar": "۞ وَيَطُوفُ عَلَيْهِمْ وِلْدَٰنٌۭ مُّخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًۭا مَّنثُورًۭا",
    "en": "There boys of everlasting youth shall go about attending them: when you see them, you would think that they are scattered pearls.",
    "ur": "ان کی خدمت کے لیے ایسے لڑکے دوڑتے پھر رہے ہوں گے جو ہمیشہ لڑکے ہی رہیں گے تم انہیں دیکھو تو سمجھو کہ موتی ہیں جو بکھیر دیے گئے ہیں"
  },
  {
    "id": 163,
    "reference": "76:20",
    "ar": "وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًۭا وَمُلْكًۭا كَبِيرًا",
    "en": "Whitherto you look around, you will see an abundance of bliss and the glories of a great kingdom.",
    "ur": "وہاں جدھر بھی تم نگاہ ڈالو گے نعمتیں ہی نعمتیں اور ایک بڑی سلطنت کا سر و سامان تمہیں نظر آئے گا"
  },
  {
    "id": 164,
    "reference": "76:21",
    "ar": "عَٰلِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌۭ وَإِسْتَبْرَقٌۭ ۖ وَحُلُّوٓا۟ أَسَاوِرَ مِن فِضَّةٍۢ وَسَقَىٰهُمْ رَبُّهُمْ شَرَابًۭا طَهُورًا",
    "en": "They [i.e., the virtuous] shall be attired in garments of fine green silk and rich brocade and will be adorned with bracelets of silver. Their Lord will give them a pure wine to drink.",
    "ur": "اُن کے اوپر باریک ریشم کے سبز لباس اور اطلس و دیبا کے کپڑے ہوں گے، ان کو چاندی کے کنگن پہنا ئے جائیں گے، اور ان کا رب ان کو نہایت پاکیزہ شراب پلائے گا"
  },
  {
    "id": 165,
    "reference": "78:31",
    "ar": "إِنَّ لِلْمُتَّقِينَ مَفَازًا",
    "en": "Surely the state of triumph awaits the God-fearing:",
    "ur": "یقیناً متقیوں کے لیے کامرانی کا ایک مقام ہے"
  },
  {
    "id": 166,
    "reference": "78:32",
    "ar": "حَدَآئِقَ وَأَعْنَٰبًۭا",
    "en": "gardens and vineyards,",
    "ur": "باغ اور انگور"
  },
  {
    "id": 167,
    "reference": "78:33",
    "ar": "وَكَوَاعِبَ أَتْرَابًۭا",
    "en": "and youthful maidens of like age,",
    "ur": "اور نوخیر ہم سن لڑکیاں"
  },
  {
    "id": 168,
    "reference": "78:34",
    "ar": "وَكَأْسًۭا دِهَاقًۭا",
    "en": "and an overflowing cup.",
    "ur": "اور چھلکتے ہوئے جام"
  },
  {
    "id": 169,
    "reference": "78:35",
    "ar": "لَّا يَسْمَعُونَ فِيهَا لَغْوًۭا وَلَا كِذَّٰبًۭا",
    "en": "Therein they shall hear no idle talk, nor any falsehood;",
    "ur": "وہاں کوئی لغو اور جھوٹی بات وہ نہ سنیں گے"
  },
  {
    "id": 170,
    "reference": "78:36",
    "ar": "جَزَآءًۭ مِّن رَّبِّكَ عَطَآءً حِسَابًۭا",
    "en": "a recompense from your Lord and an ample reward",
    "ur": "جزا اور کافی انعام تمہارے رب کی طرف سے"
  },
  {
    "id": 171,
    "reference": "83:23",
    "ar": "عَلَى ٱلْأَرَآئِكِ يَنظُرُونَ",
    "en": "resting on couches, looking around.",
    "ur": "اونچی مسندوں پر بیٹھے نظارے کر رہے ہوں گے"
  },
  {
    "id": 172,
    "reference": "83:24",
    "ar": "تَعْرِفُ فِى وُجُوهِهِمْ نَضْرَةَ ٱلنَّعِيمِ",
    "en": "You shall see upon their faces the glow of bliss.",
    "ur": "ان کے چہروں پر تم خوشحالی کی رونق محسوس کرو گے"
  },
  {
    "id": 173,
    "reference": "83:25",
    "ar": "يُسْقَوْنَ مِن رَّحِيقٍۢ مَّخْتُومٍ",
    "en": "They will be served a drink of the finest sealed wine,",
    "ur": "ان کو نفیس ترین سر بند شراب پلائی جائے گی جس پر مشک کی مہر لگی ہوگی"
  },
  {
    "id": 174,
    "reference": "83:26",
    "ar": "خِتَٰمُهُۥ مِسْكٌۭ ۚ وَفِى ذَٰلِكَ فَلْيَتَنَافَسِ ٱلْمُتَنَٰفِسُونَ",
    "en": "whose seal is musk – so let all aspirants aspire after that –",
    "ur": "جو لوگ دوسروں پر بازی لے جانا چاہتے ہوں وہ اِس چیز کو حاصل کرنے میں بازی لے جانے کی کوشش کریں"
  },
  {
    "id": 175,
    "reference": "83:27",
    "ar": "وَمِزَاجُهُۥ مِن تَسْنِيمٍ",
    "en": "a wine whose mixture is Tasnim,",
    "ur": "اُس شراب میں تسنیم کی آمیزش ہوگی"
  },
  {
    "id": 176,
    "reference": "83:28",
    "ar": "عَيْنًۭا يَشْرَبُ بِهَا ٱلْمُقَرَّبُونَ",
    "en": "a fountain at which the chosen ones shall drink.",
    "ur": "یہ ایک چشمہ ہے جس کے پانی کے ساتھ مقرب لوگ شراب پئیں گے"
  },
  {
    "id": 177,
    "reference": "83:34",
    "ar": "فَٱلْيَوْمَ ٱلَّذِينَ ءَامَنُوا۟ مِنَ ٱلْكُفَّارِ يَضْحَكُونَ",
    "en": "But today the believers are laughing at the unbelievers;",
    "ur": "آج ایمان لانے والے کفار پر ہنس رہے ہیں"
  },
  {
    "id": 178,
    "reference": "83:35",
    "ar": "عَلَى ٱلْأَرَآئِكِ يَنظُرُونَ",
    "en": "seated upon their couches, they are looking around.",
    "ur": "مسندوں پر بیٹھے ہوئے ان کا حال دیکھ رہے ہیں"
  },
  {
    "id": 179,
    "reference": "85:11",
    "ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُمْ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْكَبِيرُ",
    "en": "As for those who believed and acted righteously, theirs shall be Gardens beneath which rivers flow. That is the great triumph.",
    "ur": "جو لوگ ایمان لائے اور جنہوں نے نیک عمل کیے، یقیناً اُن کے لیے جنت کے باغ ہیں جن کے نیچے نہریں بہتی ہوں گی، یہ ہے بڑی کامیابی"
  },
  {
    "id": 180,
    "reference": "88:10",
    "ar": "فِى جَنَّةٍ عَالِيَةٍۢ",
    "en": "They will be in a lofty Garden",
    "ur": "عالی مقام جنت میں ہوں گے"
  },
  {
    "id": 181,
    "reference": "88:11",
    "ar": "لَّا تَسْمَعُ فِيهَا لَٰغِيَةًۭ",
    "en": "wherein they shall hear no vain talk.",
    "ur": "کوئی بیہودہ بات وہاں نہ سنیں گے"
  },
  {
    "id": 182,
    "reference": "88:12",
    "ar": "فِيهَا عَيْنٌۭ جَارِيَةٌۭ",
    "en": "In it there shall be a flowing spring,",
    "ur": "اُس میں چشمے رواں ہونگے"
  },
  {
    "id": 183,
    "reference": "88:13",
    "ar": "فِيهَا سُرُرٌۭ مَّرْفُوعَةٌۭ",
    "en": "and couches raised high,",
    "ur": "اُس کے اندر اونچی مسندیں ہوں گی"
  },
  {
    "id": 184,
    "reference": "88:14",
    "ar": "وَأَكْوَابٌۭ مَّوْضُوعَةٌۭ",
    "en": "and goblets laid out,",
    "ur": "ساغر رکھے ہوئے ہوں گے"
  },
  {
    "id": 185,
    "reference": "88:15",
    "ar": "وَنَمَارِقُ مَصْفُوفَةٌۭ",
    "en": "and cushions arrayed in rows,",
    "ur": "گاؤ تکیوں کی قطاریں لگی ہوں گی"
  },
  {
    "id": 186,
    "reference": "88:16",
    "ar": "وَزَرَابِىُّ مَبْثُوثَةٌ",
    "en": "and rich carpets levelled out.",
    "ur": "اور نفیس فرش بچھے ہوئے ہوں گے"
  },
  {
    "id": 187,
    "reference": "98:8",
    "ar": "جَزَآؤُهُمْ عِندَ رَبِّهِمْ جَنَّٰتُ عَدْنٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًۭا ۖ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِىَ رَبَّهُۥ",
    "en": "Their recompense lies with their Lord: Gardens of eternity beneath which rivers flow; therein they shall dwell, forever and ever. Allah is well-pleased with them, and they are well-pleased with Him. All this is for him who fears his Lord.",
    "ur": "اُن کی جزا اُن کے رب کے ہاں دائمی قیام کی جنتیں ہیں جن کے نیچے نہریں بہ رہی ہوں گی، وہ ان میں ہمیشہ ہمیشہ رہیں گے اللہ ان سے راضی ہوا اور وہ اللہ سے راضی ہوئے یہ کچھ ہے اُس شخص کے لیے جس نے اپنے رب کا خوف کیا ہو"
  }
]