[
  {
    "id": 1,
    "reference": "2:184",
    "ar": "أَيَّامًۭا مَّعْدُودَٰتٍۢ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَىٰ سَفَرٍۢ فَعِدَّةٌۭ مِّنْ أَيَّامٍ أُخَرَ ۚ وَعَلَى ٱلَّذِينَ يُطِيقُونَهُۥ فِدْيَةٌۭ طَعَامُ مِسْكِينٍۢ ۖ فَمَن تَطَوَّعَ خَيْرًۭا فَهُوَ خَيْرٌۭ لَّهُۥ ۚ وَأَن تَصُومُوا۟ خَيْرٌۭ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
    "en": "The Fast is to be observed for a fixed number of days. If, however, anyone of you be sick or on a journey, he should fast the same number of other days. As for those who can fast (but do not), the expiation of this shall be the feeding of one needy person for one fast day, and whoso does more than this with a willing heart does it for his own good. But if you understand the thing, it is better for you to observe the Fast.",
    "ur": "چند مقرر دنوں کے روزے ہیں اگر تم میں سے کوئی بیمار ہو، یا سفر پر ہو تو دوسرے دنوں میں اتنی ہی تعداد پوری کر لے اور جو لوگ روزہ رکھنے کی قدرت رکھتے ہوں (پھر نہ رکھیں) تو وہ فدیہ دیں ایک روزے کا فدیہ ایک مسکین کو کھانا کھلانا ہے اور جو اپنی خوشی سے کچھ زیادہ بھلائی کرے تو یہ اسی کے لیے بہتر ہے لیکن اگر تم سمجھو، تو تمہارے حق میں اچھا یہی ہے کہ روزہ رکھو"
  },
  {
    "id": 2,
    "reference": "2:183",
    "ar": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُتِبَ عَلَيْكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
    "en": "O Believers, the Fast has been made obligatory on you just as it was prescribed for the followers of the Prophets before you. It is expected that this will produce piety in you.",
    "ur": "اے لوگو جو ایمان لائے ہو، تم پر روزے فرض کر دیے گئے، جس طرح تم سے پہلے انبیا کے پیروؤں پر فرض کیے گئے تھے اس سے توقع ہے کہ تم میں تقویٰ کی صفت پیدا ہوگی"
  },
  {
    "id": 3,
    "reference": "2:185",
    "ar": "شَهْرُ رَمَضَانَ ٱلَّذِىٓ أُنزِلَ فِيهِ ٱلْقُرْءَانُ هُدًۭى لِّلنَّاسِ وَبَيِّنَٰتٍۢ مِّنَ ٱلْهُدَىٰ وَٱلْفُرْقَانِ ۚ فَمَن شَهِدَ مِنكُمُ ٱلشَّهْرَ فَلْيَصُمْهُ ۖ وَمَن كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍۢ فَعِدَّةٌۭ مِّنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ ٱللَّهُ بِكُمُ ٱلْيُسْرَ وَلَا يُرِيدُ بِكُمُ ٱلْعُسْرَ وَلِتُكْمِلُوا۟ ٱلْعِدَّةَ وَلِتُكَبِّرُوا۟ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ",
    "en": "Ramadan is the month in which the Qur'an was sent down: this Book is a perfect guidance for mankind and consists of clear teachings which show the right way and are a criterion of Truth and falsehood. Therefore from now on whoever witnesses it, it is obligatory on hire to fast the whole month, but if one be ill or on a journey, he should make up for the same number by fasting on other days. Allah desires to show leniency to you and does not desire to show any hardship. \"therefore this method is being shown to you so that you may complete the number of Fast days and glorify Allah for the Guidance He has shown to you and be grateful to Him.",
    "ur": "رمضان وہ مہینہ ہے، جس میں قرآن نازل کیا گیا جو انسانوں کے لیے سراسر ہدایت ہے اور ایسی واضح تعلیمات پر مشتمل ہے، جو راہ راست دکھانے والی اور حق و باطل کا فرق کھول کر رکھ دینے والی ہیں لہٰذا اب سے جو شخص اس مہینے کو پائے، اُس کو لازم ہے کہ اِس پورے مہینے کے روزے رکھے اور جو کوئی مریض ہو یا سفر پر ہو، تو وہ دوسرے دنوں میں روزوں کی تعداد پوری کرے اللہ تمہارے ساتھ نرمی کرنا چاہتا ہے، سختی کرنا نہیں چاہتا اس لیے یہ طریقہ تمہیں بتایا جا رہا ہے تاکہ تم روزوں کی تعداد پوری کرسکو اور جس ہدایت سے اللہ نے تمہیں سرفراز کیا ہے، اُس پر اللہ کی کبریا ئی کا اظہار و اعتراف کرو اور شکر گزار بنو"
  },
  {
    "id": 4,
    "reference": "2:186",
    "ar": "وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ",
    "en": "And if My servants ask you, O Prophet. concerning Me, tell them that I am quite near to them. I hear and answer the prayer of the suppliant, when he calls to Me. So let them respond to My call and believe in Me. Convey this to them, O Prophet; perhaps they may be guided aright.",
    "ur": "اور اے نبیؐ، میرے بندے اگر تم سے میرے متعلق پوچھیں، تو اُنہیں بتا دو کہ میں ان سے قریب ہی ہوں پکارنے والا جب مجھے پکارتا ہے، میں اُس کی پکار سنتا اور جواب دیتا ہوں لہٰذا انہیں چاہیے کہ میری دعوت پر لبیک کہیں اور مجھ پر ایمان لائیں یہ بات تم اُنہیں سنا دو، شاید کہ وہ راہ راست پالیں"
  }
]