[
  {
    "id": 1,
    "reference": "2:133",
    "ar": "أَمْ كُنتُمْ شُهَدَآءَ إِذْ حَضَرَ يَعْقُوبَ ٱلْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِنۢ بَعْدِى قَالُوا۟ نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ ءَابَآئِكَ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ إِلَٰهًۭا وَٰحِدًۭا وَنَحْنُ لَهُۥ مُسْلِمُونَ",
    "en": "Were you present at the time when Jacob was on the point of death? He asked his children, \"Whom will you worship after me?\" They all answered, \"We will worship the same One Allah Whom you, your forefathers Abraham. Ismail and Isaac acknowledged as their Allah and to Him we all surrender as Muslims.\"",
    "ur": "پھر کیا تم اس وقت موجود تھے، جب یعقوبؑ اس دنیا سے رخصت ہو رہا تھا؟اس نے مرتے وقت اپنے بچوں سے پوچھا: \"بچو! میرے بعد تم کس کی بندگی کرو گے؟\" ان سب نے جواب دیا: \"ہم اسی ایک خدا کی بندگی کریں گے جسے آپ نے اور آپ کے بزرگوں ابراہیمؑ، اسماعیلؑ اور اسحاقؑ نے خدا مانا ہے اور ہم اُسی کے مسلم ہیں\""
  },
  {
    "id": 2,
    "reference": "2:163",
    "ar": "وَإِلَٰهُكُمْ إِلَٰهٌۭ وَٰحِدٌۭ ۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحْمَٰنُ ٱلرَّحِيمُ",
    "en": "Your Deity is Allah alone: there is no deity save the All-Beneficent and All-Merciful Allah.",
    "ur": "تمہارا خدا ایک ہی خدا ہے، اُس رحمان اور رحیم کے سوا کوئی اور خدا نہیں ہے"
  },
  {
    "id": 3,
    "reference": "3:2",
    "ar": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ",
    "en": "Allah, the Ever-Living, the Self-Subsisting, Who sustains the entire order of the universe - there is no God but He.",
    "ur": "اللہ، وہ زندہ جاوید ہستی، جو نظام کائنات کو سنبھالے ہوئے ہے، حقیقت میں اُس کے سوا کوئی خدا نہیں ہے"
  },
  {
    "id": 4,
    "reference": "3:6",
    "ar": "هُوَ ٱلَّذِى يُصَوِّرُكُمْ فِى ٱلْأَرْحَامِ كَيْفَ يَشَآءُ ۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "en": "It is He Who fashions you in the wombs as He wills. There is no God but He; the All-Mighty, the All-Wise.",
    "ur": "وہی تو ہے جو تمہاری ماؤں کے پیٹ میں تمہاری صورتیں، جیسی چاہتا ہے، بناتا ہے اُس زبردست حکمت والے کے سوا کوئی اور خدا نہیں ہے"
  },
  {
    "id": 5,
    "reference": "3:18",
    "ar": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلْمَلَٰٓئِكَةُ وَأُو۟لُوا۟ ٱلْعِلْمِ قَآئِمًۢا بِٱلْقِسْطِ ۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "en": "Allah Himself bears witness that there is no God but He; and likewise do the angels and the men possessed of knowledge bear witness in truth and justice that there is no God but He, the All-Mighty, the All-Wise.",
    "ur": "اللہ نے خود شہادت دی ہے کہ اس کے سوا کوئی خدا نہیں ہے، او ر (یہی شہادت) فرشتوں اور سب اہل علم نے بھی دی ہے وہ انصاف پر قائم ہے اُس زبردست حکیم کے سوا فی الواقع کوئی خدا نہیں ہے"
  },
  {
    "id": 6,
    "reference": "3:62",
    "ar": "إِنَّ هَٰذَا لَهُوَ ٱلْقَصَصُ ٱلْحَقُّ ۚ وَمَا مِنْ إِلَٰهٍ إِلَّا ٱللَّهُ ۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "en": "This is the true story. There is no God but Allah, and assuredly Allah is All-Mighty, All-Wise.",
    "ur": "یہ بالکل صحیح واقعات ہیں، اور حقیقت یہ ہے کہ اللہ کے سوا کوئی خداوند نہیں ہے، اور وہ اللہ ہی کی ہستی ہے جس کی طاقت سب سے بالا اور جس کی حکمت نظام عالم میں کار فرما ہے"
  },
  {
    "id": 7,
    "reference": "3:79",
    "ar": "مَا كَانَ لِبَشَرٍ أَن يُؤْتِيَهُ ٱللَّهُ ٱلْكِتَٰبَ وَٱلْحُكْمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا۟ عِبَادًۭا لِّى مِن دُونِ ٱللَّهِ وَلَٰكِن كُونُوا۟ رَبَّٰنِيِّۦنَ بِمَا كُنتُمْ تُعَلِّمُونَ ٱلْكِتَٰبَ وَبِمَا كُنتُمْ تَدْرُسُونَ",
    "en": "It does not befit a man that Allah should grant him His Book and sound judgement and prophet-hood, and thereafter he should say to men: 'Become servants to me apart from Allah.' He would rather say: 'Become dedicated men of Allah, in accord with the dictates of the Book you have been teaching and studying.'",
    "ur": "کسی انسان کا یہ کام نہیں ہے کہ اللہ تو اس کو کتاب اور حکم اور نبوت عطا فرمائے اور وہ لوگوں سے کہے کہ اللہ کے بجائے تم میرے بندے بن جاؤ وہ تو یہی کہے گا کہ سچے ربانی بنو جیسا کہ اس کتاب کی تعلیم کا تقاضا ہے جسے تم پڑھتے اور پڑھاتے ہو"
  },
  {
    "id": 8,
    "reference": "4:48",
    "ar": "إِنَّ ٱللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِۦ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُ ۚ وَمَن يُشْرِكْ بِٱللَّهِ فَقَدِ ٱفْتَرَىٰٓ إِثْمًا عَظِيمًا",
    "en": "Surely Allah does not forgive that a partner be ascribed to Him, although He forgives any other sins for whomever He wills. He who associates anyone with Allah in His divinity has indeed forged a mighty lie and committed an awesome sin.",
    "ur": "اللہ بس شرک ہی کو معاف نہیں کرتا، اِس کے ماسوا دوسرے جس قدر گناہ ہیں وہ جس کے لیے چاہتا ہے معاف کر دیتا ہے اللہ کے ساتھ جس نے کسی اور کو شریک ٹھیرایا اُس نے تو بہت ہی بڑا جھوٹ تصنیف کیا اور بڑے سخت گناہ کی بات کی"
  },
  {
    "id": 9,
    "reference": "4:116",
    "ar": "إِنَّ ٱللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِۦ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُ ۚ وَمَن يُشْرِكْ بِٱللَّهِ فَقَدْ ضَلَّ ضَلَٰلًۢا بَعِيدًا",
    "en": "Truly it is only associating others with Allah in His divinity that Allah does not forgive, and forgives anything besides that to whomsoever He wills. Whoever associates others with Allah in His divinity has indeed strayed far away.",
    "ur": "اللہ کے ہاں بس شرک ہی کی بخشش نہیں ہے، اس کے سوا اور سب کچھ معاف ہوسکتا ہے جسے وہ معاف کرنا چاہے جس نے اللہ کے ساتھ کسی کو شریک ٹھیرایا وہ تو گمراہی میں بہت دور نکل گیا"
  },
  {
    "id": 10,
    "reference": "5:72",
    "ar": "لَقَدْ كَفَرَ ٱلَّذِينَ قَالُوٓا۟ إِنَّ ٱللَّهَ هُوَ ٱلْمَسِيحُ ٱبْنُ مَرْيَمَ ۖ وَقَالَ ٱلْمَسِيحُ يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱعْبُدُوا۟ ٱللَّهَ رَبِّى وَرَبَّكُمْ ۖ إِنَّهُۥ مَن يُشْرِكْ بِٱللَّهِ فَقَدْ حَرَّمَ ٱللَّهُ عَلَيْهِ ٱلْجَنَّةَ وَمَأْوَىٰهُ ٱلنَّارُ ۖ وَمَا لِلظَّٰلِمِينَ مِنْ أَنصَارٍۢ",
    "en": "And surely they disbelieved when they said: 'Christ, the son of Mary, is indeed God'; whereas Christ had said: 'Children of Israel! Serve Allah, Who is your Lord and my Lord.' Allah has forbidden Paradise to those who associate anything with Him in His divinity and their refuge shall be the Fire. No one will be able to help such wrong-doers.",
    "ur": "یقیناً کفر کیا اُن لوگوں نے جنہوں نے کہا کہ اللہ مسیح ابن مریم ہی ہے حالانکہ مسیح نے کہا تھا کہ \"اے بنی اسرائیل! اللہ کی بندگی کرو جو میرا رب بھی ہے اور تمہارا رب بھی\" جس نے اللہ کے ساتھ کسی کو شریک ٹھیرایا اُس پر اللہ نے جنت حرام کر دی اور اُس کا ٹھکانا جہنم ہے اور ایسے ظالموں کا کوئی مدد گار نہیں"
  },
  {
    "id": 11,
    "reference": "5:73",
    "ar": "لَّقَدْ كَفَرَ ٱلَّذِينَ قَالُوٓا۟ إِنَّ ٱللَّهَ ثَالِثُ ثَلَٰثَةٍۢ ۘ وَمَا مِنْ إِلَٰهٍ إِلَّآ إِلَٰهٌۭ وَٰحِدٌۭ ۚ وَإِن لَّمْ يَنتَهُوا۟ عَمَّا يَقُولُونَ لَيَمَسَّنَّ ٱلَّذِينَ كَفَرُوا۟ مِنْهُمْ عَذَابٌ أَلِيمٌ",
    "en": "Those who said: 'Allah is one of the Three', certainly they disbelieved, for there is no god save the One God. And if they do not give up this claim, all who have disbelieved among them shall be subjected to painful chastisement.",
    "ur": "یقیناً کفر کیا اُن لوگوں نے جنہوں نے کہا کہ اللہ تین میں کا ایک ہے، حالانکہ ایک خدا کے سوا کوئی خدا نہیں ہے اگر یہ لوگ اپنی اِن باتوں سے باز نہ آئے تو ان میں سے جس جس نے کفر کیا ہے اُس کو درد ناک سزا دی جائے گی"
  },
  {
    "id": 12,
    "reference": "6:14",
    "ar": "قُلْ أَغَيْرَ ٱللَّهِ أَتَّخِذُ وَلِيًّۭا فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَهُوَ يُطْعِمُ وَلَا يُطْعَمُ ۗ قُلْ إِنِّىٓ أُمِرْتُ أَنْ أَكُونَ أَوَّلَ مَنْ أَسْلَمَ ۖ وَلَا تَكُونَنَّ مِنَ ٱلْمُشْرِكِينَ",
    "en": "Say: 'Shall I take for my guardian anyone other than Allah - the Originator of the heavens and earth; He Who feeds and Himself is not fed?' Say: 'Surely I have been commanded to be the first among those who submit (to Allah) and not to be one of those who associate others with Allah in His divinity (even though others may do so).'",
    "ur": "کہو، اللہ کو چھوڑ کر کیا میں کسی اور کو اپنا سر پرست بنا لوں؟ اُس خدا کو چھوڑ کر جو زمین و آسمان کا خالق ہے اور جو روزی دیتا ہے روزی لیتا نہیں ہے؟ کہو، مجھے تو یہی حکم دیا گیا ہے کہ سب سے پہلے میں اُس کے آگے سر تسلیم خم کروں (اور تاکید کی گئی ہے کہ کوئی شرک کرتا ہے تو کرے) تو بہرحال مشرکوں میں شامل نہ ہو"
  },
  {
    "id": 13,
    "reference": "6:19",
    "ar": "قُلْ أَىُّ شَىْءٍ أَكْبَرُ شَهَٰدَةًۭ ۖ قُلِ ٱللَّهُ ۖ شَهِيدٌۢ بَيْنِى وَبَيْنَكُمْ ۚ وَأُوحِىَ إِلَىَّ هَٰذَا ٱلْقُرْءَانُ لِأُنذِرَكُم بِهِۦ وَمَنۢ بَلَغَ ۚ أَئِنَّكُمْ لَتَشْهَدُونَ أَنَّ مَعَ ٱللَّهِ ءَالِهَةً أُخْرَىٰ ۚ قُل لَّآ أَشْهَدُ ۚ قُلْ إِنَّمَا هُوَ إِلَٰهٌۭ وَٰحِدٌۭ وَإِنَّنِى بَرِىٓءٌۭ مِّمَّا تُشْرِكُونَ",
    "en": "Ask them: 'Whose testimony is the greatest?' Say: 'Allah is the witness between me and you; and this Qur'an was revealed to me that I should warn you thereby and also whomsoever it may reach.' Do you indeed testify that there are other gods with Allah? Say: 'I shall never testify such a thing.' Say: 'He is the One God and I am altogether averse to all that you associate with Him in His divinity.'",
    "ur": "ان سے پوچھو، کس کی گواہی سب سے بڑھ کر ہے؟کہو، میرے اور تمہارے درمیان اللہ گواہ ہے، اور یہ قرآن میری طرف بذریعہ وحی بھیجا گیا ہے تاکہ تمہیں اور جس جس کو یہ پہنچے، سب کو متنبہ کر دوں کیا واقعی تم لوگ یہ شہادت دے سکتے ہو کہ اللہ کے ساتھ دوسرے خدا بھی ہیں؟ کہو، میں تو اس کی شہادت ہرگز نہیں دے سکتا کہو، خدا تو وہی ایک ہے اور میں اس شرک سے قطعی بیزار ہوں جس میں تم مبتلا ہو"
  },
  {
    "id": 14,
    "reference": "6:23",
    "ar": "ثُمَّ لَمْ تَكُن فِتْنَتُهُمْ إِلَّآ أَن قَالُوا۟ وَٱللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ",
    "en": "Then they will be able to play no mischief but will say (falsely): 'By Allah, our Lord, we associated none (with You in Your divinity).'",
    "ur": "تو وہ اِس کے سوا کوئی فتنہ نہ اٹھا سکیں گے کہ (یہ جھوٹا بیان دیں کہ) اے ہمارے آقا! تیری قسم ہم ہرگز مشر ک نہ تھے"
  },
  {
    "id": 15,
    "reference": "6:64",
    "ar": "قُلِ ٱللَّهُ يُنَجِّيكُم مِّنْهَا وَمِن كُلِّ كَرْبٍۢ ثُمَّ أَنتُمْ تُشْرِكُونَ",
    "en": "Say: \"It is Allah alone Who delivers you from this and from every distress, and yet you associate others with Allah in His divinity.\"",
    "ur": "کہو، اللہ تمہیں اُس سے اور ہر تکلیف سے نجات دیتا ہے پھر تم دوسروں کو اُس کا شریک ٹھیراتے ہو"
  },
  {
    "id": 16,
    "reference": "6:100",
    "ar": "وَجَعَلُوا۟ لِلَّهِ شُرَكَآءَ ٱلْجِنَّ وَخَلَقَهُمْ ۖ وَخَرَقُوا۟ لَهُۥ بَنِينَ وَبَنَٰتٍۭ بِغَيْرِ عِلْمٍۢ ۚ سُبْحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ",
    "en": "And yet, some people have come to associate the jinn with Allah in His divinity, even though it is He Who created them; and in ignorance they impute to Him sons and daughters. He is Holy and Exalted far above that which they attribute to Him.",
    "ur": "اِس پر بھی لوگوں نے جنوں کو اللہ کا شریک ٹھیرا دیا، حالانکہ وہ اُن کا خالق ہے، اور بے جانے بوجھے اس کے لیے بیٹے اور بیٹیاں تصنیف کر دیں، حالانکہ وہ پاک اور بالا تر ہے اُن باتوں سے جو یہ لوگ کہتے ہیں"
  },
  {
    "id": 17,
    "reference": "6:101",
    "ar": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٌۭ وَلَمْ تَكُن لَّهُۥ صَٰحِبَةٌۭ ۖ وَخَلَقَ كُلَّ شَىْءٍۢ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "en": "He is the Originator of the heavens and the earth. How can He have a son when He has had no mate? And He has created everything and He has full knowledge of all things.",
    "ur": "وہ تو آسمانوں اور زمین کا موجد ہے اس کا کوئی بیٹا کیسے ہوسکتا ہے جبکہ کوئی اس کی شریک زندگی ہی نہیں ہے اس نے ہر چیز کو پیدا کیا ہے اور وہ ہر چیز کا علم رکھتا ہے"
  },
  {
    "id": 18,
    "reference": "7:190",
    "ar": "فَلَمَّآ ءَاتَىٰهُمَا صَٰلِحًۭا جَعَلَا لَهُۥ شُرَكَآءَ فِيمَآ ءَاتَىٰهُمَا ۚ فَتَعَٰلَى ٱللَّهُ عَمَّا يُشْرِكُونَ",
    "en": "But when He vouchsafes them a healthy child, they attribute to Him partners regarding what Allah had bestowed upon them. Subliminally exalted is Allah above that which they associate with Him.",
    "ur": "مگر جب اللہ نے ان کو ایک صحیح و سالم بچہ دے دیا تو وہ اس کی اِس بخشش و عنایت میں دوسروں کو اس کا شریک ٹھیرانے لگے اللہ بہت بلند و برتر ہے ان مشرکانہ باتوں سے جو یہ لوگ کرتے ہیں"
  },
  {
    "id": 19,
    "reference": "7:191",
    "ar": "أَيُشْرِكُونَ مَا لَا يَخْلُقُ شَيْـًۭٔا وَهُمْ يُخْلَقُونَ",
    "en": "Do they associate (with Allah in His divinity) those who can create nothing; rather, they are themselves created?",
    "ur": "کیسے نادان ہیں یہ لوگ کہ اُن کو خدا کا شریک ٹھیراتے ہیں جو کسی چیز کو بھی پیدا نہیں کرتے بلکہ خود پیدا کیے جاتے ہیں"
  },
  {
    "id": 20,
    "reference": "9:16",
    "ar": "أَمْ حَسِبْتُمْ أَن تُتْرَكُوا۟ وَلَمَّا يَعْلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُوا۟ مِنكُمْ وَلَمْ يَتَّخِذُوا۟ مِن دُونِ ٱللَّهِ وَلَا رَسُولِهِۦ وَلَا ٱلْمُؤْمِنِينَ وَلِيجَةًۭ ۚ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
    "en": "Do you imagine that you will be spared without being subjected to any test? Know well that Allah has not yet determined who strove hard (in His cause), and has not taken any others instead of His Messenger and the believers as his trusted allies? Allah is well aware of all that you do.",
    "ur": "کیا تم لوگوں نے یہ سمجھ رکھا ہے کہ یونہی چھوڑ دیے جاؤ گے حالانکہ ابھی اللہ نے یہ تو دیکھا ہی نہیں کہ تم میں سے کون وہ لوگ ہیں جنہوں نے (اس کی راہ میں) جاں فشانی کی اور اللہ اور رسول اور مومنین کے سوا کسی کو جگری دوست نہ بنایا، جو کچھ تم کرتے ہو اللہ اس سے باخبر ہے"
  },
  {
    "id": 21,
    "reference": "9:17",
    "ar": "مَا كَانَ لِلْمُشْرِكِينَ أَن يَعْمُرُوا۟ مَسَٰجِدَ ٱللَّهِ شَٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِٱلْكُفْرِ ۚ أُو۟لَٰٓئِكَ حَبِطَتْ أَعْمَٰلُهُمْ وَفِى ٱلنَّارِ هُمْ خَٰلِدُونَ",
    "en": "It does not become those who associate others with Allah in His Divinity to visit and tend Allah's mosques while they bear witness of unbelief against themselves. All their works have gone to waste. They shall abide in the Fire.",
    "ur": "مشرکین کا یہ کام نہیں ہے کہ وہ اللہ کی مسجدوں کے مجاور و خادم بنیں درآں حالیکہ اپنے اوپر وہ خود کفر کی شہادت دے رہے ہیں ان کے تو سارے اعمال ضائع ہو گئے اور جہنم میں انہیں ہمیشہ رہنا ہے"
  },
  {
    "id": 22,
    "reference": "9:31",
    "ar": "ٱتَّخَذُوٓا۟ أَحْبَارَهُمْ وَرُهْبَٰنَهُمْ أَرْبَابًۭا مِّن دُونِ ٱللَّهِ وَٱلْمَسِيحَ ٱبْنَ مَرْيَمَ وَمَآ أُمِرُوٓا۟ إِلَّا لِيَعْبُدُوٓا۟ إِلَٰهًۭا وَٰحِدًۭا ۖ لَّآ إِلَٰهَ إِلَّا هُوَ ۚ سُبْحَٰنَهُۥ عَمَّا يُشْرِكُونَ",
    "en": "They take their rabbis and their monks for their lords apart from Allah, and also the Messiah, son of Mary, whereas they were commanded to worship none but the One True God. There is no god but He. Exalted be He above those whom they associate with Him in His Divinity.",
    "ur": "انہوں نے اپنے علماء اور درویشوں کو اللہ کے سوا اپنا رب بنا لیا ہے اور اسی طرح مسیح ابن مریم کو بھی حالانکہ ان کو ایک معبود کے سوا کسی کی بندگی کرنے کا حکم نہیں دیا گیا تھا، وہ جس کے سوا کوئی مستحق عبادت نہیں، پاک ہے وہ ان مشرکانہ باتوں سے جو یہ لوگ کرتے ہیں"
  },
  {
    "id": 23,
    "reference": "10:34",
    "ar": "قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ ۚ قُلِ ٱللَّهُ يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ ۖ فَأَنَّىٰ تُؤْفَكُونَ",
    "en": "Ask them: 'Is there any among those whom you associate with Allah in His divinity who brings about the creation of all beings in the first instance and will then repeat it?' Tell them: 'It is Allah Who brings about the creation of all beings and will then repeat it. How are you, then, being misled?",
    "ur": "اِن سے پُوچھو، تمہارے ٹھیرائے ہوئے شریکوں میں کوئی ہے جو تخلیق کی ابتدا بھی کرتا ہو اور پھر اس کا اعادہ بھی کرے؟ کہو وہ صرف اللہ ہے جو تخلیق کی ابتدا بھی کرتا ہے اور اس کا اعادہ بھی، پھر تم یہ کس اُلٹی راہ پر چلائے جا رہے ہو؟"
  },
  {
    "id": 24,
    "reference": "10:66",
    "ar": "أَلَآ إِنَّ لِلَّهِ مَن فِى ٱلسَّمَٰوَٰتِ وَمَن فِى ٱلْأَرْضِ ۗ وَمَا يَتَّبِعُ ٱلَّذِينَ يَدْعُونَ مِن دُونِ ٱللَّهِ شُرَكَآءَ ۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ",
    "en": "Verily whoever dwells in the heavens or the earth belongs to Allah. Those who invoke others beside Allah, associating them with Him in His divinity, only follow conjectures and are merely guessing.",
    "ur": "آگاہ رہو! آسمان کے بسنے والے ہوں یا زمین کے، سب سے سب اللہ کے مملوک ہیں اور جو لوگ اللہ کے سوا کچھ (اپنے خودساختہ) شریکوں کو پکار رہے ہیں وہ نِرے وہم و گمان کے پیرو ہیں اور محض قیاس آرائیاں کرتے ہیں"
  },
  {
    "id": 25,
    "reference": "12:39",
    "ar": "يَٰصَىٰحِبَىِ ٱلسِّجْنِ ءَأَرْبَابٌۭ مُّتَفَرِّقُونَ خَيْرٌ أَمِ ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
    "en": "Fellow-prisoners! Is it better that there be diverse lords, or just Allah, the One, the Irresistible?",
    "ur": "اے زنداں کے ساتھیو، تم خود ہی سوچو کہ بہت سے متفرق رب بہتر ہیں یا وہ ایک اللہ جو سب غالب ہے؟"
  },
  {
    "id": 26,
    "reference": "13:16",
    "ar": "قُلْ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ قُلِ ٱللَّهُ ۚ قُلْ أَفَٱتَّخَذْتُم مِّن دُونِهِۦٓ أَوْلِيَآءَ لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعًۭا وَلَا ضَرًّۭا ۚ قُلْ هَلْ يَسْتَوِى ٱلْأَعْمَىٰ وَٱلْبَصِيرُ أَمْ هَلْ تَسْتَوِى ٱلظُّلُمَٰتُ وَٱلنُّورُ ۗ أَمْ جَعَلُوا۟ لِلَّهِ شُرَكَآءَ خَلَقُوا۟ كَخَلْقِهِۦ فَتَشَٰبَهَ ٱلْخَلْقُ عَلَيْهِمْ ۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَىْءٍۢ وَهُوَ ٱلْوَٰحِدُ ٱلْقَهَّٰرُ",
    "en": "Ask them: \"Who is the Lord of the heavens and the earth?\" Say: \"Allah.\" Tell them: \"Have you taken beside Him as your patrons those who do not have the power to benefit or to hurt even themselves?\" Say: \"Can the blind and the seeing be deemed equals? Or can light and darkness be deemed equals?\" If that is not so, then have those whom they associate with Allah in His Divinity ever created anything like what Allah did so that the question of creation has become dubious to them? Say: \"Allah is the creator of everything. He is the One, the Irresistible.\"",
    "ur": "اِن سے پوچھو، آسمان و زمین کا رب کون ہے؟ کہو، اللہ پھر ان سے کہو کہ جب حقیقت یہ ہے تو کیا تم نے اُسے چھوڑ کر ایسے معبودوں کو اپنا کارساز ٹھیرا لیا جو خود اپنے لیے بھی کسی نفع و نقصان کا اختیار نہیں رکھتے؟ کہو، کیا اندھا اور آنکھوں والا برابر ہوا کرتا ہے؟ کیا روشنی اور تاریکیاں یکساں ہوتی ہیں؟ اور اگر ایسا نہیں تو کیا اِن ٹھیرائے ہوئے شریکوں نے بھی اللہ کی طرح کچھ پیدا کیا ہے کہ اُس کی وجہ سے اِن پر تخلیق کا معاملہ مشتبہ ہو گیا؟ کہو، ہر چیز کا خالق صرف اللہ ہے اور وہ یکتا ہے، سب پر غالب!"
  },
  {
    "id": 27,
    "reference": "14:48",
    "ar": "يَوْمَ تُبَدَّلُ ٱلْأَرْضُ غَيْرَ ٱلْأَرْضِ وَٱلسَّمَٰوَٰتُ ۖ وَبَرَزُوا۟ لِلَّهِ ٱلْوَٰحِدِ ٱلْقَهَّارِ",
    "en": "(Do warn them of the) Day when the heavens and the earth shall be altogether changed; when all will appear fully exposed before Allah, the One, the Irresistible!",
    "ur": "ڈراؤ اِنہیں اُس دن سے جبکہ زمین اور آسمان بدل کر کچھ سے کچھ کر دیے جائیں گے اور سب کے سب اللہ واحد قہار کے سامنے بے نقاب حاضر ہو جائیں گے"
  },
  {
    "id": 28,
    "reference": "16:27",
    "ar": "ثُمَّ يَوْمَ ٱلْقِيَٰمَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تُشَٰٓقُّونَ فِيهِمْ ۚ قَالَ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ إِنَّ ٱلْخِزْىَ ٱلْيَوْمَ وَٱلسُّوٓءَ عَلَى ٱلْكَٰفِرِينَ",
    "en": "And again, on the Day of Resurrection, He will bring them to disgrace, and say: \"Tell Me, now, where are those to whom you ascribed a share in My Divinity, and for whose sake you disputed (with the upholders of the Truth)?\" Those who were endowed with knowledge (in the world) will say: \"Surely today humiliation and misery shall be the lot of the unbelievers\";",
    "ur": "پھر قیامت کے روز اللہ اُنہیں ذلیل و خوار کرے گا اور اُن سے کہے گا \"بتاؤ اب کہاں ہیں میرے وہ شریک جن کے لیے تم (اہل حق سے) جھگڑے کیا کرتے تھے؟\" جن لوگوں کو دنیا میں علم حاصل تھا وہ کہیں گے \"آج رسوائی اور بدبختی ہے کافروں کے لیے\""
  },
  {
    "id": 29,
    "reference": "16:51",
    "ar": "۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓا۟ إِلَٰهَيْنِ ٱثْنَيْنِ ۖ إِنَّمَا هُوَ إِلَٰهٌۭ وَٰحِدٌۭ ۖ فَإِيَّٰىَ فَٱرْهَبُونِ",
    "en": "Allah has commanded: \"Do not take two gods; for He is but One God. So fear Me alone.\"",
    "ur": "اللہ کا فرمان ہے کہ \"دو خدا نہ بنا لو، خدا تو بس ایک ہی ہے، لہٰذا تم مجھی سے ڈرو"
  },
  {
    "id": 30,
    "reference": "18:52",
    "ar": "وَيَوْمَ يَقُولُ نَادُوا۟ شُرَكَآءِىَ ٱلَّذِينَ زَعَمْتُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا۟ لَهُمْ وَجَعَلْنَا بَيْنَهُم مَّوْبِقًۭا",
    "en": "What will such people do on the Day when the Lord will say: \"Now call upon all those whom you believed to be My partners?\" Thereupon they will call upon them, but they will not respond to their call; and We shall make them a common pit of doom,",
    "ur": "پھر کیا کریں گے یہ لوگ اُس روز جبکہ اِن کا رب اِن سے کہے گا کہ پکارو اب اُن ہستیوں کو جنہیں تم میرا شریک سمجھ بیٹھے تھے یہ ان کو پکاریں گے، مگر وہ اِن کی مدد کو نہ آئیں گے اور ہم ان کے درمیان ایک ہی ہلاکت کا گڑھا مشترک کر دیں گے"
  },
  {
    "id": 31,
    "reference": "21:22",
    "ar": "لَوْ كَانَ فِيهِمَآ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَا ۚ فَسُبْحَٰنَ ٱللَّهِ رَبِّ ٱلْعَرْشِ عَمَّا يَصِفُونَ",
    "en": "Had there been any gods in the heavens and the earth apart from Allah, the order of both the heavens and the earth would have gone to ruins. Glory be to Allah, the Lord of the Throne, Who is far above their false descriptions of Him.",
    "ur": "اگر آسمان و زمین میں ایک اللہ کے سوا دُوسرے خدا بھی ہوتے تو (زمین اور آسمان) دونوں کا نظام بگڑ جاتا پس پاک ہے اللہ ربّ العرش اُن باتوں سے جو یہ لوگ بنا رہے ہیں"
  },
  {
    "id": 32,
    "reference": "21:25",
    "ar": "وَمَآ أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ إِلَّا نُوحِىٓ إِلَيْهِ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱعْبُدُونِ",
    "en": "Never did We send any Messenger before you to whom We did not reveal: \"There is no god but Me. So serve Me alone.\"",
    "ur": "ہم نے تُم سے پہلے جو رسُول بھی بھیجا ہے اُس کو یہی وحی کی ہے کہ میرے سوا کوئی خدا نہیں ہے، پس تم لوگ میری ہی بندگی کرو"
  },
  {
    "id": 33,
    "reference": "21:108",
    "ar": "قُلْ إِنَّمَا يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَٰهُكُمْ إِلَٰهٌۭ وَٰحِدٌۭ ۖ فَهَلْ أَنتُم مُّسْلِمُونَ",
    "en": "Say: \"It is revealed to me that your God is only One God. Will you, then, submit to Him?\"",
    "ur": "اِن سے کہو \"میرے پاس جو وحی آتی ہے وہ یہ ہے کہ تمہارا خدا صرف ایک خدا ہے، پھر کیا تم سرِ اطاعت جھکاتے ہو؟\""
  },
  {
    "id": 34,
    "reference": "22:31",
    "ar": "حُنَفَآءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِۦ ۚ وَمَن يُشْرِكْ بِٱللَّهِ فَكَأَنَّمَا خَرَّ مِنَ ٱلسَّمَآءِ فَتَخْطَفُهُ ٱلطَّيْرُ أَوْ تَهْوِى بِهِ ٱلرِّيحُ فِى مَكَانٍۢ سَحِيقٍۢ",
    "en": "Become exclusively devoted to Allah, ascribing Divinity to none other than Him. Whoso ascribes Divinity to aught beside Allah, it is as though he fell down from the sky whereafter either the birds will snatch him away, or the wind will sweep him to a distant place (causing him to be shattered to pieces).",
    "ur": "یکسُو ہو کر اللہ کے بندے بنو، اس کے ساتھ کسی کو شریک نہ کرو اور جو کوئی اللہ کے ساتھ شرک کرے تو گویا وہ آسمان سے گر گیا، اب یا تو اسے پرندے اُچک لے جائیں گے یا ہوا اُس کو ایسی جگہ لے جا کر پھینک دے گی جہاں اُس کے چیتھڑے اڑ جائیں گے"
  },
  {
    "id": 35,
    "reference": "22:73",
    "ar": "يَٰٓأَيُّهَا ٱلنَّاسُ ضُرِبَ مَثَلٌۭ فَٱسْتَمِعُوا۟ لَهُۥٓ ۚ إِنَّ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ لَن يَخْلُقُوا۟ ذُبَابًۭا وَلَوِ ٱجْتَمَعُوا۟ لَهُۥ ۖ وَإِن يَسْلُبْهُمُ ٱلذُّبَابُ شَيْـًۭٔا لَّا يَسْتَنقِذُوهُ مِنْهُ ۚ ضَعُفَ ٱلطَّالِبُ وَٱلْمَطْلُوبُ",
    "en": "O people, a parable is set forth: pay heed to it. Those who call upon aught other than Allah shall never be able to create even a fly, even if all of them were to come together to do that. And if the fly were to snatch away anything from them, they would not be able to recover that from it. Powerless is the supplicant; and powerless is he to whom he supplicates.",
    "ur": "لوگو، ایک مثال دی جاتی ہے، غور سے سنو جن معبودوں کو تم خدا کو چھوڑ کر پکارتے ہو وہ سب مِل کر ایک مکھی بھی پیدا کرنا چاہیں تو نہیں کر سکتے بلکہ اگر مکھی ان سے کوئی چیز چھین لے جائے تو وہ اسے چھڑا بھی نہیں سکتے مدد چاہنے والے بھی کمزور اور جن سے مدد چاہی جاتی ہے وہ بھی کمزور"
  },
  {
    "id": 36,
    "reference": "28:62",
    "ar": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
    "en": "(Let them not forget) that the Day when Allah will call unto them, and say: \"Where are those whom you imagined to be My associates?\"",
    "ur": "اور (بھول نہ جائیں یہ لوگ) اُس دن کو جب کہ وہ اِن کو پکارے گا اور پوچھے گا \"کہاں ہیں میرے وہ شریک جن کا تم گمان رکھتے تھے؟\""
  },
  {
    "id": 37,
    "reference": "28:72",
    "ar": "قُلْ أَرَءَيْتُمْ إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ ٱلنَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ ٱلْقِيَٰمَةِ مَنْ إِلَٰهٌ غَيْرُ ٱللَّهِ يَأْتِيكُم بِلَيْلٍۢ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ",
    "en": "Say: \"Did you consider: if Allah were to make the day become perpetual over you till the Day of Judgement, is there a god other than Allah who can bring in night for you that you may repose in it? Will you not see?\"",
    "ur": "اِن سے پوچھو، کبھی تم نے سوچا کہ اگر اللہ قیامت تک تم پر ہمیشہ کے لیے دن طاری کر دے تو اللہ کے سوا وہ کونسا معبُود ہے جو تمہیں رات لا دے تاکہ تم اس میں سکون حاصل کر سکو؟ کیا تم کو سُوجھتا نہیں؟"
  },
  {
    "id": 38,
    "reference": "28:87",
    "ar": "وَلَا يَصُدُّنَّكَ عَنْ ءَايَٰتِ ٱللَّهِ بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ ۖ وَٱدْعُ إِلَىٰ رَبِّكَ ۖ وَلَا تَكُونَنَّ مِنَ ٱلْمُشْرِكِينَ",
    "en": "And let it never happen that the unbelievers might turn you away from the revelations of Allah after they have been revealed to you. Call people to your Lord and never become one of the unbelievers,",
    "ur": "اور ایسا کبھی نہ ہونے پائے کہ اللہ کی آیات جب تم پر نازل ہوں تو کفّار تمہیں اُن سے باز رکھیں اپنے رب کی طرف دعوت دو اور ہرگز مشرکوں میں شامل نہ ہو"
  },
  {
    "id": 39,
    "reference": "29:46",
    "ar": "۞ وَلَا تُجَٰدِلُوٓا۟ أَهْلَ ٱلْكِتَٰبِ إِلَّا بِٱلَّتِى هِىَ أَحْسَنُ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ ۖ وَقُولُوٓا۟ ءَامَنَّا بِٱلَّذِىٓ أُنزِلَ إِلَيْنَا وَأُنزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَٰحِدٌۭ وَنَحْنُ لَهُۥ مُسْلِمُونَ",
    "en": "Argue not with the People of the Book except in the fairest manner, unless it be those of them that are utterly unjust. Say to them: “We believe in what was revealed to us and what was revealed to you. One is our God and your God; and we are those who submit ourselves to Him.”",
    "ur": "اور اہل کتاب سے بحث نہ کرو مگر عمدہ طریقہ سے، سوائے اُن لوگوں کے جو اُن میں سے ظالم ہوں، اور اُن سے کہو کہ \"ہم ایمان لائے ہیں اُس چیز پر بھی جو ہماری طرف بھیجی گئی ہے اور اُس چیز پر بھی جو تمہاری طرف بھیجی گئی تھی، ہمارا خدا اور تمہارا خدا ایک ہی ہے اور ہم اُسی کے مُسلم (فرماں بردار) ہیں\""
  },
  {
    "id": 40,
    "reference": "30:31",
    "ar": "۞ مُنِيبِينَ إِلَيْهِ وَٱتَّقُوهُ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَلَا تَكُونُوا۟ مِنَ ٱلْمُشْرِكِينَ",
    "en": "(Adhere to the True Faith and) turn to Him, and hold Him in awe, and establish Prayer, and do not be of those who associate others with Allah in His Divinity,",
    "ur": "(قائم ہو جاؤ اِس بات پر) اللہ کی طرف رجوع کرتے ہوئے، اور ڈرو اُس سے، اور نماز قائم کرو، اور نہ ہو جاؤ اُن مشرکین میں سے"
  },
  {
    "id": 41,
    "reference": "31:13",
    "ar": "وَإِذْ قَالَ لُقْمَٰنُ لِٱبْنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَىَّ لَا تُشْرِكْ بِٱللَّهِ ۖ إِنَّ ٱلشِّرْكَ لَظُلْمٌ عَظِيمٌۭ",
    "en": "And call to mind when Luqman said to his son while exhorting him: “My son, do not associate others with Allah in His Divinity. Surely, associating others with Allah in His Divinity is a mighty wrong.”",
    "ur": "یاد کرو جب لقمان اپنے بیٹے کو نصیحت کر رہا تھا تو اس نے کہا \"بیٹا! خدا کے ساتھ کسی کو شریک نہ کرنا، حق یہ ہے کہ شرک بہت بڑا ظلم ہے\""
  },
  {
    "id": 42,
    "reference": "34:27",
    "ar": "قُلْ أَرُونِىَ ٱلَّذِينَ أَلْحَقْتُم بِهِۦ شُرَكَآءَ ۖ كَلَّا ۚ بَلْ هُوَ ٱللَّهُ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "en": "Say: “Show me those whom you have attached to Him as His associates (in Divinity).” Nay, Allah alone is Most Mighty, Most Wise.",
    "ur": "اِن سے کہو، \"ذرا مجھے دکھاؤ تو سہی وہ کون ہستیاں ہیں جنہیں تم نے اس کے ساتھ شریک لگا رکھا ہے\" ہرگز نہیں، زبردست اور دانا تو بس وہ اللہ ہی ہے"
  },
  {
    "id": 43,
    "reference": "35:14",
    "ar": "إِن تَدْعُوهُمْ لَا يَسْمَعُوا۟ دُعَآءَكُمْ وَلَوْ سَمِعُوا۟ مَا ٱسْتَجَابُوا۟ لَكُمْ ۖ وَيَوْمَ ٱلْقِيَٰمَةِ يَكْفُرُونَ بِشِرْكِكُمْ ۚ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍۢ",
    "en": "If you call upon them, they cannot hear your prayer. And if they hear it, they cannot answer it. On the Day of Resurrection they will disown you for associating others with Allah in His Divinity. No one can inform you of the truth save the All-Aware.",
    "ur": "انہیں پکارو تو وہ تمہاری دعائیں سن نہیں سکتے اور سن لیں تو ان کا تمہیں کوئی جواب نہیں دے سکتے اور قیامت کے روز وہ تمہارے شرک کا انکار کر دیں گے حقیقت حال کی ایسی صحیح خبر تمہیں ایک خبردار کے سوا کوئی نہیں دے سکتا"
  },
  {
    "id": 44,
    "reference": "37:4",
    "ar": "إِنَّ إِلَٰهَكُمْ لَوَٰحِدٌۭ",
    "en": "surely your God is One,",
    "ur": "تمہارا معبود حقیقی بس ایک ہی ہے"
  },
  {
    "id": 45,
    "reference": "38:65",
    "ar": "قُلْ إِنَّمَآ أَنَا۠ مُنذِرٌۭ ۖ وَمَا مِنْ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
    "en": "Tell them, (O Prophet): “I am nothing but a warner. There is no deity but Allah, the One, the Supreme,",
    "ur": "(اے نبیؐ) اِن سے کہو، \"میں تو بس خبردار کر دینے والا ہوں کوئی حقیقی معبود نہیں مگر اللہ، جو یکتا ہے، سب پر غالب"
  },
  {
    "id": 46,
    "reference": "39:3",
    "ar": "أَلَا لِلَّهِ ٱلدِّينُ ٱلْخَالِصُ ۚ وَٱلَّذِينَ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَآ إِلَى ٱللَّهِ زُلْفَىٰٓ إِنَّ ٱللَّهَ يَحْكُمُ بَيْنَهُمْ فِى مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ ٱللَّهَ لَا يَهْدِى مَنْ هُوَ كَٰذِبٌۭ كَفَّارٌۭ",
    "en": "Lo, religion is exclusively devoted to Allah. Your religion is entirely consecrated to Him. As for those who have taken others than Allah for their guardians, (they say): “We worship them only that they may bring us nearer to Allah.” Allah will judge between them concerning what they differ about. Verily Allah does not guide anyone who is given to sheer lying, is an utter unbeliever.",
    "ur": "خبردار، دین خالص اللہ کا حق ہے رہے وہ لوگ جنہوں نے اُس کے سوا دوسرے سرپرست بنا رکھے ہیں (اور اپنے اِس فعل کی توجیہ یہ کرتے ہیں کہ) ہم تو اُن کی عبادت صرف اس لیے کرتے ہیں کہ وہ اللہ تک ہماری رسائی کرا دیں، اللہ یقیناً اُن کے درمیان اُن تمام باتوں کا فیصلہ کر دے گا جن میں وہ اختلاف کر رہے ہیں اللہ کسی ایسے شخص کو ہدایت نہیں دیتا جو جھوٹا اور منکر حق ہو"
  },
  {
    "id": 47,
    "reference": "39:29",
    "ar": "ضَرَبَ ٱللَّهُ مَثَلًۭا رَّجُلًۭا فِيهِ شُرَكَآءُ مُتَشَٰكِسُونَ وَرَجُلًۭا سَلَمًۭا لِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ ٱلْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
    "en": "Allah propounds a parable: there is a man whose ownership is shared by several quarrelsome masters, each pulling him to himself; and there is another who is exclusively owned by one man. Can the two be alike? All praise and thanks be to Allah. But most of them are unaware.",
    "ur": "اللہ ایک مثال دیتا ہے ایک شخص تو وہ ہے جس کی ملکیت میں بہت سے کج خلق آقا شریک ہیں جو اسے اپنی اپنی طرف کھینچتے ہیں اور دوسرا شخص پورا کا پورا ایک ہی آقا کا غلام ہے کیا ان دونوں کا حال یکساں ہو سکتاہے؟ الحمدللہ، مگر اکثر لوگ نادانی میں پڑے ہوئے ہیں"
  },
  {
    "id": 48,
    "reference": "39:65",
    "ar": "وَلَقَدْ أُوحِىَ إِلَيْكَ وَإِلَى ٱلَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ ٱلْخَٰسِرِينَ",
    "en": "(Tell them clearly that) it was revealed to you and to all Prophets before you: “If you associate any others with Allah in His Divinity, your works will surely come to naught and you will certainly be among the losers.”",
    "ur": "(یہ بات تمہیں ان سے صاف کہہ دینی چاہیے کیونکہ) تمہاری طرف اور تم سے پہلے گزرے ہوئے تمام انبیاء کی طرف یہ وحی بھیجی جا چکی ہے کہ اگر تم نے شرک کیا تو تمہارا عمل ضائع ہو جائے گا اور تم خسارے میں رہو گے"
  },
  {
    "id": 49,
    "reference": "40:16",
    "ar": "يَوْمَ هُم بَٰرِزُونَ ۖ لَا يَخْفَىٰ عَلَى ٱللَّهِ مِنْهُمْ شَىْءٌۭ ۚ لِّمَنِ ٱلْمُلْكُ ٱلْيَوْمَ ۖ لِلَّهِ ٱلْوَٰحِدِ ٱلْقَهَّارِ",
    "en": "the Day when they will emerge and nothing of them shall be hidden from Allah. (On that Day they will be asked): “Whose is the kingdom today?” (The whole world will cry out): “It is Allah's, the One, the Overpowering.”",
    "ur": "وہ دن جبکہ سب لوگ بے پردہ ہوں گے، اللہ سے ان کی کوئی بات بھی چھپی ہوئی نہ ہو گی (اُس روز پکار کر پوچھا جائے گا) آج بادشاہی کس کی ہے؟ (سارا عالم پکار اٹھے گا) اللہ واحد قہار کی"
  },
  {
    "id": 50,
    "reference": "41:6",
    "ar": "قُلْ إِنَّمَآ أَنَا۠ بَشَرٌۭ مِّثْلُكُمْ يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَٰهُكُمْ إِلَٰهٌۭ وَٰحِدٌۭ فَٱسْتَقِيمُوٓا۟ إِلَيْهِ وَٱسْتَغْفِرُوهُ ۗ وَوَيْلٌۭ لِّلْمُشْرِكِينَ",
    "en": "Tell them, (O Prophet): “I am only a human being like you. It is revealed to me that your God is One God; so direct yourselves straight to Him, and seek His forgiveness. Woe to those who associate others with Allah in His Divinity,",
    "ur": "اے نبیؐ، اِن سے کہو، میں تو ایک بشر ہوں تم جیسا مجھے وحی کے ذریعہ سے بتایا جاتا ہے کہ تمہارا خدا تو بس ایک ہی خدا ہے، لہٰذا تم سیدھے اُسی کا رخ اختیار کرو اور اس سے معافی چاہو تباہی ہے اُن مشرکوں کے لیے"
  },
  {
    "id": 51,
    "reference": "42:11",
    "ar": "فَاطِرُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۚ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَٰجًۭا وَمِنَ ٱلْأَنْعَٰمِ أَزْوَٰجًۭا ۖ يَذْرَؤُكُمْ فِيهِ ۚ لَيْسَ كَمِثْلِهِۦ شَىْءٌۭ ۖ وَهُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
    "en": "The Originator of the heavens and the earth, He has appointed for you pairs of your own kind, and pairs also of cattle. Thus does He multiply you. Naught in the universe is like Him. He is All-Hearing, All-Seeing.",
    "ur": "آسمانوں اور زمین کا بنانے والا، جس نے تمہاری اپنی جنس سے تمہارے لیے جوڑے پیدا کیے، اور اسی طرح جانوروں میں بھی (اُنہی کے ہم جنس) جوڑے بنائے، اور اِس طریقہ سے وہ تمہاری نسلیں پھیلاتا ہے کائنات کی کوئی چیز اس کے مشابہ نہیں، وہ سب کچھ سننے اور دیکھنے والا ہے"
  },
  {
    "id": 52,
    "reference": "47:19",
    "ar": "فَٱعْلَمْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱللَّهُ وَٱسْتَغْفِرْ لِذَنۢبِكَ وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ ۗ وَٱللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَىٰكُمْ",
    "en": "Know, therefore, (O Prophet), that there is no god but Allah, and ask forgiveness for your shortcomings and also for (the shortcomings of) believing men and believing women. Allah knows the places where you move about and where you dwell.",
    "ur": "پس اے نبیؐ، خوب جان لو کہ اللہ کے سوا کوئی عبادت کا مستحق نہیں ہے، اور معافی مانگو اپنے قصور کے لیے بھی اور مومن مردوں اور عورتوں کے لیے بھی اللہ تمہاری سرگرمیوں کو بھی جانتا ہے اور تمہارے ٹھکانے سے بھی واقف ہے"
  },
  {
    "id": 53,
    "reference": "57:3",
    "ar": "هُوَ ٱلْأَوَّلُ وَٱلْءَاخِرُ وَٱلظَّٰهِرُ وَٱلْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "en": "He is the First and the Last, and the Manifest and the Hidden, and He has knowledge of everything.",
    "ur": "وہی اول بھی ہے اور آخر بھی، ظاہر بھی ہے اور مخفی بھی، اور وہ ہر چیز کا علم رکھتا ہے"
  },
  {
    "id": 54,
    "reference": "112:1",
    "ar": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ قُلْ هُوَ ٱللَّهُ أَحَدٌ",
    "en": "Say: “He is Allah, the One and Unique;",
    "ur": "کہو، وہ اللہ ہے، یکتا"
  }
]