[
  {
    "id": 1,
    "reference": "2:54",
    "ar": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَٰقَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلْعِجْلَ فَتُوبُوٓا۟ إِلَىٰ بَارِئِكُمْ فَٱقْتُلُوٓا۟ أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌۭ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "en": "Remember that when Moses (returned with the Divine Gift, he) said to his people, \"O my people, you have wronged yourselves grievously by taking the calf for worship. Therefore, turn to your Creator. in penitence and slay the guilty ones among you. This is best for you in the sight of your Creator.\" At that time your Creator accepted your repentance because He is Relenting 'and Merciful.",
    "ur": "یاد کرو جب موسیٰؑ (یہ نعمت لیتے ہوئے پلٹا، تو اُس) نے اپنی قوم سے کہا کہ \"لوگو، تم نے بچھڑے کو معبود بنا کر اپنے اوپر سخت ظلم کیا ہے، لہٰذا تم لوگ اپنے خالق کے حضور توبہ کرو اور اپنی جانوں کو ہلاک کرو، اسی میں تمہارے خالق کے نزدیک تمہاری بہتری ہے\" اُس وقت تمہارے خالق نے تمہاری توبہ قبول کر لی کہ وہ بڑا معاف کرنے والا اور رحم فرمانے والا ہے"
  },
  {
    "id": 2,
    "reference": "2:160",
    "ar": "إِلَّا ٱلَّذِينَ تَابُوا۟ وَأَصْلَحُوا۟ وَبَيَّنُوا۟ فَأُو۟لَٰٓئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "en": "I, however, will forgive those of them who repent of it, mend their ways and make own what they were concealing: for I am very generous in accepting repentance and showing mercy.",
    "ur": "البتہ جو اس روش سے باز آ جائیں اور اپنے طرز عمل کی اصلاح کر لیں اور جو کچھ چھپاتے تھے، اُسے بیان کرنے لگیں، اُن کو میں معاف کر دوں گا اور میں بڑا در گزر کرنے والا اور رحم کرنے والا ہوں"
  },
  {
    "id": 3,
    "reference": "2:199",
    "ar": "ثُمَّ أَفِيضُوا۟ مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ وَٱسْتَغْفِرُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "en": "Then return from where others return and ask Allah's forgiveness. Most surely He is Forgiving and Merciful.",
    "ur": "پھر جہاں سے سب لوگ پلٹتے ہیں وہیں سے تم بھی پلٹو اور اللہ سے معافی چاہو، یقیناً وہ معاف کرنے والا اور رحم فرمانے والا ہے"
  },
  {
    "id": 4,
    "reference": "3:89",
    "ar": "إِلَّا ٱلَّذِينَ تَابُوا۟ مِنۢ بَعْدِ ذَٰلِكَ وَأَصْلَحُوا۟ فَإِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌ",
    "en": "But those who repent and mend their ways shall be excepted for indeed Allah is Forgiving, All-Compassionate.",
    "ur": "البتہ وہ لوگ بچ جائیں گے جو اِس کے بعد توبہ کر کے اپنے طرز عمل کی اصلاح کر لیں، اللہ بخشنے والا اور رحم فرمانے والا ہے"
  },
  {
    "id": 5,
    "reference": "4:16",
    "ar": "وَٱلَّذَانِ يَأْتِيَٰنِهَا مِنكُمْ فَـَٔاذُوهُمَا ۖ فَإِن تَابَا وَأَصْلَحَا فَأَعْرِضُوا۟ عَنْهُمَآ ۗ إِنَّ ٱللَّهَ كَانَ تَوَّابًۭا رَّحِيمًا",
    "en": "Punish both of those among you who are guilty of this sin, then if they repent and mend their ways, leave them alone. For Allah is always ready to accept repentance. He is All-Compassionate.",
    "ur": "اور تم میں سے جو اس فعل کا ارتکاب کریں اُن دونوں کو تکلیف دو، پھر اگر وہ توبہ کریں اور اپنی اصلاح کر لیں تو انہیں چھوڑ دو کہ اللہ بہت توبہ قبول کرنے والا اور رحم فرمانے والا ہے"
  },
  {
    "id": 6,
    "reference": "4:17",
    "ar": "إِنَّمَا ٱلتَّوْبَةُ عَلَى ٱللَّهِ لِلَّذِينَ يَعْمَلُونَ ٱلسُّوٓءَ بِجَهَٰلَةٍۢ ثُمَّ يَتُوبُونَ مِن قَرِيبٍۢ فَأُو۟لَٰٓئِكَ يَتُوبُ ٱللَّهُ عَلَيْهِمْ ۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًۭا",
    "en": "(And remember that) Allah's acceptance of repentance is only for those who commit evil out of ignorance and then soon repent. It is towards such persons that Allah turns graciously. Allah is All-Knowing, All-Wise.",
    "ur": "ہاں یہ جان لو کہ اللہ پر توبہ کی قبولیت کا حق اُنہی لوگوں کے لیے ہے جو نادانی کی وجہ سے کوئی برا فعل کر گزرتے ہیں اور اس کے بعد جلدی ہی توبہ کر لیتے ہیں ایسے لوگوں پر اللہ اپنی نظر عنایت سے پھر متوجہ ہو جاتا ہے اور اللہ ساری باتوں کی خبر رکھنے والا اور حکیم و دانا ہے"
  },
  {
    "id": 7,
    "reference": "4:18",
    "ar": "وَلَيْسَتِ ٱلتَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ ٱلسَّيِّـَٔاتِ حَتَّىٰٓ إِذَا حَضَرَ أَحَدَهُمُ ٱلْمَوْتُ قَالَ إِنِّى تُبْتُ ٱلْـَٰٔنَ وَلَا ٱلَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ أُو۟لَٰٓئِكَ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًۭا",
    "en": "But of no avail is repentance of those who do evil until death approaches any one of them and then he says: 'Now I repent.' Nor is the repentance of those who die in the state of unbelief of any avail to them. For them We have kept in readiness a painful chastisement.",
    "ur": "مگر توبہ اُن لوگوں کے لیے نہیں ہے جو برے کام کیے چلے جاتے ہیں یہاں تک کہ جب ان میں سے کسی کی موت وقت آ جاتا ہے اُس وقت وہ کہتا ہے کہ اب میں نے توبہ کی، اور اسی طرح توبہ اُن کے لیے بھی نہیں ہے جو مرتے دم تک کافر رہیں ا یسے لوگوں کے لیے تو ہم نے درد ناک سزا تیار کر رکھی ہے"
  },
  {
    "id": 8,
    "reference": "4:106",
    "ar": "وَٱسْتَغْفِرِ ٱللَّهَ ۖ إِنَّ ٱللَّهَ كَانَ غَفُورًۭا رَّحِيمًۭا",
    "en": "and seek forgiveness from Allah. Surely Allah is All-Forgiving, All-Compassionate.",
    "ur": "اور اللہ سے در گزر کی درخواست کرو، وہ بڑا درگزر فرمانے والا اور رحیم ہے"
  },
  {
    "id": 9,
    "reference": "4:110",
    "ar": "وَمَن يَعْمَلْ سُوٓءًا أَوْ يَظْلِمْ نَفْسَهُۥ ثُمَّ يَسْتَغْفِرِ ٱللَّهَ يَجِدِ ٱللَّهَ غَفُورًۭا رَّحِيمًۭا",
    "en": "He who does either evil or wrongs himself, and then asks for the forgiveness of Allah, will find Allah All-Forgiving, All-Compassionate.",
    "ur": "اگر کوئی شخص برا فعل کر گزرے یا اپنے نفس پر ظلم کر جائے اور اس کے بعد اللہ سے درگزر کی درخواست کرے تو اللہ کو درگزر کرنے والا اور رحیم پائے گا"
  },
  {
    "id": 10,
    "reference": "4:146",
    "ar": "إِلَّا ٱلَّذِينَ تَابُوا۟ وَأَصْلَحُوا۟ وَٱعْتَصَمُوا۟ بِٱللَّهِ وَأَخْلَصُوا۟ دِينَهُمْ لِلَّهِ فَأُو۟لَٰٓئِكَ مَعَ ٱلْمُؤْمِنِينَ ۖ وَسَوْفَ يُؤْتِ ٱللَّهُ ٱلْمُؤْمِنِينَ أَجْرًا عَظِيمًۭا",
    "en": "except those who re-pent and mend their ways and hold fast to Allah and make their faith exclusive to Allah. Those people shall be numbered with the believers and Allah will certainly bestow on the believers a great reward.",
    "ur": "البتہ جو اُن میں سے تائب ہو جائیں او ر اپنے طرز عمل کی اصلاح کر لیں اور اللہ کا دامن تھام لیں اور اپنے دین کو اللہ کے لیے خالص کر دیں، ایسے لوگ مومنوں کے ساتھ ہیں اور اللہ مومنوں کو ضرور اجر عظیم عطا فرمائے گا"
  },
  {
    "id": 11,
    "reference": "5:34",
    "ar": "إِلَّا ٱلَّذِينَ تَابُوا۟ مِن قَبْلِ أَن تَقْدِرُوا۟ عَلَيْهِمْ ۖ فَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "en": "except for those who repent before you have overpowered them. Know well that Allah is All-Forgiving, All-Compassionate.",
    "ur": "مگر جو لوگ توبہ کر لیں قبل اس کے کہ تم ان پر قابو پاؤ تمہیں معلوم ہونا چاہیے کہ اللہ معاف کرنے والا اور رحم فرمانے والا ہے"
  },
  {
    "id": 12,
    "reference": "5:39",
    "ar": "فَمَن تَابَ مِنۢ بَعْدِ ظُلْمِهِۦ وَأَصْلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيْهِ ۗ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌ",
    "en": "But he who repents after he has committed wrong, and makes amends, Allah will graciously turn to him. Truly Allah is All-Forgiving, All-Compassionate.",
    "ur": "پھر جو ظلم کرنے کے بعد توبہ کرے اور اپنی اصلاح کر لے تو اللہ کی نظر عنایت پھر اس پر مائل ہو جائے گی، اللہ بہت درگزر کرنے والا اور رحم فرمانے والا ہے"
  },
  {
    "id": 13,
    "reference": "5:74",
    "ar": "أَفَلَا يَتُوبُونَ إِلَى ٱللَّهِ وَيَسْتَغْفِرُونَهُۥ ۚ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ",
    "en": "Will they not, then, turn to Allah in repentance, and ask for His forgiveness? Allah is All-Forgiving, All-Compassionate.",
    "ur": "پھر کیا یہ اللہ سے توبہ نہ کریں گے اور اس سے معافی نہ مانگیں گے؟ اللہ بہت درگزر فرمانے والا اور رحم کرنے والا ہے"
  },
  {
    "id": 14,
    "reference": "6:54",
    "ar": "وَإِذَا جَآءَكَ ٱلَّذِينَ يُؤْمِنُونَ بِـَٔايَٰتِنَا فَقُلْ سَلَٰمٌ عَلَيْكُمْ ۖ كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ ٱلرَّحْمَةَ ۖ أَنَّهُۥ مَنْ عَمِلَ مِنكُمْ سُوٓءًۢا بِجَهَٰلَةٍۢ ثُمَّ تَابَ مِنۢ بَعْدِهِۦ وَأَصْلَحَ فَأَنَّهُۥ غَفُورٌۭ رَّحِيمٌۭ",
    "en": "And when those who believe in Our signs come to you, say to them: 'Peace be upon you. Your Lord has made mercy incumbent upon Himself so that if anyone of you does a bad deed out of ignorance and thereafter repents and makes amends, surely you will find Him All-Forgiving, AllCompassionate.'",
    "ur": "جب تمہارے پاس وہ لوگ آئیں جو ہماری آیات پر ایمان لاتے ہیں تو ان سے کہو \"تم پر سلامتی ہے تمہارے رب نے رحم و کرم کا شیوہ اپنے اوپر لازم کر لیا ہے یہ اس کا رحم و کرم ہی ہے کہ اگر تم میں سے کوئی نادانی کے ساتھ کسی برائی کا ارتکاب کر بیٹھا ہو پھر اس کے بعد توبہ کرے اور اصلاح کر لے تو وہ اُسے معاف کر دیتا ہے اور نرمی سے کام لیتا ہے\""
  },
  {
    "id": 15,
    "reference": "7:153",
    "ar": "وَٱلَّذِينَ عَمِلُوا۟ ٱلسَّيِّـَٔاتِ ثُمَّ تَابُوا۟ مِنۢ بَعْدِهَا وَءَامَنُوٓا۟ إِنَّ رَبَّكَ مِنۢ بَعْدِهَا لَغَفُورٌۭ رَّحِيمٌۭ",
    "en": "As for those who do evil, and later repent and have faith, such shall find their Lord All-Forgiving, All-Compassionate after (they repent and believe)",
    "ur": "اور جو لوگ برے عمل کریں پھر توبہ کر لیں اور ایمان لے آئیں تو یقیناً اِس توبہ و ایمان کے بعد تیرا رب درگزر اور رحم فرمانے والا ہے\""
  },
  {
    "id": 16,
    "reference": "9:11",
    "ar": "فَإِن تَابُوا۟ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ فَإِخْوَٰنُكُمْ فِى ٱلدِّينِ ۗ وَنُفَصِّلُ ٱلْءَايَٰتِ لِقَوْمٍۢ يَعْلَمُونَ",
    "en": "But if they repent and establish Prayer and give Zakah they are your brothers in faith. Thus do We expound Our revelations to those who know.",
    "ur": "پس اگر یہ توبہ کر لیں اور نماز قائم کریں اور زکوٰۃ دیں تو تمہارے دینی بھائی ہیں اور جاننے والوں کے لیے ہم اپنے احکام واضح کیے دیتے ہیں"
  },
  {
    "id": 17,
    "reference": "9:74",
    "ar": "يَحْلِفُونَ بِٱللَّهِ مَا قَالُوا۟ وَلَقَدْ قَالُوا۟ كَلِمَةَ ٱلْكُفْرِ وَكَفَرُوا۟ بَعْدَ إِسْلَٰمِهِمْ وَهَمُّوا۟ بِمَا لَمْ يَنَالُوا۟ ۚ وَمَا نَقَمُوٓا۟ إِلَّآ أَنْ أَغْنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضْلِهِۦ ۚ فَإِن يَتُوبُوا۟ يَكُ خَيْرًۭا لَّهُمْ ۖ وَإِن يَتَوَلَّوْا۟ يُعَذِّبْهُمُ ٱللَّهُ عَذَابًا أَلِيمًۭا فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ ۚ وَمَا لَهُمْ فِى ٱلْأَرْضِ مِن وَلِىٍّۢ وَلَا نَصِيرٍۢ",
    "en": "They swear by Allah that they said nothing blasphemous whereas they indeed blasphemed, and fell into unbelief after believing, and also had evil designs which they could not carry into effect. They are spiteful against Muslims for no other reason than that Allah and His Messenger have enriched them through His bounty! So, if they repent, it will be to their own good. But if they turn away, Allah will sternly punish them in this world and in the Hereafter. None in the world will be able to protect or help them.",
    "ur": "یہ لوگ خدا کی قسم کھا کھا کر کہتے ہیں کہ ہم نے وہ بات نہیں کہی، حالانکہ انہوں نے ضرور وہ کافرانہ بات کہی ہے وہ اسلام لانے کے بعد کفر کے مرتکب ہوئے اور انہوں نے وہ کچھ کرنے کا ارادہ کیا جسے کر نہ سکے یہ ان کا سارا غصہ اسی بات پر ہے نا کہ اللہ اور اس کے رسول نے اپنے فضل سے ان کو غنی کر دیا ہے! اب اگر یہ اپنی اس روش سے باز آ جائیں تو انہی کے لیے بہتر ہے اور اگر یہ باز نہ آئے تو اللہ ان کو نہایت درد ناک سزا دے گا، دنیا میں بھی اور آخرت میں بھی، اور زمین میں کوئی نہیں جو اِن کا حمایتی اور مددگار ہو"
  },
  {
    "id": 18,
    "reference": "9:104",
    "ar": "أَلَمْ يَعْلَمُوٓا۟ أَنَّ ٱللَّهَ هُوَ يَقْبَلُ ٱلتَّوْبَةَ عَنْ عِبَادِهِۦ وَيَأْخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "en": "Are they not aware that it is Allah Who accepts the repentance of His servants and accepts their alms, and that it is Allah Who is Oft-Relenting, Ever Merciful?",
    "ur": "کیا اِن لوگوں کو معلوم نہیں ہے کہ وہ اللہ ہی ہے جو اپنے بندوں کی توبہ قبول کرتا ہے اور ان کی خیرات کو قبولیت عطا فرماتا ہے، اور یہ کہ اللہ بہت معاف کرنے والا اور رحیم ہے؟"
  },
  {
    "id": 19,
    "reference": "9:112",
    "ar": "ٱلتَّٰٓئِبُونَ ٱلْعَٰبِدُونَ ٱلْحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلْءَامِرُونَ بِٱلْمَعْرُوفِ وَٱلنَّاهُونَ عَنِ ٱلْمُنكَرِ وَٱلْحَٰفِظُونَ لِحُدُودِ ٱللَّهِ ۗ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "en": "Those who constantly turn to Allah in repentance, who constantly worship Him, who celebrate His praise, who go about the world to serve His cause, who bow down to Him, who prostrate themselves before Him, who enjoin what is good and forbid what is evil, and who keep the limits set by Allah. Announce glad tidings to such believers.",
    "ur": "اللہ کی طرف بار بار پلٹنے والے، اُس کے بندگی بجا لانے والے، اُس کی تعریف کے گن گانے والے، اُس کی خاطر زمین میں گردش کرنے والے، اُس کے آگے رکوع اور سجدے کرنے والے، نیکی کا حکم دینے والے، بدی سے روکنے والے، اور اللہ کے حدود کی حفاظت کرنے والے، (اس شان کے ہوتے ہیں وہ مومن جو اللہ سے خرید و فروخت کا یہ معاملہ طے کرتے ہیں) اور اے نبیؐ ان مومنوں کو خوش خبری دے دو"
  },
  {
    "id": 20,
    "reference": "9:118",
    "ar": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُوا۟ حَتَّىٰٓ إِذَا ضَاقَتْ عَلَيْهِمُ ٱلْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوٓا۟ أَن لَّا مَلْجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوٓا۟ ۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "en": "And He also relented towards the three whose cases had been deferred. When the earth, for all its spaciousness, became constrained to them, and their own beings became a burden to them, and they realized that there was no refuge for them from Allah except in Him; He relented towards them that they may turn back to Him. Surely, it is Allah Who is Much Forgiving, Ever Merciful.",
    "ur": "اور اُن تینوں کو بھی اس نے معاف کیا جن کے معاملہ کو ملتوی کر دیا گیا تھا جب زمین اپنی ساری وسعت کے باوجود ان پر تنگ ہو گئی اور ان کی اپنی جانیں بھی ان پر بار ہونے لگیں اور انہوں نے جان لیا کہ اللہ سے بچنے کے لیے کوئی جائے پناہ خود اللہ ہی کے دامن رحمت کے سوا نہیں ہے، تو اللہ اپنی مہربانی سے ان کی طرف پلٹا تاکہ وہ اس کی طرف پلٹ آئیں، یقیناً وہ بڑا معاف کرنے والا اور رحیم ہے"
  },
  {
    "id": 21,
    "reference": "11:52",
    "ar": "وَيَٰقَوْمِ ٱسْتَغْفِرُوا۟ رَبَّكُمْ ثُمَّ تُوبُوٓا۟ إِلَيْهِ يُرْسِلِ ٱلسَّمَآءَ عَلَيْكُم مِّدْرَارًۭا وَيَزِدْكُمْ قُوَّةً إِلَىٰ قُوَّتِكُمْ وَلَا تَتَوَلَّوْا۟ مُجْرِمِينَ",
    "en": "My people! Ask your Lord for forgiveness and turn to Him in repentance. He will shower abundant rains upon you from the heaven, and will add strength to your strength. Do not turn away as those given to guilt.'",
    "ur": "اور اے میری قوم کے لوگو، اپنے رب سے معافی چاہو، پھر اس کی طرف پلٹو، وہ تم پر آسمان کے دہانے کھول دے گا اور تمہاری موجودہ قوت پر مزید قوت کا اضافہ کرے گا مجرموں کی طرح منہ نہ پھیرو\""
  },
  {
    "id": 22,
    "reference": "11:61",
    "ar": "۞ وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَٰلِحًۭا ۚ قَالَ يَٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُۥ ۖ هُوَ أَنشَأَكُم مِّنَ ٱلْأَرْضِ وَٱسْتَعْمَرَكُمْ فِيهَا فَٱسْتَغْفِرُوهُ ثُمَّ تُوبُوٓا۟ إِلَيْهِ ۚ إِنَّ رَبِّى قَرِيبٌۭ مُّجِيبٌۭ",
    "en": "And to Thamud We sent their brother Sali'h. He said: 'My people! Serve Allah; you have no god other than Him. He brought you into being out of the earth, and has made you dwell in it. So ask Him to forgive you, and do turn towards Him in repentance. Indeed My Lord is near, responsive to prayers.",
    "ur": "اور ثمود کی طرف ہم نے ان کے بھائی صالحؑ کو بھیجا اُس نے کہا \"اے میری قوم کے لوگو، اللہ کی بندگی کرو، اُ س کے سوا تمہارا کوئی خدا نہیں ہے وہی ہے جس نے تم کو زمین سے پیدا کیا ہے اور یہاں تم کو بسایا ہے لہٰذا تم اس سے معافی چاہو اور اس کی طرف پلٹ آؤ، یقیناً میرا رب قریب ہے اور وہ دعاؤں کا جواب دینے والا ہے\""
  },
  {
    "id": 23,
    "reference": "11:90",
    "ar": "وَٱسْتَغْفِرُوا۟ رَبَّكُمْ ثُمَّ تُوبُوٓا۟ إِلَيْهِ ۚ إِنَّ رَبِّى رَحِيمٌۭ وَدُودٌۭ",
    "en": "Seek the forgiveness of your Lord and turn to Him in repentance. Surely my Lord is Ever Merciful, Most Loving.",
    "ur": "دیکھو! اپنے رب سے معافی مانگو اور اس کی طرف پلٹ آؤ، بے شک میرا رب رحیم ہے اور اپنی مخلوق سے محبت رکھتا ہے\""
  },
  {
    "id": 24,
    "reference": "12:98",
    "ar": "قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّىٓ ۖ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ",
    "en": "He said: \"I shall pray to my Lord for your forgiveness, for He, and indeed He alone, is Ever Forgiving, Most Merciful.\"",
    "ur": "اُس نے کہا \"میں اپنے رب سے تمہارے لیے معافی کی درخواست کروں گا، وہ بڑا معاف کرنے والا اور رحیم ہے\""
  },
  {
    "id": 25,
    "reference": "13:27",
    "ar": "وَيَقُولُ ٱلَّذِينَ كَفَرُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ ءَايَةٌۭ مِّن رَّبِّهِۦ ۗ قُلْ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهْدِىٓ إِلَيْهِ مَنْ أَنَابَ",
    "en": "Those who have rejected (the message of Muhammad) say: \"Why has no sign been sent down upon him from his Lord?\" Tell them: \"Allah lets go astray those whom He wills, and guides to Himself those who turn to Him.\"",
    "ur": "یہ لوگ جنہوں نے (رسالت محمدیؐ کو ماننے سے) انکار کر دیا ہے کہتے ہیں \"اِس شخص پر اِس کے رب کی طرف سے کوئی نشانی کیوں نہ اتری\" کہو، اللہ جسے چاہتا ہے گمراہ کر دیتا ہے اور وہ اپنی طرف آنے کا راستہ اُسی کو دکھاتا ہے جو اُس کی طرف رجوع کرے"
  },
  {
    "id": 26,
    "reference": "16:119",
    "ar": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُوا۟ ٱلسُّوٓءَ بِجَهَٰلَةٍۢ ثُمَّ تَابُوا۟ مِنۢ بَعْدِ ذَٰلِكَ وَأَصْلَحُوٓا۟ إِنَّ رَبَّكَ مِنۢ بَعْدِهَا لَغَفُورٌۭ رَّحِيمٌ",
    "en": "But to those who commit evil out of ignorance and then repent and amend their ways, thereafter your Lord will be Much Forgiving, Most Merciful.",
    "ur": "البتہ جن لوگوں نے جہالت کی بنا پر برا عمل کیا اور پھر توبہ کر کے اپنے عمل کی اصلاح کر لی تو یقیناً توبہ و اصلاح کے بعد تیرا رب اُن کے لیے غفور اور رحیم ہے"
  },
  {
    "id": 27,
    "reference": "17:25",
    "ar": "رَّبُّكُمْ أَعْلَمُ بِمَا فِى نُفُوسِكُمْ ۚ إِن تَكُونُوا۟ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلْأَوَّٰبِينَ غَفُورًۭا",
    "en": "Your Lord is best aware of what is in your hearts. If you are righteous, He will indeed forgive those who relent and revert (to serving Allah).",
    "ur": "تمہارا رب خوب جانتا ہے کہ تمہارے دلوں میں کیا ہے اگر تم صالح بن کر رہو تو وہ ایسے سب لوگوں کے لیے در گزر کرنے والا ہے جو اپنے قصور پر متنبہ ہو کر بندگی کے رویے کی طرف پلٹ آئیں"
  },
  {
    "id": 28,
    "reference": "19:60",
    "ar": "إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًۭا فَأُو۟لَٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ وَلَا يُظْلَمُونَ شَيْـًۭٔا",
    "en": "except those who repent and believe and act righteously. Such shall enter Paradise and shall not be wronged at all.",
    "ur": "البتہ جو توبہ کر لیں اور ایمان لے آئیں اور نیک عملی اختیار کر لیں وہ جنّت میں داخل ہوں گے اور ان کی ذرّہ برابر حق تلفی نہ ہو گی"
  },
  {
    "id": 29,
    "reference": "20:82",
    "ar": "وَإِنِّى لَغَفَّارٌۭ لِّمَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًۭا ثُمَّ ٱهْتَدَىٰ",
    "en": "But I am indeed Most Forgiving to him who repents and believes and does righteous works and keeps to the Right Way.\"",
    "ur": "البتہ جو توبہ کر لے اور ایمان لائے اور نیک عمل کرے، پھر سیدھا چلتا رہے، اُس کے لیے میں بہت درگزر کرنے والا ہوں"
  },
  {
    "id": 30,
    "reference": "25:70",
    "ar": "إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلًۭا صَٰلِحًۭا فَأُو۟لَٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمْ حَسَنَٰتٍۢ ۗ وَكَانَ ٱللَّهُ غَفُورًۭا رَّحِيمًۭا",
    "en": "except the one who may have repented (after those sins) and have believed and done righteous works, for then Allah will change his evil deeds into good deeds, and He is very Forgiving and Merciful.",
    "ur": "اِلّا یہ کہ کوئی (ان گناہوں کے بعد) توبہ کر چکا ہو اور ایمان لا کر عمل صالح کرنے لگا ہو ایسے لوگوں کی برائیوں کو اللہ بھلائیوں سے بدل دے گا اور وہ بڑا غفور رحیم ہے"
  },
  {
    "id": 31,
    "reference": "25:71",
    "ar": "وَمَن تَابَ وَعَمِلَ صَٰلِحًۭا فَإِنَّهُۥ يَتُوبُ إِلَى ٱللَّهِ مَتَابًۭا",
    "en": "In fact, the one who repents and does righteous deeds, returns to Allah as one ightly should. -",
    "ur": "جو شخص توبہ کر کے نیک عملی اختیار کرتا ہے وہ تو اللہ کی طرف پلٹ آتا ہے جیسا کہ پلٹنے کا حق ہے"
  },
  {
    "id": 32,
    "reference": "27:11",
    "ar": "إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسْنًۢا بَعْدَ سُوٓءٍۢ فَإِنِّى غَفُورٌۭ رَّحِيمٌۭ",
    "en": "except he who has committed some wrong. But if he substitutes good in place of evil, I am Most Forgiving, Most Compassionate.",
    "ur": "اِلّا یہ کہ کسی نے قصور کیا ہو پھر اگر برائی کے بعد اُس نے بھَلائی سے اپنے فعل کو بدل لیا تو میں معاف کرنے والا مہربان ہوں"
  },
  {
    "id": 33,
    "reference": "28:16",
    "ar": "قَالَ رَبِّ إِنِّى ظَلَمْتُ نَفْسِى فَٱغْفِرْ لِى فَغَفَرَ لَهُۥٓ ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ",
    "en": "Then he prayed: \"My Lord! I have indeed inflicted wrong on myself, so do forgive me,\" wherefore Allah forgave him for He is Ever Forgiving, Most Merciful.",
    "ur": "پھر وہ کہنے لگا \"اے میرے رب، مَیں نے اپنے نفس پر بڑا ظلم کر ڈالا، میری مغفرت فرما دے\" چنانچہ اللہ نے اس کی مغفرت فرما دی، وہ غفور رحیم ہے"
  },
  {
    "id": 34,
    "reference": "28:67",
    "ar": "فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًۭا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلْمُفْلِحِينَ",
    "en": "But those who repented and believed and acted righteously, they will perhaps be among those who will prosper there.",
    "ur": "البتہ جس نے آج توبہ کر لی اور ایمان لے آیا اور نیک عمل کیے وہی یہ توقع کر سکتا ہے کہ وہاں فلاح پانے والوں میں سے ہو گا"
  },
  {
    "id": 35,
    "reference": "30:31",
    "ar": "۞ مُنِيبِينَ إِلَيْهِ وَٱتَّقُوهُ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَلَا تَكُونُوا۟ مِنَ ٱلْمُشْرِكِينَ",
    "en": "(Adhere to the True Faith and) turn to Him, and hold Him in awe, and establish Prayer, and do not be of those who associate others with Allah in His Divinity,",
    "ur": "(قائم ہو جاؤ اِس بات پر) اللہ کی طرف رجوع کرتے ہوئے، اور ڈرو اُس سے، اور نماز قائم کرو، اور نہ ہو جاؤ اُن مشرکین میں سے"
  },
  {
    "id": 36,
    "reference": "39:60",
    "ar": "وَيَوْمَ ٱلْقِيَٰمَةِ تَرَى ٱلَّذِينَ كَذَبُوا۟ عَلَى ٱللَّهِ وُجُوهُهُم مُّسْوَدَّةٌ ۚ أَلَيْسَ فِى جَهَنَّمَ مَثْوًۭى لِّلْمُتَكَبِّرِينَ",
    "en": "On the Day of Resurrection you shall see that the faces of those who had lied against Allah have turned dark. Is Hell not vast enough to provide a room to the vainglorious?",
    "ur": "آج جن لوگوں نے خدا پر جھوٹ باندھے ہیں قیامت کے روز تم دیکھو گے کہ ان کے منہ کالے ہوں گے کیا جہنم میں متکبروں کے لیے کافی جگہ نہیں ہے؟"
  },
  {
    "id": 37,
    "reference": "39:17",
    "ar": "وَٱلَّذِينَ ٱجْتَنَبُوا۟ ٱلطَّٰغُوتَ أَن يَعْبُدُوهَا وَأَنَابُوٓا۟ إِلَى ٱللَّهِ لَهُمُ ٱلْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ",
    "en": "(On the other hand), good tidings await those who eschew serving false gods and penitently return to Allah. (O Prophet), give good tidings to My servants,",
    "ur": "بخلاف اس کے جن لوگوں نے طاغوت کی بندگی سے اجتناب کیا اور اللہ کی طرف رجوع کر لیا اُن کے لیے خوشخبری ہے پس (اے نبیؐ) بشارت دے دو میرے اُن بندوں کو"
  },
  {
    "id": 38,
    "reference": "39:54",
    "ar": "وَأَنِيبُوٓا۟ إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا۟ لَهُۥ مِن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ ثُمَّ لَا تُنصَرُونَ",
    "en": "Turn to your Lord and surrender yourselves to Him before the chastisement over-takes you; for then you will receive no help.",
    "ur": "پلٹ آؤ اپنے رب کی طرف اور مطیع بن جاؤ اُس کے قبل اِس کے کہ تم پر عذاب آ جائے اور پھر کہیں سے تمہیں مدد نہ مل سکے"
  },
  {
    "id": 39,
    "reference": "40:3",
    "ar": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوْبِ شَدِيدِ ٱلْعِقَابِ ذِى ٱلطَّوْلِ ۖ لَآ إِلَٰهَ إِلَّا هُوَ ۖ إِلَيْهِ ٱلْمَصِيرُ",
    "en": "the Forgiver of sins, the Accepter of repentance, the Stern in retribution, the Bountiful. There is no god but He. To Him are all destined to return.",
    "ur": "گناہ معاف کرنے والا اور توبہ قبول کرنے والا ہے، سخت سزا دینے والا اور بڑا صاحب فضل ہے کوئی معبود اس کے سوا نہیں، اُسی کی طرف سب کو پلٹنا ہے"
  },
  {
    "id": 40,
    "reference": "42:25",
    "ar": "وَهُوَ ٱلَّذِى يَقْبَلُ ٱلتَّوْبَةَ عَنْ عِبَادِهِۦ وَيَعْفُوا۟ عَنِ ٱلسَّيِّـَٔاتِ وَيَعْلَمُ مَا تَفْعَلُونَ",
    "en": "He it is Who accepts repentance from His servants and forgives sins and knows all what you do,",
    "ur": "وہی ہے جو اپنے بندوں سے توبہ قبول کرتا ہے اور برائیوں سے درگزر کرتا ہے، حالانکہ تم لوگوں کے سب افعال کا اُ سے علم ہے"
  },
  {
    "id": 41,
    "reference": "50:32",
    "ar": "هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍۢ",
    "en": "it will be said: “This is what you were promised, a promise made to everyone who turned much (to Allah) and was watchful of his conduct,",
    "ur": "ارشاد ہوگا \"یہ ہے وہ چیز جس کا تم سے وعدہ کیا جاتا تھا، ہر اُس شخص کے لیے جو بہت رجوع کرنے والا اور بڑی نگہداشت کرنے والا تھا"
  },
  {
    "id": 42,
    "reference": "66:8",
    "ar": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ تُوبُوٓا۟ إِلَى ٱللَّهِ تَوْبَةًۭ نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّـَٔاتِكُمْ وَيُدْخِلَكُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ يَوْمَ لَا يُخْزِى ٱللَّهُ ٱلنَّبِىَّ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَٰنِهِمْ يَقُولُونَ رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "en": "Believers, turn to Allah in sincere repentance; maybe your Lord will expunge your evil deeds and admit you to the Gardens beneath which rivers flow. This will be on the Day when Allah will not disgrace the Prophet and those who have embraced faith and are with him; their light will be running before them and on their right hands, and they will say: “Our Lord, perfect for us our light and forgive us. Surely You have power over everything.”",
    "ur": "اے لوگو جو ایمان لائے ہو، اللہ سے توبہ کرو، خالص توبہ، بعید نہیں کہ اللہ تمہاری برائیاں تم سے دور کر دے اور تمہیں ایسی جنتوں میں داخل فرما دے جن کے نیچے نہریں بہہ رہی ہوں گی یہ وہ دن ہوگا جب اللہ اپنے نبی کو اور اُن لوگوں جو اس کے ساتھ ایمان لائے ہیں رسوا نہ کرے گا اُن کا نور اُن کے آگے آگے اور ان کے دائیں جانب دوڑ رہا ہوگا اور وہ کہہ رہے ہوں گے کہ اے ہمارے رب، ہمارا نور ہمارے لیے مکمل کر دے اور ہم سے درگزر فرما، تو ہر چیز پر قدرت رکھتا ہے"
  },
  {
    "id": 44,
    "reference": "71:10",
    "ar": "فَقُلْتُ ٱسْتَغْفِرُوا۟ رَبَّكُمْ إِنَّهُۥ كَانَ غَفَّارًۭا",
    "en": "I said to them: “Ask forgiveness from your Lord; surely He is Most Forgiving.",
    "ur": "میں نے کہا اپنے رب سے معافی مانگو، بے شک وہ بڑا معاف کرنے والا ہے"
  }
]