[
  {
    "id": 1,
    "reference": "2:222",
    "ar": "وَيَسْـَٔلُونَكَ عَنِ ٱلْمَحِيضِ ۖ قُلْ هُوَ أَذًۭى فَٱعْتَزِلُوا۟ ٱلنِّسَآءَ فِى ٱلْمَحِيضِ ۖ وَلَا تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ ۖ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ ٱللَّهُ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلْمُتَطَهِّرِينَ",
    "en": "They ask about the monthly course. Say, \"It is a state of impurity; so keep apart from women during their monthly course and do not go near them until they are clean. When they have cleansed themselves, then you may go to them in the manner Allah has enjoined you.\" Most surely Allah loves those people who refrain from evil and keep themselves pure and clean.",
    "ur": "پوچھتے ہیں: حیض کا کیا حکم ہے؟ کہو: وہ ایک گندگی کی حالت ہے اس میں عورتوں سے الگ رہو اور ان کے قریب نہ جاؤ، جب تک کہ وہ پاک صاف نہ ہو جائیں پھر جب وہ پاک ہو جائیں، تو اُن کے پاس جاؤ اُس طرح جیسا کہ اللہ نے تم کو حکم دیا ہے اللہ اُن لوگوں کو پسند کرتا ہے، جو بدی سے باز رہیں اور پاکیزگی اختیار کریں"
  },
  {
    "id": 2,
    "reference": "4:19",
    "ar": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا يَحِلُّ لَكُمْ أَن تَرِثُوا۟ ٱلنِّسَآءَ كَرْهًۭا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا۟ بِبَعْضِ مَآ ءَاتَيْتُمُوهُنَّ إِلَّآ أَن يَأْتِينَ بِفَٰحِشَةٍۢ مُّبَيِّنَةٍۢ ۚ وَعَاشِرُوهُنَّ بِٱلْمَعْرُوفِ ۚ فَإِن كَرِهْتُمُوهُنَّ فَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًۭٔا وَيَجْعَلَ ٱللَّهُ فِيهِ خَيْرًۭا كَثِيرًۭا",
    "en": "Believers! It is not lawful for you to become heirs to women against their will. It is not lawful that you should put constraint upon them that you may take away anything of what you have given them; (you may not put constraint upon them) unless they are guilty of brazenly immoral conduct. Live with your wives in a good manner. If you dislike them in any manner, it may be that you dislike something in which Allah has placed much good for you.",
    "ur": "اے لوگو جو ایمان لائے ہو، تمہارے لیے یہ حلال نہیں ہے کہ زبردستی عورتوں کے وارث بن بیٹھو اور نہ یہ حلال ہے کہ انہیں تنگ کر کے اُس مہر کا کچھ حصہ اڑا لینے کی کوشش کرو جو تم انہیں دے چکے ہو ہاں اگر وہ کسی صریح بد چلنی کی مرتکب ہو ں (تو ضرور تمہیں تنگ کرنے کا حق ہے) ان کے ساتھ بھلے طریقہ سے زندگی بسر کرو اگر وہ تمہیں ناپسند ہوں تو ہو سکتا ہے کہ ایک چیز تمہیں پسند نہ ہو مگر اللہ نے اُسی میں بہت کچھ بھلائی رکھ دی ہو"
  },
  {
    "id": 3,
    "reference": "7:189",
    "ar": "۞ هُوَ ٱلَّذِى خَلَقَكُم مِّن نَّفْسٍۢ وَٰحِدَةٍۢ وَجَعَلَ مِنْهَا زَوْجَهَا لِيَسْكُنَ إِلَيْهَا ۖ فَلَمَّا تَغَشَّىٰهَا حَمَلَتْ حَمْلًا خَفِيفًۭا فَمَرَّتْ بِهِۦ ۖ فَلَمَّآ أَثْقَلَت دَّعَوَا ٱللَّهَ رَبَّهُمَا لَئِنْ ءَاتَيْتَنَا صَٰلِحًۭا لَّنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
    "en": "It is He - Allah -Who created you from a single being, and out of it He made its mate, that he may find comfort in her. And when he covers her, she bears a light burden and goes about with it. Then, when she grows heavy, they pray to their Lord: 'If You bestow upon us a healthy child, we will surely give thanks.'",
    "ur": "وہ اللہ ہی ہے جس نے تمہیں ایک جان سے پیدا کیا اور اسی کی جنس سے اس کا جوڑا بنایا تاکہ اس کے پاس سکون حاصل کرے پھر جب مرد نے عورت کو ڈھانک لیا تو اسے ایک خفیف سا حمل رہ گیا جسے لیے لیے وہ چلتی پھرتی رہی پھر جب وہ بوجھل ہو گئی تو دونوں نے مل کر اللہ، اپنے رب سے دعا کی کہ اگر تو نے ہم کو اچھا سا بچہ دیا تو ہم تیرے شکر گزار ہوں گے"
  },
  {
    "id": 4,
    "reference": "24:30",
    "ar": "قُل لِّلْمُؤْمِنِينَ يَغُضُّوا۟ مِنْ أَبْصَٰرِهِمْ وَيَحْفَظُوا۟ فُرُوجَهُمْ ۚ ذَٰلِكَ أَزْكَىٰ لَهُمْ ۗ إِنَّ ٱللَّهَ خَبِيرٌۢ بِمَا يَصْنَعُونَ",
    "en": "And O Prophet, enjoin the Believing men to restrain their gaze and guard their private parts. This is a more righteous way for them: Allah has knowledge of what they do.",
    "ur": "اے نبیؐ، مومن مردوں سے کہو کہ اپنی نظریں بچا کر رکھیں اور اپنی شرمگاہوں کی حفاظت کریں، یہ اُن کے لیے زیادہ پاکیزہ طریقہ ہے، جو کچھ وہ کرتے ہیں اللہ اُس سے باخبر رہتا ہے"
  },
  {
    "id": 5,
    "reference": "31:14",
    "ar": "وَوَصَّيْنَا ٱلْإِنسَٰنَ بِوَٰلِدَيْهِ حَمَلَتْهُ أُمُّهُۥ وَهْنًا عَلَىٰ وَهْنٍۢ وَفِصَٰلُهُۥ فِى عَامَيْنِ أَنِ ٱشْكُرْ لِى وَلِوَٰلِدَيْكَ إِلَىَّ ٱلْمَصِيرُ",
    "en": "We enjoined upon man to be dutiful to his parents. His mother bore him in weakness upon weakness, and his weaning lasted two years. (We, therefore, enjoined upon him): “Give thanks to Me and to your parents. To Me is your ultimate return.",
    "ur": "اور حقیقت یہ ہے کہ ہم نے انسان کو اپنے والدین کا حق پہچاننے کی خود تاکید کی ہے اُس کی ماں نے ضعف پر ضعف اُٹھا کر اسے اپنے پیٹ میں رکھا اور دو سال اُس کا دودھ چھوٹنے میں لگے (اِسی لیے ہم نے اُس کو نصیحت کی کہ) میرا شکر کر اور اپنے والدین کا شکر بجا لا، میری ہی طرف تجھے پلٹنا ہے"
  },
  {
    "id": 6,
    "reference": "31:34",
    "ar": "إِنَّ ٱللَّهَ عِندَهُۥ عِلْمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلْغَيْثَ وَيَعْلَمُ مَا فِى ٱلْأَرْحَامِ ۖ وَمَا تَدْرِى نَفْسٌۭ مَّاذَا تَكْسِبُ غَدًۭا ۖ وَمَا تَدْرِى نَفْسٌۢ بِأَىِّ أَرْضٍۢ تَمُوتُ ۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٌۢ",
    "en": "Surely Allah alone has the knowledge of the Hour. It is He Who sends down the rain and knows what is in the wombs, although no person knows what he will earn tomorrow, nor does he know in which land he will die. Indeed, Allah is All-Knowing, All-Aware.",
    "ur": "اُس گھڑی کا علم اللہ ہی کے پاس ہے، وہی بارش برساتا ہے، وہی جانتا ہے کہ ماؤں کے پیٹوں میں کیا پرورش پا رہا ہے، کوئی متنفس نہیں جانتا کہ کل وہ کیا کمائی کرنے والا ہے اور نہ کسی شخص کو یہ خبر ہے کہ کس سرزمین میں اس کی موت آنی ہے، اللہ ہی سب کچھ جاننے والا اور باخبر ہے"
  },
  {
    "id": 7,
    "reference": "33:58",
    "ar": "وَٱلَّذِينَ يُؤْذُونَ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ بِغَيْرِ مَا ٱكْتَسَبُوا۟ فَقَدِ ٱحْتَمَلُوا۟ بُهْتَٰنًۭا وَإِثْمًۭا مُّبِينًۭا",
    "en": "Those who cause hurt to believing men and to believing women have invited upon themselves a calumny and a manifest sin.",
    "ur": "اور جو لوگ مومن مردوں اور عورتوں کو بے قصور اذیت دیتے ہیں اُنہوں نے ایک بڑے بہتان اور صریح گناہ کا وبال اپنے سر لے لیا ہے"
  },
  {
    "id": 8,
    "reference": "39:6",
    "ar": "خَلَقَكُم مِّن نَّفْسٍۢ وَٰحِدَةٍۢ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنزَلَ لَكُم مِّنَ ٱلْأَنْعَٰمِ ثَمَٰنِيَةَ أَزْوَٰجٍۢ ۚ يَخْلُقُكُمْ فِى بُطُونِ أُمَّهَٰتِكُمْ خَلْقًۭا مِّنۢ بَعْدِ خَلْقٍۢ فِى ظُلُمَٰتٍۢ ثَلَٰثٍۢ ۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ لَهُ ٱلْمُلْكُ ۖ لَآ إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ",
    "en": "He it is Who created you from a single being, and He it is Who made from it its mate. He it is Who created for you eight heads of cattle in pairs. He creates you in your mothers' wombs, giving you one form after another in threefold depths of darkness. That, then, is Allah, your Lord. His is the kingdom. There is no god but He. So, whence are you being turned astray?",
    "ur": "اُسی نے تم کو ایک جان سے پیدا کیا، پھر وہی ہے جس نے اُس جان سے اس کا جوڑا بنایا اور اسی نے تمہارے لیے مویشیوں میں سے آٹھ نر و مادہ پیدا کیے وہ تمہاری ماؤں کے پیٹوں میں تین تین تاریک پردوں کے اندر تمہیں ایک کے بعد ایک شکل دیتا چلا جاتا ہے یہی اللہ (جس کے یہ کام ہیں) تمہارا رب ہے، بادشاہی اسی کی ہے، کوئی معبود اس کے سوا نہیں ہے، پھر تم کدھر سے پھرائے جا رہے ہو؟"
  },
  {
    "id": 9,
    "reference": "41:47",
    "ar": "۞ إِلَيْهِ يُرَدُّ عِلْمُ ٱلسَّاعَةِ ۚ وَمَا تَخْرُجُ مِن ثَمَرَٰتٍۢ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَآءِى قَالُوٓا۟ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٍۢ",
    "en": "The knowledge of the Hour rests solely with Him. Not a fruit comes forth from its sheath, nor does any female conceive nor give birth to a child but it is in His knowledge. On that Day He will call out to them: “Where are those associates of Mine?” They will answer: “We have declared to You that none of us can bear witness to that.”",
    "ur": "اُس ساعت کا علم اللہ ہی کی طرف راجع ہوتا ہے، وہی اُن سارے پھلوں کو جانتا ہے جو اپنے شگوفوں میں سے نکلتے ہیں، اسی کو معلوم ہے کہ کونسی مادہ حاملہ ہوئی ہے اور کس نے بچہ جنا ہے پھر جس روز وہ اِن لوگوں کو پکارے گا کہ کہاں ہیں میرے وہ شریک؟ یہ کہیں گے، \"ہم عرض کر چکے ہیں، آج ہم میں سے کوئی اِس کی گواہی دینے والا نہیں ہے\""
  },
  {
    "id": 10,
    "reference": "46:15",
    "ar": "وَوَصَّيْنَا ٱلْإِنسَٰنَ بِوَٰلِدَيْهِ إِحْسَٰنًا ۖ حَمَلَتْهُ أُمُّهُۥ كُرْهًۭا وَوَضَعَتْهُ كُرْهًۭا ۖ وَحَمْلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهْرًا ۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرْبَعِينَ سَنَةًۭ قَالَ رَبِّ أَوْزِعْنِىٓ أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وَٰلِدَىَّ وَأَنْ أَعْمَلَ صَٰلِحًۭا تَرْضَىٰهُ وَأَصْلِحْ لِى فِى ذُرِّيَّتِىٓ ۖ إِنِّى تُبْتُ إِلَيْكَ وَإِنِّى مِنَ ٱلْمُسْلِمِينَ",
    "en": "We have enjoined man to be kind to his parents. In pain did his mother bear him and in pain did she give birth to him. The carrying of the child to his weaning is a period of thirty months. And when he is grown to full maturity and reaches the age of forty, he prays: “My Lord, dispose me that I may give thanks for the bounty that You have bestowed upon me and my parents, and dispose me that I may do righteous deeds that would please You, and also make my descendants righteous. I repent to You, and I am one of those who surrender themselves to You.”",
    "ur": "ہم نے انسان کو ہدایت کی کہ وہ اپنے والدین کے ساتھ نیک بر تاؤ کرے اُس کی ماں نے مشقت اٹھا کر اسے پیٹ میں رکھا اور مشقت اٹھا کر ہی اس کو جنا، اور اس کے حمل اور دودھ چھڑانے میں تیس مہینے لگ گئے یہاں تک کہ جب وہ اپنی پوری طاقت کو پہنچا اور چالیس سال کا ہو گیا تو اس نے کہا \"اے میرے رب، مجھے توفیق دے کہ میں تیری اُن نعمتوں کا شکر ادا کروں جو تو نے مجھے اور میرے والدین کو عطا فرمائیں، اور ایسا نیک عمل کروں جس سے تو راضی ہو، اور میری اولاد کو بھی نیک بنا کر مجھے سُکھ دے، میں تیرے حضور توبہ کرتا ہوں اور تابع فرمان (مسلم) بندوں میں سے ہوں\""
  }
]